zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cx_bz/bz62/pic32cx2051bz62064-pinctrl.h
/* pa5_tc9wo0g4_in */
#define PA5_TC9WO0G4_IN        MCHP_PINMUX(a, 5, 0x160, 18, periph)
/* pa5_tc9wo0_out */
#define PA5_TC9WO0_OUT         MCHP_PINMUX(a, 5, 0x24c, 29, periph)
/* pa5_tc9wo1g3_in */
#define PA5_TC9WO1G3_IN        MCHP_PINMUX(a, 5, 0x164, 15, periph)
/* pa5_tc9wo1_out */
#define PA5_TC9WO1_OUT         MCHP_PINMUX(a, 5, 0x248, 33, periph)
/* pa5_tcc0wo0_out */
#define PA5_TCC0WO0_OUT        MCHP_PINMUX(a, 5, 0x248, 18, periph)
/* pa5_tcc0wo1_out */
#define PA5_TCC0WO1_OUT        MCHP_PINMUX(a, 5, 0x24c, 15, periph)
/* pa5_tcc0wo2_out */
#define PA5_TCC0WO2_OUT        MCHP_PINMUX(a, 5, 0x248, 17, periph)
/* pa5_tcc0wo3_out */
#define PA5_TCC0WO3_OUT        MCHP_PINMUX(a, 5, 0x24c, 14, periph)
/* pa5_tcc0wo4_out */
#define PA5_TCC0WO4_OUT        MCHP_PINMUX(a, 5, 0x248, 19, periph)
/* pa5_tcc0wo5_out */
#define PA5_TCC0WO5_OUT        MCHP_PINMUX(a, 5, 0x24c, 16, periph)
/* pa5_tcc1wo0_out */
#define PA5_TCC1WO0_OUT        MCHP_PINMUX(a, 5, 0x248, 21, periph)
/* pa5_tcc1wo1_out */
#define PA5_TCC1WO1_OUT        MCHP_PINMUX(a, 5, 0x24c, 18, periph)
/* pa5_tcc1wo2_out */
#define PA5_TCC1WO2_OUT        MCHP_PINMUX(a, 5, 0x248, 20, periph)
/* pa5_tcc1wo3_out */
#define PA5_TCC1WO3_OUT        MCHP_PINMUX(a, 5, 0x24c, 17, periph)
/* pa5_tcc1wo4_out */
#define PA5_TCC1WO4_OUT        MCHP_PINMUX(a, 5, 0x248, 22, periph)
/* pa5_tcc1wo5_out */
#define PA5_TCC1WO5_OUT        MCHP_PINMUX(a, 5, 0x24c, 19, periph)
/* pa5_tcc2wo0_out */
#define PA5_TCC2WO0_OUT        MCHP_PINMUX(a, 5, 0x248, 23, periph)
/* pa5_tcc2wo1_out */
#define PA5_TCC2WO1_OUT        MCHP_PINMUX(a, 5, 0x24c, 20, periph)
/* pa5_tstbus1_out */
#define PA5_TSTBUS1_OUT        MCHP_PINMUX(a, 5, 0x248, 38, periph)
/* pa5_tstbus2_out */
#define PA5_TSTBUS2_OUT        MCHP_PINMUX(a, 5, 0x24c, 34, periph)
/* pa5_tstbus6_out */
#define PA5_TSTBUS6_OUT        MCHP_PINMUX(a, 5, 0x24c, 35, periph)
/* pa5_tstbus10_out */
#define PA5_TSTBUS10_OUT       MCHP_PINMUX(a, 5, 0x248, 39, periph)
/* pa6_accmpten_in */
#define PA6_ACCMPTEN_IN        MCHP_PINMUX(a, 6, 0x18c, 2, periph)
/* pa6_ac_cmp1_out */
#define PA6_AC_CMP1_OUT        MCHP_PINMUX(a, 6, 0x258, 36, periph)
/* pa6_ac_cmptout_out */
#define PA6_AC_CMPTOUT_OUT     MCHP_PINMUX(a, 6, 0x258, 37, periph)
/* pa6_can1_tx_out */
#define PA6_CAN1_TX_OUT        MCHP_PINMUX(a, 6, 0x258, 38, periph)
/* pa6_cclin0_in */
#define PA6_CCLIN0_IN          MCHP_PINMUX(a, 6, 0xb4, 2, periph)
/* pa6_cclin3_in */
#define PA6_CCLIN3_IN          MCHP_PINMUX(a, 6, 0xc0, 2, periph)
/* pa6_cclo1_out */
#define PA6_CCLO1_OUT          MCHP_PINMUX(a, 6, 0x258, 1, periph)
/* pa6_coexwlanact_in */
#define PA6_COEXWLANACT_IN     MCHP_PINMUX(a, 6, 0x194, 13, periph)
/* pa6_coex_bt_state_out */
#define PA6_COEX_BT_STATE_OUT  MCHP_PINMUX(a, 6, 0x254, 37, periph)
/* pa6_extint0_in */
#define PA6_EXTINT0_IN         MCHP_PINMUX(a, 6, 0x0, 2, periph)
/* pa6_extint3_in */
#define PA6_EXTINT3_IN         MCHP_PINMUX(a, 6, 0xc, 13, periph)
/* pa6_fectrl1_out */
#define PA6_FECTRL1_OUT        MCHP_PINMUX(a, 6, 0x254, 35, periph)
/* pa6_fectrl2_out */
#define PA6_FECTRL2_OUT        MCHP_PINMUX(a, 6, 0x254, 36, periph)
/* pa6_fectrl3_out */
#define PA6_FECTRL3_OUT        MCHP_PINMUX(a, 6, 0x258, 39, periph)
/* pa6_fectrl5_out */
#define PA6_FECTRL5_OUT        MCHP_PINMUX(a, 6, 0x258, 40, periph)
/* pa6_nmi_in */
#define PA6_NMI_IN             MCHP_PINMUX(a, 6, 0x3c, 13, periph)
/* pa6_qd0_in */
#define PA6_QD0_IN             MCHP_PINMUX(a, 6, 0xa0, 13, periph)
/* pa6_qd0_out */
#define PA6_QD0_OUT            MCHP_PINMUX(a, 6, 0x258, 33, periph)
/* pa6_qd1_in */
#define PA6_QD1_IN             MCHP_PINMUX(a, 6, 0xa4, 2, periph)
/* pa6_qd1_out */
#define PA6_QD1_OUT            MCHP_PINMUX(a, 6, 0x254, 30, periph)
/* pa6_qd2_out */
#define PA6_QD2_OUT            MCHP_PINMUX(a, 6, 0x254, 29, periph)
/* pa6_qd3_out */
#define PA6_QD3_OUT            MCHP_PINMUX(a, 6, 0x254, 28, periph)
/* pa6_qeiccmp0_out */
#define PA6_QEICCMP0_OUT       MCHP_PINMUX(a, 6, 0x254, 31, periph)
/* pa6_qeihome0g1_in */
#define PA6_QEIHOME0G1_IN      MCHP_PINMUX(a, 6, 0x16c, 2, periph)
/* pa6_qeiqea0g4_in */
#define PA6_QEIQEA0G4_IN       MCHP_PINMUX(a, 6, 0x180, 13, periph)
/* pa6_qeiqeb0g4_in */
#define PA6_QEIQEB0G4_IN       MCHP_PINMUX(a, 6, 0x184, 13, periph)
/* pa6_qspics_out */
#define PA6_QSPICS_OUT         MCHP_PINMUX(a, 6, 0x254, 27, periph)
/* pa6_qspi_sck_out */
#define PA6_QSPI_SCK_OUT       MCHP_PINMUX(a, 6, 0x25c, 7, periph)
/* pa6_refi_in */
#define PA6_REFI_IN            MCHP_PINMUX(a, 6, 0xb0, 7, periph)
/* pa6_refo1_out */
#define PA6_REFO1_OUT          MCHP_PINMUX(a, 6, 0x25c, 8, periph)
/* pa6_refo2_out */
#define PA6_REFO2_OUT          MCHP_PINMUX(a, 6, 0x25c, 9, periph)
/* pa6_refo3_out */
#define PA6_REFO3_OUT          MCHP_PINMUX(a, 6, 0x25c, 10, periph)
/* pa6_refo4_out */
#define PA6_REFO4_OUT          MCHP_PINMUX(a, 6, 0x25c, 11, periph)
/* pa6_scom0p0_out */
#define PA6_SCOM0P0_OUT        MCHP_PINMUX(a, 6, 0x258, 3, periph)
/* pa6_scom0p1_in */
#define PA6_SCOM0P1_IN         MCHP_PINMUX(a, 6, 0x44, 7, periph)
/* pa6_scom0p1_out */
#define PA6_SCOM0P1_OUT        MCHP_PINMUX(a, 6, 0x25c, 1, periph)
/* pa6_scom0p2_in */
#define PA6_SCOM0P2_IN         MCHP_PINMUX(a, 6, 0x48, 13, periph)
/* pa6_scom0p2_out */
#define PA6_SCOM0P2_OUT        MCHP_PINMUX(a, 6, 0x254, 2, periph)
/* pa6_scom0p3_in */
#define PA6_SCOM0P3_IN         MCHP_PINMUX(a, 6, 0x4c, 2, periph)
/* pa6_scom0p3_out */
#define PA6_SCOM0P3_OUT        MCHP_PINMUX(a, 6, 0x254, 1, periph)
/* pa6_scom1p0_out */
#define PA6_SCOM1P0_OUT        MCHP_PINMUX(a, 6, 0x254, 3, periph)
/* pa6_scom1p1_in */
#define PA6_SCOM1P1_IN         MCHP_PINMUX(a, 6, 0x54, 7, periph)
/* pa6_scom1p1_out */
#define PA6_SCOM1P1_OUT        MCHP_PINMUX(a, 6, 0x25c, 2, periph)
/* pa6_scom1p2_in */
#define PA6_SCOM1P2_IN         MCHP_PINMUX(a, 6, 0x58, 2, periph)
/* pa6_scom1p2_out */
#define PA6_SCOM1P2_OUT        MCHP_PINMUX(a, 6, 0x254, 4, periph)
/* pa6_scom1p3_out */
#define PA6_SCOM1P3_OUT        MCHP_PINMUX(a, 6, 0x258, 4, periph)
/* pa6_scom2p0_out */
#define PA6_SCOM2P0_OUT        MCHP_PINMUX(a, 6, 0x258, 7, periph)
/* pa6_scom2p1_in */
#define PA6_SCOM2P1_IN         MCHP_PINMUX(a, 6, 0x64, 7, periph)
/* pa6_scom2p1_out */
#define PA6_SCOM2P1_OUT        MCHP_PINMUX(a, 6, 0x25c, 3, periph)
/* pa6_scom2p2_in */
#define PA6_SCOM2P2_IN         MCHP_PINMUX(a, 6, 0x68, 13, periph)
/* pa6_scom2p2_out */
#define PA6_SCOM2P2_OUT        MCHP_PINMUX(a, 6, 0x254, 6, periph)
/* pa6_scom2p3_in */
#define PA6_SCOM2P3_IN         MCHP_PINMUX(a, 6, 0x6c, 2, periph)
/* pa6_scom2p3_out */
#define PA6_SCOM2P3_OUT        MCHP_PINMUX(a, 6, 0x254, 5, periph)
/* pa6_scom3p0_out */
#define PA6_SCOM3P0_OUT        MCHP_PINMUX(a, 6, 0x254, 7, periph)
/* pa6_scom3p1_in */
#define PA6_SCOM3P1_IN         MCHP_PINMUX(a, 6, 0x74, 7, periph)
/* pa6_scom3p1_out */
#define PA6_SCOM3P1_OUT        MCHP_PINMUX(a, 6, 0x25c, 4, periph)
/* pa6_scom3p2_in */
#define PA6_SCOM3P2_IN         MCHP_PINMUX(a, 6, 0x78, 2, periph)
/* pa6_scom3p2_out */
#define PA6_SCOM3P2_OUT        MCHP_PINMUX(a, 6, 0x254, 8, periph)
/* pa6_scom3p3_out */
#define PA6_SCOM3P3_OUT        MCHP_PINMUX(a, 6, 0x258, 8, periph)
/* pa6_scom4p0_out */
#define PA6_SCOM4P0_OUT        MCHP_PINMUX(a, 6, 0x258, 11, periph)
/* pa6_scom4p1_in */
#define PA6_SCOM4P1_IN         MCHP_PINMUX(a, 6, 0x84, 7, periph)
/* pa6_scom4p1_out */
#define PA6_SCOM4P1_OUT        MCHP_PINMUX(a, 6, 0x25c, 5, periph)
/* pa6_scom4p2_in */
#define PA6_SCOM4P2_IN         MCHP_PINMUX(a, 6, 0x88, 13, periph)
/* pa6_scom4p2_out */
#define PA6_SCOM4P2_OUT        MCHP_PINMUX(a, 6, 0x254, 10, periph)
/* pa6_scom4p3_in */
#define PA6_SCOM4P3_IN         MCHP_PINMUX(a, 6, 0x8c, 2, periph)
/* pa6_scom4p3_out */
#define PA6_SCOM4P3_OUT        MCHP_PINMUX(a, 6, 0x254, 9, periph)
/* pa6_scom5p0_out */
#define PA6_SCOM5P0_OUT        MCHP_PINMUX(a, 6, 0x254, 11, periph)
/* pa6_scom5p1_in */
#define PA6_SCOM5P1_IN         MCHP_PINMUX(a, 6, 0x94, 7, periph)
/* pa6_scom5p1_out */
#define PA6_SCOM5P1_OUT        MCHP_PINMUX(a, 6, 0x25c, 6, periph)
/* pa6_scom5p2_in */
#define PA6_SCOM5P2_IN         MCHP_PINMUX(a, 6, 0x98, 2, periph)
/* pa6_scom5p2_out */
#define PA6_SCOM5P2_OUT        MCHP_PINMUX(a, 6, 0x254, 12, periph)
/* pa6_scom5p3_out */
#define PA6_SCOM5P3_OUT        MCHP_PINMUX(a, 6, 0x258, 12, periph)
/* pa6_tc0wo0g1_in */
#define PA6_TC0WO0G1_IN        MCHP_PINMUX(a, 6, 0xcc, 2, periph)
/* pa6_tc0wo0_out */
#define PA6_TC0WO0_OUT         MCHP_PINMUX(a, 6, 0x258, 21, periph)
/* pa6_tc0wo1g4_in */
#define PA6_TC0WO1G4_IN        MCHP_PINMUX(a, 6, 0xd8, 13, periph)
/* pa6_tc0wo1_out */
#define PA6_TC0WO1_OUT         MCHP_PINMUX(a, 6, 0x254, 18, periph)
/* pa6_tc1wo0g1_in */
#define PA6_TC1WO0G1_IN        MCHP_PINMUX(a, 6, 0xdc, 2, periph)
/* pa6_tc1wo0_out */
#define PA6_TC1WO0_OUT         MCHP_PINMUX(a, 6, 0x254, 19, periph)
/* pa6_tc1wo1_out */
#define PA6_TC1WO1_OUT         MCHP_PINMUX(a, 6, 0x258, 22, periph)
/* pa6_tc2wo0g1_in */
#define PA6_TC2WO0G1_IN        MCHP_PINMUX(a, 6, 0xec, 2, periph)
/* pa6_tc2wo0_out */
#define PA6_TC2WO0_OUT         MCHP_PINMUX(a, 6, 0x254, 20, periph)
/* pa6_tc2wo1g4_in */
#define PA6_TC2WO1G4_IN        MCHP_PINMUX(a, 6, 0xf8, 13, periph)
/* pa6_tc2wo1_out */
#define PA6_TC2WO1_OUT         MCHP_PINMUX(a, 6, 0x258, 23, periph)
/* pa6_tc3wo0g1_in */
#define PA6_TC3WO0G1_IN        MCHP_PINMUX(a, 6, 0xfc, 2, periph)
/* pa6_tc3wo0_out */
#define PA6_TC3WO0_OUT         MCHP_PINMUX(a, 6, 0x254, 21, periph)
/* pa6_tc3wo1g4_in */
#define PA6_TC3WO1G4_IN        MCHP_PINMUX(a, 6, 0x108, 13, periph)
/* pa6_tc3wo1_out */
#define PA6_TC3WO1_OUT         MCHP_PINMUX(a, 6, 0x258, 24, periph)
/* pa6_tc4wo0g1_in */
#define PA6_TC4WO0G1_IN        MCHP_PINMUX(a, 6, 0x10c, 2, periph)
/* pa6_tc4wo0_out */
#define PA6_TC4WO0_OUT         MCHP_PINMUX(a, 6, 0x254, 22, periph)
/* pa6_tc4wo1g4_in */
#define PA6_TC4WO1G4_IN        MCHP_PINMUX(a, 6, 0x118, 13, periph)
/* pa6_tc4wo1_out */
#define PA6_TC4WO1_OUT         MCHP_PINMUX(a, 6, 0x258, 25, periph)
/* pa6_tc5wo0g1_in */
#define PA6_TC5WO0G1_IN        MCHP_PINMUX(a, 6, 0x11c, 2, periph)
/* pa6_tc5wo0_out */
#define PA6_TC5WO0_OUT         MCHP_PINMUX(a, 6, 0x254, 23, periph)
/* pa6_tc5wo1g4_in */
#define PA6_TC5WO1G4_IN        MCHP_PINMUX(a, 6, 0x128, 13, periph)
/* pa6_tc5wo1_out */
#define PA6_TC5WO1_OUT         MCHP_PINMUX(a, 6, 0x258, 26, periph)
/* pa6_tc6wo0g1_in */
#define PA6_TC6WO0G1_IN        MCHP_PINMUX(a, 6, 0x12c, 2, periph)
/* pa6_tc6wo0_out */
#define PA6_TC6WO0_OUT         MCHP_PINMUX(a, 6, 0x254, 24, periph)
/* pa6_tc6wo1g4_in */
#define PA6_TC6WO1G4_IN        MCHP_PINMUX(a, 6, 0x138, 13, periph)
/* pa6_tc6wo1_out */
#define PA6_TC6WO1_OUT         MCHP_PINMUX(a, 6, 0x258, 27, periph)
/* pa6_tc7wo0g1_in */
#define PA6_TC7WO0G1_IN        MCHP_PINMUX(a, 6, 0x13c, 2, periph)
/* pa6_tc7wo0_out */
#define PA6_TC7WO0_OUT         MCHP_PINMUX(a, 6, 0x254, 25, periph)
/* pa6_tc7wo1g4_in */
#define PA6_TC7WO1G4_IN        MCHP_PINMUX(a, 6, 0x148, 13, periph)
/* pa6_tc7wo1_out */
#define PA6_TC7WO1_OUT         MCHP_PINMUX(a, 6, 0x258, 28, periph)
/* pa6_tc8wo0g1_in */
#define PA6_TC8WO0G1_IN        MCHP_PINMUX(a, 6, 0x14c, 2, periph)
/* pa6_tc8wo0_out */
#define PA6_TC8WO0_OUT         MCHP_PINMUX(a, 6, 0x254, 26, periph)
/* pa6_tc9wo0g4_in */
#define PA6_TC9WO0G4_IN        MCHP_PINMUX(a, 6, 0x160, 13, periph)
/* pa6_tc9wo0_out */
#define PA6_TC9WO0_OUT         MCHP_PINMUX(a, 6, 0x258, 29, periph)
/* pa6_tcc0wo0_out */
#define PA6_TCC0WO0_OUT        MCHP_PINMUX(a, 6, 0x254, 13, periph)
/* pa6_tcc0wo1_out */
#define PA6_TCC0WO1_OUT        MCHP_PINMUX(a, 6, 0x258, 15, periph)
/* pa6_tcc0wo3_out */
#define PA6_TCC0WO3_OUT        MCHP_PINMUX(a, 6, 0x258, 14, periph)
/* pa6_tcc0wo4_out */
#define PA6_TCC0WO4_OUT        MCHP_PINMUX(a, 6, 0x254, 14, periph)
/* pa6_tcc0wo5_out */
#define PA6_TCC0WO5_OUT        MCHP_PINMUX(a, 6, 0x258, 16, periph)
/* pa6_tcc1wo0_out */
#define PA6_TCC1WO0_OUT        MCHP_PINMUX(a, 6, 0x254, 15, periph)
/* pa6_tcc1wo1_out */
#define PA6_TCC1WO1_OUT        MCHP_PINMUX(a, 6, 0x258, 18, periph)
/* pa6_tcc1wo3_out */
#define PA6_TCC1WO3_OUT        MCHP_PINMUX(a, 6, 0x258, 17, periph)
/* pa6_tcc1wo4_out */
#define PA6_TCC1WO4_OUT        MCHP_PINMUX(a, 6, 0x254, 16, periph)
/* pa6_tcc1wo5_out */
#define PA6_TCC1WO5_OUT        MCHP_PINMUX(a, 6, 0x258, 19, periph)
/* pa6_tcc2wo0_out */
#define PA6_TCC2WO0_OUT        MCHP_PINMUX(a, 6, 0x254, 17, periph)
/* pa6_tcc2wo1_out */
#define PA6_TCC2WO1_OUT        MCHP_PINMUX(a, 6, 0x258, 20, periph)
/* pa6_tstbus0_out */
#define PA6_TSTBUS0_OUT        MCHP_PINMUX(a, 6, 0x254, 32, periph)
/* pa6_tstbus2_out */
#define PA6_TSTBUS2_OUT        MCHP_PINMUX(a, 6, 0x258, 34, periph)
/* pa6_tstbus4_out */
#define PA6_TSTBUS4_OUT        MCHP_PINMUX(a, 6, 0x254, 33, periph)
/* pa6_tstbus6_out */
#define PA6_TSTBUS6_OUT        MCHP_PINMUX(a, 6, 0x258, 35, periph)
/* pa6_tstbus8_out */
#define PA6_TSTBUS8_OUT        MCHP_PINMUX(a, 6, 0x254, 34, periph)
/* pa7_accmpten_in */
#define PA7_ACCMPTEN_IN        MCHP_PINMUX(a, 7, 0x18c, 16, periph)
/* pa7_cclin0_in */
#define PA7_CCLIN0_IN          MCHP_PINMUX(a, 7, 0xb4, 16, periph)
/* pa7_cclin1_in */
#define PA7_CCLIN1_IN          MCHP_PINMUX(a, 7, 0xb8, 2, periph)
/* pa7_cclin3_in */
#define PA7_CCLIN3_IN          MCHP_PINMUX(a, 7, 0xc0, 16, periph)
/* pa7_cclin4_in */
#define PA7_CCLIN4_IN          MCHP_PINMUX(a, 7, 0xc4, 2, periph)
/* pa7_cclo1_out */
#define PA7_CCLO1_OUT          MCHP_PINMUX(a, 7, 0x264, 1, periph)
/* pa7_coex_bt_state_out */
#define PA7_COEX_BT_STATE_OUT  MCHP_PINMUX(a, 7, 0x260, 37, periph)
/* pa7_coex_rf_act_out */
#define PA7_COEX_RF_ACT_OUT    MCHP_PINMUX(a, 7, 0x264, 41, periph)
/* pa7_extint0_in */
#define PA7_EXTINT0_IN         MCHP_PINMUX(a, 7, 0x0, 16, periph)
/* pa7_extint1_in */
#define PA7_EXTINT1_IN         MCHP_PINMUX(a, 7, 0x4, 2, periph)
/* pa7_fectrl0_out */
#define PA7_FECTRL0_OUT        MCHP_PINMUX(a, 7, 0x264, 40, periph)
/* pa7_fectrl1_out */
#define PA7_FECTRL1_OUT        MCHP_PINMUX(a, 7, 0x260, 35, periph)
/* pa7_fectrl2_out */
#define PA7_FECTRL2_OUT        MCHP_PINMUX(a, 7, 0x260, 36, periph)
/* pa7_qd0_out */
#define PA7_QD0_OUT            MCHP_PINMUX(a, 7, 0x264, 35, periph)
/* pa7_qd1_in */
#define PA7_QD1_IN             MCHP_PINMUX(a, 7, 0xa4, 16, periph)
/* pa7_qd1_out */
#define PA7_QD1_OUT            MCHP_PINMUX(a, 7, 0x260, 30, periph)
/* pa7_qd2_in */
#define PA7_QD2_IN             MCHP_PINMUX(a, 7, 0xa8, 2, periph)
/* pa7_qd2_out */
#define PA7_QD2_OUT            MCHP_PINMUX(a, 7, 0x260, 29, periph)
/* pa7_qd3_out */
#define PA7_QD3_OUT            MCHP_PINMUX(a, 7, 0x260, 28, periph)
/* pa7_qeiccmp0_out */
#define PA7_QEICCMP0_OUT       MCHP_PINMUX(a, 7, 0x260, 31, periph)
/* pa7_qeihome0g1_in */
#define PA7_QEIHOME0G1_IN      MCHP_PINMUX(a, 7, 0x16c, 16, periph)
/* pa7_qeihome0g2_in */
#define PA7_QEIHOME0G2_IN      MCHP_PINMUX(a, 7, 0x170, 2, periph)
/* pa7_qeiindx0g2_in */
#define PA7_QEIINDX0G2_IN      MCHP_PINMUX(a, 7, 0x174, 2, periph)
/* pa7_qspics_out */
#define PA7_QSPICS_OUT         MCHP_PINMUX(a, 7, 0x260, 27, periph)
/* pa7_qspi_sck_out */
#define PA7_QSPI_SCK_OUT       MCHP_PINMUX(a, 7, 0x268, 7, periph)
/* pa7_refi_in */
#define PA7_REFI_IN            MCHP_PINMUX(a, 7, 0xb0, 8, periph)
/* pa7_refo1_out */
#define PA7_REFO1_OUT          MCHP_PINMUX(a, 7, 0x268, 8, periph)
/* pa7_refo2_out */
#define PA7_REFO2_OUT          MCHP_PINMUX(a, 7, 0x268, 9, periph)
/* pa7_refo3_out */
#define PA7_REFO3_OUT          MCHP_PINMUX(a, 7, 0x268, 10, periph)
/* pa7_refo4_out */
#define PA7_REFO4_OUT          MCHP_PINMUX(a, 7, 0x268, 11, periph)
/* pa7_scom0p0_in */
#define PA7_SCOM0P0_IN         MCHP_PINMUX(a, 7, 0x40, 2, periph)
/* pa7_scom0p0_out */
#define PA7_SCOM0P0_OUT        MCHP_PINMUX(a, 7, 0x264, 2, periph)
/* pa7_scom0p1_in */
#define PA7_SCOM0P1_IN         MCHP_PINMUX(a, 7, 0x44, 8, periph)
/* pa7_scom0p1_out */
#define PA7_SCOM0P1_OUT        MCHP_PINMUX(a, 7, 0x268, 1, periph)
/* pa7_scom0p2_out */
#define PA7_SCOM0P2_OUT        MCHP_PINMUX(a, 7, 0x260, 2, periph)
/* pa7_scom0p3_in */
#define PA7_SCOM0P3_IN         MCHP_PINMUX(a, 7, 0x4c, 16, periph)
/* pa7_scom0p3_out */
#define PA7_SCOM0P3_OUT        MCHP_PINMUX(a, 7, 0x260, 1, periph)
/* pa7_scom1p0_out */
#define PA7_SCOM1P0_OUT        MCHP_PINMUX(a, 7, 0x260, 3, periph)
/* pa7_scom1p1_in */
#define PA7_SCOM1P1_IN         MCHP_PINMUX(a, 7, 0x54, 8, periph)
/* pa7_scom1p1_out */
#define PA7_SCOM1P1_OUT        MCHP_PINMUX(a, 7, 0x268, 2, periph)
/* pa7_scom1p2_in */
#define PA7_SCOM1P2_IN         MCHP_PINMUX(a, 7, 0x58, 16, periph)
/* pa7_scom1p2_out */
#define PA7_SCOM1P2_OUT        MCHP_PINMUX(a, 7, 0x260, 4, periph)
/* pa7_scom1p3_in */
#define PA7_SCOM1P3_IN         MCHP_PINMUX(a, 7, 0x5c, 2, periph)
/* pa7_scom1p3_out */
#define PA7_SCOM1P3_OUT        MCHP_PINMUX(a, 7, 0x264, 5, periph)
/* pa7_scom2p0_in */
#define PA7_SCOM2P0_IN         MCHP_PINMUX(a, 7, 0x60, 2, periph)
/* pa7_scom2p0_out */
#define PA7_SCOM2P0_OUT        MCHP_PINMUX(a, 7, 0x264, 7, periph)
/* pa7_scom2p1_in */
#define PA7_SCOM2P1_IN         MCHP_PINMUX(a, 7, 0x64, 8, periph)
/* pa7_scom2p1_out */
#define PA7_SCOM2P1_OUT        MCHP_PINMUX(a, 7, 0x268, 3, periph)
/* pa7_scom2p2_out */
#define PA7_SCOM2P2_OUT        MCHP_PINMUX(a, 7, 0x260, 6, periph)
/* pa7_scom2p3_in */
#define PA7_SCOM2P3_IN         MCHP_PINMUX(a, 7, 0x6c, 16, periph)
/* pa7_scom2p3_out */
#define PA7_SCOM2P3_OUT        MCHP_PINMUX(a, 7, 0x260, 5, periph)
/* pa7_scom3p0_out */
#define PA7_SCOM3P0_OUT        MCHP_PINMUX(a, 7, 0x260, 7, periph)
/* pa7_scom3p1_in */
#define PA7_SCOM3P1_IN         MCHP_PINMUX(a, 7, 0x74, 8, periph)
/* pa7_scom3p1_out */
#define PA7_SCOM3P1_OUT        MCHP_PINMUX(a, 7, 0x268, 4, periph)
/* pa7_scom3p2_in */
#define PA7_SCOM3P2_IN         MCHP_PINMUX(a, 7, 0x78, 16, periph)
/* pa7_scom3p2_out */
#define PA7_SCOM3P2_OUT        MCHP_PINMUX(a, 7, 0x260, 8, periph)
/* pa7_scom3p3_in */
#define PA7_SCOM3P3_IN         MCHP_PINMUX(a, 7, 0x7c, 2, periph)
/* pa7_scom3p3_out */
#define PA7_SCOM3P3_OUT        MCHP_PINMUX(a, 7, 0x264, 10, periph)
/* pa7_scom4p0_in */
#define PA7_SCOM4P0_IN         MCHP_PINMUX(a, 7, 0x80, 2, periph)
/* pa7_scom4p0_out */
#define PA7_SCOM4P0_OUT        MCHP_PINMUX(a, 7, 0x264, 12, periph)
/* pa7_scom4p1_in */
#define PA7_SCOM4P1_IN         MCHP_PINMUX(a, 7, 0x84, 8, periph)
/* pa7_scom4p1_out */
#define PA7_SCOM4P1_OUT        MCHP_PINMUX(a, 7, 0x268, 5, periph)
/* pa7_scom4p2_out */
#define PA7_SCOM4P2_OUT        MCHP_PINMUX(a, 7, 0x260, 10, periph)
/* pa7_scom4p3_in */
#define PA7_SCOM4P3_IN         MCHP_PINMUX(a, 7, 0x8c, 16, periph)
/* pa7_scom4p3_out */
#define PA7_SCOM4P3_OUT        MCHP_PINMUX(a, 7, 0x260, 9, periph)
/* pa7_scom5p0_out */
#define PA7_SCOM5P0_OUT        MCHP_PINMUX(a, 7, 0x260, 11, periph)
/* pa7_scom5p1_in */
#define PA7_SCOM5P1_IN         MCHP_PINMUX(a, 7, 0x94, 8, periph)
/* pa7_scom5p1_out */
#define PA7_SCOM5P1_OUT        MCHP_PINMUX(a, 7, 0x268, 6, periph)
/* pa7_scom5p2_in */
#define PA7_SCOM5P2_IN         MCHP_PINMUX(a, 7, 0x98, 16, periph)
/* pa7_scom5p2_out */
#define PA7_SCOM5P2_OUT        MCHP_PINMUX(a, 7, 0x260, 12, periph)
/* pa7_scom5p3_in */
#define PA7_SCOM5P3_IN         MCHP_PINMUX(a, 7, 0x9c, 2, periph)
/* pa7_scom5p3_out */
#define PA7_SCOM5P3_OUT        MCHP_PINMUX(a, 7, 0x264, 15, periph)
/* pa7_tc0wo0g1_in */
#define PA7_TC0WO0G1_IN        MCHP_PINMUX(a, 7, 0xcc, 16, periph)
/* pa7_tc0wo0g2_in */
#define PA7_TC0WO0G2_IN        MCHP_PINMUX(a, 7, 0xd0, 2, periph)
/* pa7_tc0wo1_out */
#define PA7_TC0WO1_OUT         MCHP_PINMUX(a, 7, 0x260, 18, periph)
/* pa7_tc1wo0g1_in */
#define PA7_TC1WO0G1_IN        MCHP_PINMUX(a, 7, 0xdc, 16, periph)
/* pa7_tc1wo0_out */
#define PA7_TC1WO0_OUT         MCHP_PINMUX(a, 7, 0x260, 19, periph)
/* pa7_tc1wo1g2_in */
#define PA7_TC1WO1G2_IN        MCHP_PINMUX(a, 7, 0xe4, 2, periph)
/* pa7_tc1wo1_out */
#define PA7_TC1WO1_OUT         MCHP_PINMUX(a, 7, 0x264, 25, periph)
/* pa7_tc2wo0g1_in */
#define PA7_TC2WO0G1_IN        MCHP_PINMUX(a, 7, 0xec, 16, periph)
/* pa7_tc2wo0_out */
#define PA7_TC2WO0_OUT         MCHP_PINMUX(a, 7, 0x260, 20, periph)
/* pa7_tc2wo1g2_in */
#define PA7_TC2WO1G2_IN        MCHP_PINMUX(a, 7, 0xf4, 2, periph)
/* pa7_tc2wo1_out */
#define PA7_TC2WO1_OUT         MCHP_PINMUX(a, 7, 0x264, 26, periph)
/* pa7_tc3wo0g1_in */
#define PA7_TC3WO0G1_IN        MCHP_PINMUX(a, 7, 0xfc, 16, periph)
/* pa7_tc3wo0_out */
#define PA7_TC3WO0_OUT         MCHP_PINMUX(a, 7, 0x260, 21, periph)
/* pa7_tc3wo1g2_in */
#define PA7_TC3WO1G2_IN        MCHP_PINMUX(a, 7, 0x104, 2, periph)
/* pa7_tc3wo1_out */
#define PA7_TC3WO1_OUT         MCHP_PINMUX(a, 7, 0x264, 27, periph)
/* pa7_tc4wo0g1_in */
#define PA7_TC4WO0G1_IN        MCHP_PINMUX(a, 7, 0x10c, 16, periph)
/* pa7_tc4wo0_out */
#define PA7_TC4WO0_OUT         MCHP_PINMUX(a, 7, 0x260, 22, periph)
/* pa7_tc4wo1g2_in */
#define PA7_TC4WO1G2_IN        MCHP_PINMUX(a, 7, 0x114, 2, periph)
/* pa7_tc4wo1_out */
#define PA7_TC4WO1_OUT         MCHP_PINMUX(a, 7, 0x264, 28, periph)
/* pa7_tc5wo0g1_in */
#define PA7_TC5WO0G1_IN        MCHP_PINMUX(a, 7, 0x11c, 16, periph)
/* pa7_tc5wo0_out */
#define PA7_TC5WO0_OUT         MCHP_PINMUX(a, 7, 0x260, 23, periph)
/* pa7_tc5wo1g2_in */
#define PA7_TC5WO1G2_IN        MCHP_PINMUX(a, 7, 0x124, 2, periph)
/* pa7_tc5wo1_out */
#define PA7_TC5WO1_OUT         MCHP_PINMUX(a, 7, 0x264, 29, periph)
/* pa7_tc6wo0g1_in */
#define PA7_TC6WO0G1_IN        MCHP_PINMUX(a, 7, 0x12c, 16, periph)
/* pa7_tc6wo0_out */
#define PA7_TC6WO0_OUT         MCHP_PINMUX(a, 7, 0x260, 24, periph)
/* pa7_tc6wo1g2_in */
#define PA7_TC6WO1G2_IN        MCHP_PINMUX(a, 7, 0x134, 2, periph)
/* pa7_tc6wo1_out */
#define PA7_TC6WO1_OUT         MCHP_PINMUX(a, 7, 0x264, 30, periph)
/* pa7_tc7wo0g1_in */
#define PA7_TC7WO0G1_IN        MCHP_PINMUX(a, 7, 0x13c, 16, periph)
/* pa7_tc7wo0_out */
#define PA7_TC7WO0_OUT         MCHP_PINMUX(a, 7, 0x260, 25, periph)
/* pa7_tc7wo1g2_in */
#define PA7_TC7WO1G2_IN        MCHP_PINMUX(a, 7, 0x144, 2, periph)
/* pa7_tc7wo1_out */
#define PA7_TC7WO1_OUT         MCHP_PINMUX(a, 7, 0x264, 31, periph)
/* pa7_tc8wo0g1_in */
#define PA7_TC8WO0G1_IN        MCHP_PINMUX(a, 7, 0x14c, 16, periph)
/* pa7_tc8wo0_out */
#define PA7_TC8WO0_OUT         MCHP_PINMUX(a, 7, 0x260, 26, periph)
/* pa7_tc8wo1g2_in */
#define PA7_TC8WO1G2_IN        MCHP_PINMUX(a, 7, 0x154, 2, periph)
/* pa7_tc8wo1_out */
#define PA7_TC8WO1_OUT         MCHP_PINMUX(a, 7, 0x264, 32, periph)
/* pa7_tc9wo0g2_in */
#define PA7_TC9WO0G2_IN        MCHP_PINMUX(a, 7, 0x15c, 2, periph)
/* pa7_tc9wo0_out */
#define PA7_TC9WO0_OUT         MCHP_PINMUX(a, 7, 0x264, 33, periph)
/* pa7_tcc0wo0_out */
#define PA7_TCC0WO0_OUT        MCHP_PINMUX(a, 7, 0x260, 13, periph)
/* pa7_tcc0wo1_out */
#define PA7_TCC0WO1_OUT        MCHP_PINMUX(a, 7, 0x264, 17, periph)
/* pa7_tcc0wo3_out */
#define PA7_TCC0WO3_OUT        MCHP_PINMUX(a, 7, 0x264, 19, periph)
/* pa7_tcc0wo4_out */
#define PA7_TCC0WO4_OUT        MCHP_PINMUX(a, 7, 0x260, 14, periph)
/* pa7_tcc0wo5_out */
#define PA7_TCC0WO5_OUT        MCHP_PINMUX(a, 7, 0x264, 18, periph)
/* pa7_tcc1wo0_out */
#define PA7_TCC1WO0_OUT        MCHP_PINMUX(a, 7, 0x260, 15, periph)
/* pa7_tcc1wo1_out */
#define PA7_TCC1WO1_OUT        MCHP_PINMUX(a, 7, 0x264, 20, periph)
/* pa7_tcc1wo3_out */
#define PA7_TCC1WO3_OUT        MCHP_PINMUX(a, 7, 0x264, 22, periph)
/* pa7_tcc1wo4_out */
#define PA7_TCC1WO4_OUT        MCHP_PINMUX(a, 7, 0x260, 16, periph)
/* pa7_tcc1wo5_out */
#define PA7_TCC1WO5_OUT        MCHP_PINMUX(a, 7, 0x264, 21, periph)
/* pa7_tcc2wo0_out */
#define PA7_TCC2WO0_OUT        MCHP_PINMUX(a, 7, 0x260, 17, periph)
/* pa7_tcc2wo1_out */
#define PA7_TCC2WO1_OUT        MCHP_PINMUX(a, 7, 0x264, 23, periph)
/* pa7_tstbus0_out */
#define PA7_TSTBUS0_OUT        MCHP_PINMUX(a, 7, 0x260, 32, periph)
/* pa7_tstbus4_out */
#define PA7_TSTBUS4_OUT        MCHP_PINMUX(a, 7, 0x260, 33, periph)
/* pa7_tstbus5_out */
#define PA7_TSTBUS5_OUT        MCHP_PINMUX(a, 7, 0x264, 38, periph)
