zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cx_bz/bz62/pic32cx2051bz62064-pinctrl.h
#define PA13_TC3WO0_OUT        MCHP_PINMUX(a, 13, 0x2a0, 27, periph)
/* pa13_tc3wo1g4_in */
#define PA13_TC3WO1G4_IN       MCHP_PINMUX(a, 13, 0x108, 19, periph)
/* pa13_tc3wo1_out */
#define PA13_TC3WO1_OUT        MCHP_PINMUX(a, 13, 0x2a4, 24, periph)
/* pa13_tc4wo0g3_in */
#define PA13_TC4WO0G3_IN       MCHP_PINMUX(a, 13, 0x110, 3, periph)
/* pa13_tc4wo0_out */
#define PA13_TC4WO0_OUT        MCHP_PINMUX(a, 13, 0x2a0, 28, periph)
/* pa13_tc4wo1g4_in */
#define PA13_TC4WO1G4_IN       MCHP_PINMUX(a, 13, 0x118, 19, periph)
/* pa13_tc4wo1_out */
#define PA13_TC4WO1_OUT        MCHP_PINMUX(a, 13, 0x2a4, 25, periph)
/* pa13_tc5wo0g3_in */
#define PA13_TC5WO0G3_IN       MCHP_PINMUX(a, 13, 0x120, 3, periph)
/* pa13_tc5wo0_out */
#define PA13_TC5WO0_OUT        MCHP_PINMUX(a, 13, 0x2a0, 29, periph)
/* pa13_tc5wo1g4_in */
#define PA13_TC5WO1G4_IN       MCHP_PINMUX(a, 13, 0x128, 19, periph)
/* pa13_tc5wo1_out */
#define PA13_TC5WO1_OUT        MCHP_PINMUX(a, 13, 0x2a4, 26, periph)
/* pa13_tc6wo0g3_in */
#define PA13_TC6WO0G3_IN       MCHP_PINMUX(a, 13, 0x130, 3, periph)
/* pa13_tc6wo0_out */
#define PA13_TC6WO0_OUT        MCHP_PINMUX(a, 13, 0x2a0, 30, periph)
/* pa13_tc6wo1g4_in */
#define PA13_TC6WO1G4_IN       MCHP_PINMUX(a, 13, 0x138, 19, periph)
/* pa13_tc6wo1_out */
#define PA13_TC6WO1_OUT        MCHP_PINMUX(a, 13, 0x2a4, 27, periph)
/* pa13_tc7wo0g3_in */
#define PA13_TC7WO0G3_IN       MCHP_PINMUX(a, 13, 0x140, 3, periph)
/* pa13_tc7wo0_out */
#define PA13_TC7WO0_OUT        MCHP_PINMUX(a, 13, 0x2a0, 31, periph)
/* pa13_tc7wo1g4_in */
#define PA13_TC7WO1G4_IN       MCHP_PINMUX(a, 13, 0x148, 19, periph)
/* pa13_tc7wo1_out */
#define PA13_TC7WO1_OUT        MCHP_PINMUX(a, 13, 0x2a4, 28, periph)
/* pa13_tc8wo0g3_in */
#define PA13_TC8WO0G3_IN       MCHP_PINMUX(a, 13, 0x150, 3, periph)
/* pa13_tc8wo0_out */
#define PA13_TC8WO0_OUT        MCHP_PINMUX(a, 13, 0x2a0, 32, periph)
/* pa13_tc9wo0g4_in */
#define PA13_TC9WO0G4_IN       MCHP_PINMUX(a, 13, 0x160, 19, periph)
/* pa13_tc9wo0_out */
#define PA13_TC9WO0_OUT        MCHP_PINMUX(a, 13, 0x2a4, 29, periph)
/* pa13_tc9wo1g3_in */
#define PA13_TC9WO1G3_IN       MCHP_PINMUX(a, 13, 0x164, 3, periph)
/* pa13_tc9wo1_out */
#define PA13_TC9WO1_OUT        MCHP_PINMUX(a, 13, 0x2a0, 33, periph)
/* pa13_tcc0wo0_out */
#define PA13_TCC0WO0_OUT       MCHP_PINMUX(a, 13, 0x2a0, 18, periph)
/* pa13_tcc0wo1_out */
#define PA13_TCC0WO1_OUT       MCHP_PINMUX(a, 13, 0x2a4, 15, periph)
/* pa13_tcc0wo2_out */
#define PA13_TCC0WO2_OUT       MCHP_PINMUX(a, 13, 0x2a0, 17, periph)
/* pa13_tcc0wo3_out */
#define PA13_TCC0WO3_OUT       MCHP_PINMUX(a, 13, 0x2a4, 14, periph)
/* pa13_tcc0wo4_out */
#define PA13_TCC0WO4_OUT       MCHP_PINMUX(a, 13, 0x2a0, 19, periph)
/* pa13_tcc0wo5_out */
#define PA13_TCC0WO5_OUT       MCHP_PINMUX(a, 13, 0x2a4, 16, periph)
/* pa13_tcc1wo0_out */
#define PA13_TCC1WO0_OUT       MCHP_PINMUX(a, 13, 0x2a0, 21, periph)
/* pa13_tcc1wo1_out */
#define PA13_TCC1WO1_OUT       MCHP_PINMUX(a, 13, 0x2a4, 18, periph)
/* pa13_tcc1wo2_out */
#define PA13_TCC1WO2_OUT       MCHP_PINMUX(a, 13, 0x2a0, 20, periph)
/* pa13_tcc1wo3_out */
#define PA13_TCC1WO3_OUT       MCHP_PINMUX(a, 13, 0x2a4, 17, periph)
/* pa13_tcc1wo4_out */
#define PA13_TCC1WO4_OUT       MCHP_PINMUX(a, 13, 0x2a0, 22, periph)
/* pa13_tcc1wo5_out */
#define PA13_TCC1WO5_OUT       MCHP_PINMUX(a, 13, 0x2a4, 19, periph)
/* pa13_tcc2wo0_out */
#define PA13_TCC2WO0_OUT       MCHP_PINMUX(a, 13, 0x2a0, 23, periph)
/* pa13_tcc2wo1_out */
#define PA13_TCC2WO1_OUT       MCHP_PINMUX(a, 13, 0x2a4, 20, periph)
/* pa13_tstbus1_out */
#define PA13_TSTBUS1_OUT       MCHP_PINMUX(a, 13, 0x2a0, 38, periph)
/* pa13_tstbus2_out */
#define PA13_TSTBUS2_OUT       MCHP_PINMUX(a, 13, 0x2a4, 34, periph)
/* pa13_tstbus6_out */
#define PA13_TSTBUS6_OUT       MCHP_PINMUX(a, 13, 0x2a4, 35, periph)
/* pa13_tstbus10_out */
#define PA13_TSTBUS10_OUT      MCHP_PINMUX(a, 13, 0x2a0, 39, periph)
/* pa14_accmpten_in */
#define PA14_ACCMPTEN_IN       MCHP_PINMUX(a, 14, 0x18c, 22, periph)
/* pa14_ac_cmp1_out */
#define PA14_AC_CMP1_OUT       MCHP_PINMUX(a, 14, 0x2ac, 36, periph)
/* pa14_ac_cmptout_out */
#define PA14_AC_CMPTOUT_OUT    MCHP_PINMUX(a, 14, 0x2ac, 37, periph)
/* pa14_can1_tx_out */
#define PA14_CAN1_TX_OUT       MCHP_PINMUX(a, 14, 0x2ac, 38, periph)
/* pa14_cclin0_in */
#define PA14_CCLIN0_IN         MCHP_PINMUX(a, 14, 0xb4, 22, periph)
/* pa14_cclin3_in */
#define PA14_CCLIN3_IN         MCHP_PINMUX(a, 14, 0xc0, 22, periph)
/* pa14_cclo1_out */
#define PA14_CCLO1_OUT         MCHP_PINMUX(a, 14, 0x2ac, 1, periph)
/* pa14_coexwlanact_in */
#define PA14_COEXWLANACT_IN    MCHP_PINMUX(a, 14, 0x194, 3, periph)
/* pa14_coex_bt_state_out */
#define PA14_COEX_BT_STATE_OUT MCHP_PINMUX(a, 14, 0x2a8, 37, periph)
/* pa14_extint0_in */
#define PA14_EXTINT0_IN        MCHP_PINMUX(a, 14, 0x0, 22, periph)
/* pa14_extint3_in */
#define PA14_EXTINT3_IN        MCHP_PINMUX(a, 14, 0xc, 3, periph)
/* pa14_fectrl1_out */
#define PA14_FECTRL1_OUT       MCHP_PINMUX(a, 14, 0x2a8, 35, periph)
/* pa14_fectrl2_out */
#define PA14_FECTRL2_OUT       MCHP_PINMUX(a, 14, 0x2a8, 36, periph)
/* pa14_fectrl3_out */
#define PA14_FECTRL3_OUT       MCHP_PINMUX(a, 14, 0x2ac, 39, periph)
/* pa14_fectrl5_out */
#define PA14_FECTRL5_OUT       MCHP_PINMUX(a, 14, 0x2ac, 40, periph)
/* pa14_nmi_in */
#define PA14_NMI_IN            MCHP_PINMUX(a, 14, 0x3c, 3, periph)
/* pa14_qd0_in */
#define PA14_QD0_IN            MCHP_PINMUX(a, 14, 0xa0, 3, periph)
/* pa14_qd0_out */
#define PA14_QD0_OUT           MCHP_PINMUX(a, 14, 0x2ac, 33, periph)
/* pa14_qd1_in */
#define PA14_QD1_IN            MCHP_PINMUX(a, 14, 0xa4, 22, periph)
/* pa14_qd1_out */
#define PA14_QD1_OUT           MCHP_PINMUX(a, 14, 0x2a8, 30, periph)
/* pa14_qd2_out */
#define PA14_QD2_OUT           MCHP_PINMUX(a, 14, 0x2a8, 29, periph)
/* pa14_qd3_out */
#define PA14_QD3_OUT           MCHP_PINMUX(a, 14, 0x2a8, 28, periph)
/* pa14_qeiccmp0_out */
#define PA14_QEICCMP0_OUT      MCHP_PINMUX(a, 14, 0x2a8, 31, periph)
/* pa14_qeihome0g1_in */
#define PA14_QEIHOME0G1_IN     MCHP_PINMUX(a, 14, 0x16c, 22, periph)
/* pa14_qeiqea0g4_in */
#define PA14_QEIQEA0G4_IN      MCHP_PINMUX(a, 14, 0x180, 3, periph)
/* pa14_qeiqeb0g4_in */
#define PA14_QEIQEB0G4_IN      MCHP_PINMUX(a, 14, 0x184, 3, periph)
/* pa14_qspics_out */
#define PA14_QSPICS_OUT        MCHP_PINMUX(a, 14, 0x2a8, 27, periph)
/* pa14_scom0p0_out */
#define PA14_SCOM0P0_OUT       MCHP_PINMUX(a, 14, 0x2ac, 3, periph)
/* pa14_scom0p2_in */
#define PA14_SCOM0P2_IN        MCHP_PINMUX(a, 14, 0x48, 3, periph)
/* pa14_scom0p2_out */
#define PA14_SCOM0P2_OUT       MCHP_PINMUX(a, 14, 0x2a8, 2, periph)
/* pa14_scom0p3_in */
#define PA14_SCOM0P3_IN        MCHP_PINMUX(a, 14, 0x4c, 22, periph)
/* pa14_scom0p3_out */
#define PA14_SCOM0P3_OUT       MCHP_PINMUX(a, 14, 0x2a8, 1, periph)
/* pa14_scom1p0_out */
#define PA14_SCOM1P0_OUT       MCHP_PINMUX(a, 14, 0x2a8, 3, periph)
/* pa14_scom1p2_in */
#define PA14_SCOM1P2_IN        MCHP_PINMUX(a, 14, 0x58, 22, periph)
/* pa14_scom1p2_out */
#define PA14_SCOM1P2_OUT       MCHP_PINMUX(a, 14, 0x2a8, 4, periph)
/* pa14_scom1p3_out */
#define PA14_SCOM1P3_OUT       MCHP_PINMUX(a, 14, 0x2ac, 4, periph)
/* pa14_scom2p0_out */
#define PA14_SCOM2P0_OUT       MCHP_PINMUX(a, 14, 0x2ac, 7, periph)
/* pa14_scom2p2_in */
#define PA14_SCOM2P2_IN        MCHP_PINMUX(a, 14, 0x68, 3, periph)
/* pa14_scom2p2_out */
#define PA14_SCOM2P2_OUT       MCHP_PINMUX(a, 14, 0x2a8, 6, periph)
/* pa14_scom2p3_in */
#define PA14_SCOM2P3_IN        MCHP_PINMUX(a, 14, 0x6c, 22, periph)
/* pa14_scom2p3_out */
#define PA14_SCOM2P3_OUT       MCHP_PINMUX(a, 14, 0x2a8, 5, periph)
/* pa14_scom3p0_out */
#define PA14_SCOM3P0_OUT       MCHP_PINMUX(a, 14, 0x2a8, 7, periph)
/* pa14_scom3p2_in */
#define PA14_SCOM3P2_IN        MCHP_PINMUX(a, 14, 0x78, 22, periph)
/* pa14_scom3p2_out */
#define PA14_SCOM3P2_OUT       MCHP_PINMUX(a, 14, 0x2a8, 8, periph)
/* pa14_scom3p3_out */
#define PA14_SCOM3P3_OUT       MCHP_PINMUX(a, 14, 0x2ac, 8, periph)
/* pa14_scom4p0_out */
#define PA14_SCOM4P0_OUT       MCHP_PINMUX(a, 14, 0x2ac, 11, periph)
/* pa14_scom4p2_in */
#define PA14_SCOM4P2_IN        MCHP_PINMUX(a, 14, 0x88, 3, periph)
/* pa14_scom4p2_out */
#define PA14_SCOM4P2_OUT       MCHP_PINMUX(a, 14, 0x2a8, 10, periph)
/* pa14_scom4p3_in */
#define PA14_SCOM4P3_IN        MCHP_PINMUX(a, 14, 0x8c, 22, periph)
/* pa14_scom4p3_out */
#define PA14_SCOM4P3_OUT       MCHP_PINMUX(a, 14, 0x2a8, 9, periph)
/* pa14_scom5p0_out */
#define PA14_SCOM5P0_OUT       MCHP_PINMUX(a, 14, 0x2a8, 11, periph)
/* pa14_scom5p2_in */
#define PA14_SCOM5P2_IN        MCHP_PINMUX(a, 14, 0x98, 22, periph)
/* pa14_scom5p2_out */
#define PA14_SCOM5P2_OUT       MCHP_PINMUX(a, 14, 0x2a8, 12, periph)
/* pa14_scom5p3_out */
#define PA14_SCOM5P3_OUT       MCHP_PINMUX(a, 14, 0x2ac, 12, periph)
/* pa14_tc0wo0g1_in */
#define PA14_TC0WO0G1_IN       MCHP_PINMUX(a, 14, 0xcc, 22, periph)
/* pa14_tc0wo0_out */
#define PA14_TC0WO0_OUT        MCHP_PINMUX(a, 14, 0x2ac, 21, periph)
/* pa14_tc0wo1g4_in */
#define PA14_TC0WO1G4_IN       MCHP_PINMUX(a, 14, 0xd8, 3, periph)
/* pa14_tc0wo1_out */
#define PA14_TC0WO1_OUT        MCHP_PINMUX(a, 14, 0x2a8, 18, periph)
/* pa14_tc1wo0g1_in */
#define PA14_TC1WO0G1_IN       MCHP_PINMUX(a, 14, 0xdc, 22, periph)
/* pa14_tc1wo0_out */
#define PA14_TC1WO0_OUT        MCHP_PINMUX(a, 14, 0x2a8, 19, periph)
/* pa14_tc1wo1_out */
#define PA14_TC1WO1_OUT        MCHP_PINMUX(a, 14, 0x2ac, 22, periph)
/* pa14_tc2wo0g1_in */
#define PA14_TC2WO0G1_IN       MCHP_PINMUX(a, 14, 0xec, 22, periph)
/* pa14_tc2wo0_out */
#define PA14_TC2WO0_OUT        MCHP_PINMUX(a, 14, 0x2a8, 20, periph)
/* pa14_tc2wo1g4_in */
#define PA14_TC2WO1G4_IN       MCHP_PINMUX(a, 14, 0xf8, 3, periph)
/* pa14_tc2wo1_out */
#define PA14_TC2WO1_OUT        MCHP_PINMUX(a, 14, 0x2ac, 23, periph)
/* pa14_tc3wo0g1_in */
#define PA14_TC3WO0G1_IN       MCHP_PINMUX(a, 14, 0xfc, 22, periph)
/* pa14_tc3wo0_out */
#define PA14_TC3WO0_OUT        MCHP_PINMUX(a, 14, 0x2a8, 21, periph)
/* pa14_tc3wo1g4_in */
#define PA14_TC3WO1G4_IN       MCHP_PINMUX(a, 14, 0x108, 3, periph)
/* pa14_tc3wo1_out */
#define PA14_TC3WO1_OUT        MCHP_PINMUX(a, 14, 0x2ac, 24, periph)
/* pa14_tc4wo0g1_in */
#define PA14_TC4WO0G1_IN       MCHP_PINMUX(a, 14, 0x10c, 22, periph)
/* pa14_tc4wo0_out */
#define PA14_TC4WO0_OUT        MCHP_PINMUX(a, 14, 0x2a8, 22, periph)
/* pa14_tc4wo1g4_in */
#define PA14_TC4WO1G4_IN       MCHP_PINMUX(a, 14, 0x118, 3, periph)
/* pa14_tc4wo1_out */
#define PA14_TC4WO1_OUT        MCHP_PINMUX(a, 14, 0x2ac, 25, periph)
/* pa14_tc5wo0g1_in */
#define PA14_TC5WO0G1_IN       MCHP_PINMUX(a, 14, 0x11c, 22, periph)
/* pa14_tc5wo0_out */
#define PA14_TC5WO0_OUT        MCHP_PINMUX(a, 14, 0x2a8, 23, periph)
/* pa14_tc5wo1g4_in */
#define PA14_TC5WO1G4_IN       MCHP_PINMUX(a, 14, 0x128, 3, periph)
/* pa14_tc5wo1_out */
#define PA14_TC5WO1_OUT        MCHP_PINMUX(a, 14, 0x2ac, 26, periph)
/* pa14_tc6wo0g1_in */
#define PA14_TC6WO0G1_IN       MCHP_PINMUX(a, 14, 0x12c, 22, periph)
/* pa14_tc6wo0_out */
#define PA14_TC6WO0_OUT        MCHP_PINMUX(a, 14, 0x2a8, 24, periph)
/* pa14_tc6wo1g4_in */
#define PA14_TC6WO1G4_IN       MCHP_PINMUX(a, 14, 0x138, 3, periph)
/* pa14_tc6wo1_out */
#define PA14_TC6WO1_OUT        MCHP_PINMUX(a, 14, 0x2ac, 27, periph)
/* pa14_tc7wo0g1_in */
#define PA14_TC7WO0G1_IN       MCHP_PINMUX(a, 14, 0x13c, 22, periph)
/* pa14_tc7wo0_out */
#define PA14_TC7WO0_OUT        MCHP_PINMUX(a, 14, 0x2a8, 25, periph)
/* pa14_tc7wo1g4_in */
#define PA14_TC7WO1G4_IN       MCHP_PINMUX(a, 14, 0x148, 3, periph)
/* pa14_tc7wo1_out */
#define PA14_TC7WO1_OUT        MCHP_PINMUX(a, 14, 0x2ac, 28, periph)
/* pa14_tc8wo0g1_in */
#define PA14_TC8WO0G1_IN       MCHP_PINMUX(a, 14, 0x14c, 22, periph)
/* pa14_tc8wo0_out */
#define PA14_TC8WO0_OUT        MCHP_PINMUX(a, 14, 0x2a8, 26, periph)
/* pa14_tc9wo0g4_in */
#define PA14_TC9WO0G4_IN       MCHP_PINMUX(a, 14, 0x160, 3, periph)
/* pa14_tc9wo0_out */
#define PA14_TC9WO0_OUT        MCHP_PINMUX(a, 14, 0x2ac, 29, periph)
/* pa14_tcc0wo0_out */
#define PA14_TCC0WO0_OUT       MCHP_PINMUX(a, 14, 0x2a8, 13, periph)
/* pa14_tcc0wo1_out */
#define PA14_TCC0WO1_OUT       MCHP_PINMUX(a, 14, 0x2ac, 15, periph)
/* pa14_tcc0wo3_out */
#define PA14_TCC0WO3_OUT       MCHP_PINMUX(a, 14, 0x2ac, 14, periph)
/* pa14_tcc0wo4_out */
#define PA14_TCC0WO4_OUT       MCHP_PINMUX(a, 14, 0x2a8, 14, periph)
/* pa14_tcc0wo5_out */
#define PA14_TCC0WO5_OUT       MCHP_PINMUX(a, 14, 0x2ac, 16, periph)
/* pa14_tcc1wo0_out */
#define PA14_TCC1WO0_OUT       MCHP_PINMUX(a, 14, 0x2a8, 15, periph)
/* pa14_tcc1wo1_out */
#define PA14_TCC1WO1_OUT       MCHP_PINMUX(a, 14, 0x2ac, 18, periph)
/* pa14_tcc1wo3_out */
#define PA14_TCC1WO3_OUT       MCHP_PINMUX(a, 14, 0x2ac, 17, periph)
/* pa14_tcc1wo4_out */
#define PA14_TCC1WO4_OUT       MCHP_PINMUX(a, 14, 0x2a8, 16, periph)
/* pa14_tcc1wo5_out */
#define PA14_TCC1WO5_OUT       MCHP_PINMUX(a, 14, 0x2ac, 19, periph)
/* pa14_tcc2wo0_out */
#define PA14_TCC2WO0_OUT       MCHP_PINMUX(a, 14, 0x2a8, 17, periph)
/* pa14_tcc2wo1_out */
#define PA14_TCC2WO1_OUT       MCHP_PINMUX(a, 14, 0x2ac, 20, periph)
/* pa14_tstbus0_out */
#define PA14_TSTBUS0_OUT       MCHP_PINMUX(a, 14, 0x2a8, 32, periph)
/* pa14_tstbus2_out */
#define PA14_TSTBUS2_OUT       MCHP_PINMUX(a, 14, 0x2ac, 34, periph)
/* pa14_tstbus4_out */
#define PA14_TSTBUS4_OUT       MCHP_PINMUX(a, 14, 0x2a8, 33, periph)
/* pa14_tstbus6_out */
#define PA14_TSTBUS6_OUT       MCHP_PINMUX(a, 14, 0x2ac, 35, periph)
/* pa14_tstbus8_out */
#define PA14_TSTBUS8_OUT       MCHP_PINMUX(a, 14, 0x2a8, 34, periph)
/* pb0_accmpten_in */
#define PB0_ACCMPTEN_IN        MCHP_PINMUX(b, 0, 0x18c, 4, periph)
/* pb0_cclin0_in */
#define PB0_CCLIN0_IN          MCHP_PINMUX(b, 0, 0xb4, 4, periph)
/* pb0_cclin1_in */
#define PB0_CCLIN1_IN          MCHP_PINMUX(b, 0, 0xb8, 21, periph)
/* pb0_cclin3_in */
#define PB0_CCLIN3_IN          MCHP_PINMUX(b, 0, 0xc0, 4, periph)
/* pb0_cclin4_in */
#define PB0_CCLIN4_IN          MCHP_PINMUX(b, 0, 0xc4, 21, periph)
/* pb0_cclo0_out */
#define PB0_CCLO0_OUT          MCHP_PINMUX(b, 0, 0x2bc, 1, periph)
/* pb0_cclo1_out */
#define PB0_CCLO1_OUT          MCHP_PINMUX(b, 0, 0x2b8, 1, periph)
/* pb0_coex_bt_state_out */
#define PB0_COEX_BT_STATE_OUT  MCHP_PINMUX(b, 0, 0x2b4, 37, periph)
/* pb0_coex_rf_act_out */
#define PB0_COEX_RF_ACT_OUT    MCHP_PINMUX(b, 0, 0x2b8, 41, periph)
/* pb0_extint0_in */
#define PB0_EXTINT0_IN         MCHP_PINMUX(b, 0, 0x0, 4, periph)
/* pb0_extint1_in */
#define PB0_EXTINT1_IN         MCHP_PINMUX(b, 0, 0x4, 21, periph)
/* pb0_fectrl0_out */
#define PB0_FECTRL0_OUT        MCHP_PINMUX(b, 0, 0x2b8, 40, periph)
/* pb0_fectrl1_out */
#define PB0_FECTRL1_OUT        MCHP_PINMUX(b, 0, 0x2b4, 35, periph)
/* pb0_fectrl2_out */
#define PB0_FECTRL2_OUT        MCHP_PINMUX(b, 0, 0x2b4, 36, periph)
/* pb0_gmac_tsucomp_out */
#define PB0_GMAC_TSUCOMP_OUT   MCHP_PINMUX(b, 0, 0x2bc, 14, periph)
/* pb0_qd0_out */
#define PB0_QD0_OUT            MCHP_PINMUX(b, 0, 0x2b8, 35, periph)
/* pb0_qd1_in */
#define PB0_QD1_IN             MCHP_PINMUX(b, 0, 0xa4, 4, periph)
/* pb0_qd1_out */
#define PB0_QD1_OUT            MCHP_PINMUX(b, 0, 0x2b4, 30, periph)
/* pb0_qd2_in */
#define PB0_QD2_IN             MCHP_PINMUX(b, 0, 0xa8, 21, periph)
/* pb0_qd2_out */
#define PB0_QD2_OUT            MCHP_PINMUX(b, 0, 0x2b4, 29, periph)
/* pb0_qd3_out */
#define PB0_QD3_OUT            MCHP_PINMUX(b, 0, 0x2b4, 28, periph)
/* pb0_qeiccmp0_out */
#define PB0_QEICCMP0_OUT       MCHP_PINMUX(b, 0, 0x2b4, 31, periph)
/* pb0_qeihome0g1_in */
#define PB0_QEIHOME0G1_IN      MCHP_PINMUX(b, 0, 0x16c, 4, periph)
/* pb0_qeihome0g2_in */
#define PB0_QEIHOME0G2_IN      MCHP_PINMUX(b, 0, 0x170, 21, periph)
/* pb0_qeiindx0g2_in */
#define PB0_QEIINDX0G2_IN      MCHP_PINMUX(b, 0, 0x174, 21, periph)
/* pb0_qeiqeb0g5_in */
#define PB0_QEIQEB0G5_IN       MCHP_PINMUX(b, 0, 0x188, 8, periph)
/* pb0_qspics_out */
#define PB0_QSPICS_OUT         MCHP_PINMUX(b, 0, 0x2b4, 27, periph)
/* pb0_scom0p0_in */
#define PB0_SCOM0P0_IN         MCHP_PINMUX(b, 0, 0x40, 21, periph)
/* pb0_scom0p0_out */
#define PB0_SCOM0P0_OUT        MCHP_PINMUX(b, 0, 0x2b8, 2, periph)
/* pb0_scom0p2_out */
#define PB0_SCOM0P2_OUT        MCHP_PINMUX(b, 0, 0x2b4, 2, periph)
/* pb0_scom0p3_in */
#define PB0_SCOM0P3_IN         MCHP_PINMUX(b, 0, 0x4c, 4, periph)
/* pb0_scom0p3_out */
#define PB0_SCOM0P3_OUT        MCHP_PINMUX(b, 0, 0x2b4, 1, periph)
/* pb0_scom1p0_out */
#define PB0_SCOM1P0_OUT        MCHP_PINMUX(b, 0, 0x2b4, 3, periph)
/* pb0_scom1p2_in */
#define PB0_SCOM1P2_IN         MCHP_PINMUX(b, 0, 0x58, 4, periph)
/* pb0_scom1p2_out */
#define PB0_SCOM1P2_OUT        MCHP_PINMUX(b, 0, 0x2b4, 4, periph)
/* pb0_scom1p3_in */
#define PB0_SCOM1P3_IN         MCHP_PINMUX(b, 0, 0x5c, 21, periph)
/* pb0_scom1p3_out */
#define PB0_SCOM1P3_OUT        MCHP_PINMUX(b, 0, 0x2b8, 5, periph)
/* pb0_scom2p0_in */
#define PB0_SCOM2P0_IN         MCHP_PINMUX(b, 0, 0x60, 21, periph)
/* pb0_scom2p0_out */
#define PB0_SCOM2P0_OUT        MCHP_PINMUX(b, 0, 0x2b8, 7, periph)
/* pb0_scom2p2_out */
#define PB0_SCOM2P2_OUT        MCHP_PINMUX(b, 0, 0x2b4, 6, periph)
/* pb0_scom2p3_in */
#define PB0_SCOM2P3_IN         MCHP_PINMUX(b, 0, 0x6c, 4, periph)
/* pb0_scom2p3_out */
#define PB0_SCOM2P3_OUT        MCHP_PINMUX(b, 0, 0x2b4, 5, periph)
/* pb0_scom3p0_out */
#define PB0_SCOM3P0_OUT        MCHP_PINMUX(b, 0, 0x2b4, 7, periph)
/* pb0_scom3p2_in */
#define PB0_SCOM3P2_IN         MCHP_PINMUX(b, 0, 0x78, 4, periph)
/* pb0_scom3p2_out */
#define PB0_SCOM3P2_OUT        MCHP_PINMUX(b, 0, 0x2b4, 8, periph)
/* pb0_scom3p3_in */
#define PB0_SCOM3P3_IN         MCHP_PINMUX(b, 0, 0x7c, 21, periph)
/* pb0_scom3p3_out */
#define PB0_SCOM3P3_OUT        MCHP_PINMUX(b, 0, 0x2b8, 10, periph)
/* pb0_scom4p0_in */
#define PB0_SCOM4P0_IN         MCHP_PINMUX(b, 0, 0x80, 21, periph)
/* pb0_scom4p0_out */
#define PB0_SCOM4P0_OUT        MCHP_PINMUX(b, 0, 0x2b8, 12, periph)
/* pb0_scom4p2_out */
#define PB0_SCOM4P2_OUT        MCHP_PINMUX(b, 0, 0x2b4, 10, periph)
/* pb0_scom4p3_in */
#define PB0_SCOM4P3_IN         MCHP_PINMUX(b, 0, 0x8c, 4, periph)
/* pb0_scom4p3_out */
#define PB0_SCOM4P3_OUT        MCHP_PINMUX(b, 0, 0x2b4, 9, periph)
/* pb0_scom5p0_out */
#define PB0_SCOM5P0_OUT        MCHP_PINMUX(b, 0, 0x2b4, 11, periph)
/* pb0_scom5p2_in */
#define PB0_SCOM5P2_IN         MCHP_PINMUX(b, 0, 0x98, 4, periph)
/* pb0_scom5p2_out */
#define PB0_SCOM5P2_OUT        MCHP_PINMUX(b, 0, 0x2b4, 12, periph)
/* pb0_scom5p3_in */
#define PB0_SCOM5P3_IN         MCHP_PINMUX(b, 0, 0x9c, 21, periph)
/* pb0_scom5p3_out */
#define PB0_SCOM5P3_OUT        MCHP_PINMUX(b, 0, 0x2b8, 15, periph)
/* pb0_tc0wo0g1_in */
#define PB0_TC0WO0G1_IN        MCHP_PINMUX(b, 0, 0xcc, 4, periph)
/* pb0_tc0wo0g2_in */
#define PB0_TC0WO0G2_IN        MCHP_PINMUX(b, 0, 0xd0, 21, periph)
/* pb0_tc0wo1_out */
#define PB0_TC0WO1_OUT         MCHP_PINMUX(b, 0, 0x2b4, 18, periph)
/* pb0_tc1wo0g1_in */
#define PB0_TC1WO0G1_IN        MCHP_PINMUX(b, 0, 0xdc, 4, periph)
/* pb0_tc1wo0_out */
#define PB0_TC1WO0_OUT         MCHP_PINMUX(b, 0, 0x2b4, 19, periph)
/* pb0_tc1wo1g2_in */
#define PB0_TC1WO1G2_IN        MCHP_PINMUX(b, 0, 0xe4, 21, periph)
/* pb0_tc1wo1_out */
#define PB0_TC1WO1_OUT         MCHP_PINMUX(b, 0, 0x2b8, 25, periph)
/* pb0_tc2wo0g1_in */
#define PB0_TC2WO0G1_IN        MCHP_PINMUX(b, 0, 0xec, 4, periph)
/* pb0_tc2wo0_out */
#define PB0_TC2WO0_OUT         MCHP_PINMUX(b, 0, 0x2b4, 20, periph)
/* pb0_tc2wo1g2_in */
#define PB0_TC2WO1G2_IN        MCHP_PINMUX(b, 0, 0xf4, 21, periph)
/* pb0_tc2wo1_out */
#define PB0_TC2WO1_OUT         MCHP_PINMUX(b, 0, 0x2b8, 26, periph)
/* pb0_tc3wo0g1_in */
#define PB0_TC3WO0G1_IN        MCHP_PINMUX(b, 0, 0xfc, 4, periph)
/* pb0_tc3wo0_out */
#define PB0_TC3WO0_OUT         MCHP_PINMUX(b, 0, 0x2b4, 21, periph)
/* pb0_tc3wo1g2_in */
#define PB0_TC3WO1G2_IN        MCHP_PINMUX(b, 0, 0x104, 21, periph)
/* pb0_tc3wo1_out */
#define PB0_TC3WO1_OUT         MCHP_PINMUX(b, 0, 0x2b8, 27, periph)
/* pb0_tc4wo0g1_in */
#define PB0_TC4WO0G1_IN        MCHP_PINMUX(b, 0, 0x10c, 4, periph)
/* pb0_tc4wo0_out */
#define PB0_TC4WO0_OUT         MCHP_PINMUX(b, 0, 0x2b4, 22, periph)
/* pb0_tc4wo1g2_in */
#define PB0_TC4WO1G2_IN        MCHP_PINMUX(b, 0, 0x114, 21, periph)
/* pb0_tc4wo1_out */
#define PB0_TC4WO1_OUT         MCHP_PINMUX(b, 0, 0x2b8, 28, periph)
/* pb0_tc5wo0g1_in */
#define PB0_TC5WO0G1_IN        MCHP_PINMUX(b, 0, 0x11c, 4, periph)
/* pb0_tc5wo0_out */
#define PB0_TC5WO0_OUT         MCHP_PINMUX(b, 0, 0x2b4, 23, periph)
/* pb0_tc5wo1g2_in */
#define PB0_TC5WO1G2_IN        MCHP_PINMUX(b, 0, 0x124, 21, periph)
/* pb0_tc5wo1_out */
#define PB0_TC5WO1_OUT         MCHP_PINMUX(b, 0, 0x2b8, 29, periph)
/* pb0_tc6wo0g1_in */
#define PB0_TC6WO0G1_IN        MCHP_PINMUX(b, 0, 0x12c, 4, periph)
/* pb0_tc6wo0_out */
#define PB0_TC6WO0_OUT         MCHP_PINMUX(b, 0, 0x2b4, 24, periph)
/* pb0_tc6wo1g2_in */
#define PB0_TC6WO1G2_IN        MCHP_PINMUX(b, 0, 0x134, 21, periph)
/* pb0_tc6wo1_out */
#define PB0_TC6WO1_OUT         MCHP_PINMUX(b, 0, 0x2b8, 30, periph)
/* pb0_tc7wo0g1_in */
#define PB0_TC7WO0G1_IN        MCHP_PINMUX(b, 0, 0x13c, 4, periph)
/* pb0_tc7wo0_out */
#define PB0_TC7WO0_OUT         MCHP_PINMUX(b, 0, 0x2b4, 25, periph)
/* pb0_tc7wo1g2_in */
#define PB0_TC7WO1G2_IN        MCHP_PINMUX(b, 0, 0x144, 21, periph)
/* pb0_tc7wo1_out */
#define PB0_TC7WO1_OUT         MCHP_PINMUX(b, 0, 0x2b8, 31, periph)
/* pb0_tc8wo0g1_in */
#define PB0_TC8WO0G1_IN        MCHP_PINMUX(b, 0, 0x14c, 4, periph)
/* pb0_tc8wo0_out */
#define PB0_TC8WO0_OUT         MCHP_PINMUX(b, 0, 0x2b4, 26, periph)
/* pb0_tc8wo1g2_in */
#define PB0_TC8WO1G2_IN        MCHP_PINMUX(b, 0, 0x154, 21, periph)
/* pb0_tc8wo1g5_in */
#define PB0_TC8WO1G5_IN        MCHP_PINMUX(b, 0, 0x158, 8, periph)
/* pb0_tc8wo1_out */
#define PB0_TC8WO1_OUT         MCHP_PINMUX(b, 0, 0x2b8, 32, periph)
/* pb0_tc9wo0g2_in */
#define PB0_TC9WO0G2_IN        MCHP_PINMUX(b, 0, 0x15c, 21, periph)
/* pb0_tc9wo0_out */
#define PB0_TC9WO0_OUT         MCHP_PINMUX(b, 0, 0x2b8, 33, periph)
/* pb0_tc9wo1g5_in */
#define PB0_TC9WO1G5_IN        MCHP_PINMUX(b, 0, 0x168, 8, periph)
/* pb0_tc9wo1_out */
#define PB0_TC9WO1_OUT         MCHP_PINMUX(b, 0, 0x2bc, 11, periph)
/* pb0_tcc0wo0_out */
#define PB0_TCC0WO0_OUT        MCHP_PINMUX(b, 0, 0x2b4, 13, periph)
/* pb0_tcc0wo1_out */
#define PB0_TCC0WO1_OUT        MCHP_PINMUX(b, 0, 0x2b8, 17, periph)
/* pb0_tcc0wo2_out */
#define PB0_TCC0WO2_OUT        MCHP_PINMUX(b, 0, 0x2bc, 5, periph)
/* pb0_tcc0wo3_out */
#define PB0_TCC0WO3_OUT        MCHP_PINMUX(b, 0, 0x2b8, 19, periph)
/* pb0_tcc0wo4_out */
#define PB0_TCC0WO4_OUT        MCHP_PINMUX(b, 0, 0x2b4, 14, periph)
/* pb0_tcc0wo5_out */
#define PB0_TCC0WO5_OUT        MCHP_PINMUX(b, 0, 0x2b8, 18, periph)
/* pb0_tcc1wo0_out */
#define PB0_TCC1WO0_OUT        MCHP_PINMUX(b, 0, 0x2b4, 15, periph)
/* pb0_tcc1wo1_out */
#define PB0_TCC1WO1_OUT        MCHP_PINMUX(b, 0, 0x2b8, 20, periph)
/* pb0_tcc1wo2_out */
#define PB0_TCC1WO2_OUT        MCHP_PINMUX(b, 0, 0x2bc, 8, periph)
/* pb0_tcc1wo3_out */
#define PB0_TCC1WO3_OUT        MCHP_PINMUX(b, 0, 0x2b8, 22, periph)
/* pb0_tcc1wo4_out */
#define PB0_TCC1WO4_OUT        MCHP_PINMUX(b, 0, 0x2b4, 16, periph)
/* pb0_tcc1wo5_out */
#define PB0_TCC1WO5_OUT        MCHP_PINMUX(b, 0, 0x2b8, 21, periph)
/* pb0_tcc2wo0_out */
#define PB0_TCC2WO0_OUT        MCHP_PINMUX(b, 0, 0x2b4, 17, periph)
/* pb0_tcc2wo1_out */
#define PB0_TCC2WO1_OUT        MCHP_PINMUX(b, 0, 0x2b8, 23, periph)
/* pb0_tstbus0_out */
#define PB0_TSTBUS0_OUT        MCHP_PINMUX(b, 0, 0x2b4, 32, periph)
/* pb0_tstbus3_out */
#define PB0_TSTBUS3_OUT        MCHP_PINMUX(b, 0, 0x2bc, 15, periph)
/* pb0_tstbus4_out */
#define PB0_TSTBUS4_OUT        MCHP_PINMUX(b, 0, 0x2b4, 33, periph)
/* pb0_tstbus5_out */
#define PB0_TSTBUS5_OUT        MCHP_PINMUX(b, 0, 0x2b8, 38, periph)
/* pb0_tstbus7_out */
#define PB0_TSTBUS7_OUT        MCHP_PINMUX(b, 0, 0x2bc, 16, periph)
/* pb0_tstbus8_out */
#define PB0_TSTBUS8_OUT        MCHP_PINMUX(b, 0, 0x2b4, 34, periph)
/* pb0_tstbus9_out */
