zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cx_bz/bz62/pic32cx2051bz62064-pinctrl.h
#define PB4_TCC2WO0_OUT        MCHP_PINMUX(b, 4, 0x2e4, 17, periph)
/* pb4_tcc2wo1_out */
#define PB4_TCC2WO1_OUT        MCHP_PINMUX(b, 4, 0x2e8, 23, periph)
/* pb4_tstbus0_out */
#define PB4_TSTBUS0_OUT        MCHP_PINMUX(b, 4, 0x2e4, 32, periph)
/* pb4_tstbus2_out */
#define PB4_TSTBUS2_OUT        MCHP_PINMUX(b, 4, 0x2ec, 34, periph)
/* pb4_tstbus3_out */
#define PB4_TSTBUS3_OUT        MCHP_PINMUX(b, 4, 0x2f0, 15, periph)
/* pb4_tstbus4_out */
#define PB4_TSTBUS4_OUT        MCHP_PINMUX(b, 4, 0x2e4, 33, periph)
/* pb4_tstbus5_out */
#define PB4_TSTBUS5_OUT        MCHP_PINMUX(b, 4, 0x2e8, 38, periph)
/* pb4_tstbus6_out */
#define PB4_TSTBUS6_OUT        MCHP_PINMUX(b, 4, 0x2ec, 35, periph)
/* pb4_tstbus7_out */
#define PB4_TSTBUS7_OUT        MCHP_PINMUX(b, 4, 0x2f0, 16, periph)
/* pb4_tstbus8_out */
#define PB4_TSTBUS8_OUT        MCHP_PINMUX(b, 4, 0x2e4, 34, periph)
/* pb4_tstbus9_out */
#define PB4_TSTBUS9_OUT        MCHP_PINMUX(b, 4, 0x2e8, 39, periph)
/* pb4_tstbus11_out */
#define PB4_TSTBUS11_OUT       MCHP_PINMUX(b, 4, 0x2f0, 17, periph)
/* pb5_ac_cmp0_out */
#define PB5_AC_CMP0_OUT        MCHP_PINMUX(b, 5, 0x2f8, 40, periph)
/* pb5_ac_cmptrdy_out */
#define PB5_AC_CMPTRDY_OUT     MCHP_PINMUX(b, 5, 0x2f8, 41, periph)
/* pb5_can1rx_in */
#define PB5_CAN1RX_IN          MCHP_PINMUX(b, 5, 0x190, 21, periph)
/* pb5_cclin1_in */
#define PB5_CCLIN1_IN          MCHP_PINMUX(b, 5, 0xb8, 18, periph)
/* pb5_cclin2_in */
#define PB5_CCLIN2_IN          MCHP_PINMUX(b, 5, 0xbc, 21, periph)
/* pb5_cclin4_in */
#define PB5_CCLIN4_IN          MCHP_PINMUX(b, 5, 0xc4, 18, periph)
/* pb5_cclin5_in */
#define PB5_CCLIN5_IN          MCHP_PINMUX(b, 5, 0xc8, 21, periph)
/* pb5_cclo0_out */
#define PB5_CCLO0_OUT          MCHP_PINMUX(b, 5, 0x2f8, 1, periph)
/* pb5_cclo1_out */
#define PB5_CCLO1_OUT          MCHP_PINMUX(b, 5, 0x2f4, 1, periph)
/* pb5_coex_rf_act_out */
#define PB5_COEX_RF_ACT_OUT    MCHP_PINMUX(b, 5, 0x2f4, 41, periph)
/* pb5_extint1_in */
#define PB5_EXTINT1_IN         MCHP_PINMUX(b, 5, 0x4, 18, periph)
/* pb5_extint2_in */
#define PB5_EXTINT2_IN         MCHP_PINMUX(b, 5, 0x8, 21, periph)
/* pb5_fectrl0_out */
#define PB5_FECTRL0_OUT        MCHP_PINMUX(b, 5, 0x2f4, 40, periph)
/* pb5_fectrl4_out */
#define PB5_FECTRL4_OUT        MCHP_PINMUX(b, 5, 0x2f8, 42, periph)
/* pb5_qd0_out */
#define PB5_QD0_OUT            MCHP_PINMUX(b, 5, 0x2f4, 35, periph)
/* pb5_qd1_out */
#define PB5_QD1_OUT            MCHP_PINMUX(b, 5, 0x2f8, 35, periph)
/* pb5_qd2_in */
#define PB5_QD2_IN             MCHP_PINMUX(b, 5, 0xa8, 18, periph)
/* pb5_qd2_out */
#define PB5_QD2_OUT            MCHP_PINMUX(b, 5, 0x2f4, 37, periph)
/* pb5_qd3_in */
#define PB5_QD3_IN             MCHP_PINMUX(b, 5, 0xac, 21, periph)
/* pb5_qd3_out */
#define PB5_QD3_OUT            MCHP_PINMUX(b, 5, 0x2f4, 36, periph)
/* pb5_qeihome0g2_in */
#define PB5_QEIHOME0G2_IN      MCHP_PINMUX(b, 5, 0x170, 18, periph)
/* pb5_qeiindx0g2_in */
#define PB5_QEIINDX0G2_IN      MCHP_PINMUX(b, 5, 0x174, 18, periph)
/* pb5_qeiindx0g3_in */
#define PB5_QEIINDX0G3_IN      MCHP_PINMUX(b, 5, 0x178, 21, periph)
/* pb5_qeiqea0g3_in */
#define PB5_QEIQEA0G3_IN       MCHP_PINMUX(b, 5, 0x17c, 21, periph)
/* pb5_qspics_out */
#define PB5_QSPICS_OUT         MCHP_PINMUX(b, 5, 0x2f4, 34, periph)
/* pb5_qspi_sck_out */
#define PB5_QSPI_SCK_OUT       MCHP_PINMUX(b, 5, 0x2fc, 7, periph)
/* pb5_refi_in */
#define PB5_REFI_IN            MCHP_PINMUX(b, 5, 0xb0, 2, periph)
/* pb5_refo1_out */
#define PB5_REFO1_OUT          MCHP_PINMUX(b, 5, 0x2fc, 8, periph)
/* pb5_refo2_out */
#define PB5_REFO2_OUT          MCHP_PINMUX(b, 5, 0x2fc, 9, periph)
/* pb5_refo3_out */
#define PB5_REFO3_OUT          MCHP_PINMUX(b, 5, 0x2fc, 10, periph)
/* pb5_refo4_out */
#define PB5_REFO4_OUT          MCHP_PINMUX(b, 5, 0x2fc, 11, periph)
/* pb5_scom0p0_in */
#define PB5_SCOM0P0_IN         MCHP_PINMUX(b, 5, 0x40, 18, periph)
/* pb5_scom0p0_out */
#define PB5_SCOM0P0_OUT        MCHP_PINMUX(b, 5, 0x2f4, 2, periph)
/* pb5_scom0p1_in */
#define PB5_SCOM0P1_IN         MCHP_PINMUX(b, 5, 0x44, 2, periph)
/* pb5_scom0p1_out */
#define PB5_SCOM0P1_OUT        MCHP_PINMUX(b, 5, 0x2fc, 1, periph)
/* pb5_scom0p2_out */
#define PB5_SCOM0P2_OUT        MCHP_PINMUX(b, 5, 0x2f4, 4, periph)
/* pb5_scom0p3_out */
#define PB5_SCOM0P3_OUT        MCHP_PINMUX(b, 5, 0x2f4, 3, periph)
/* pb5_scom1p0_in */
#define PB5_SCOM1P0_IN         MCHP_PINMUX(b, 5, 0x50, 21, periph)
/* pb5_scom1p0_out */
#define PB5_SCOM1P0_OUT        MCHP_PINMUX(b, 5, 0x2f8, 5, periph)
/* pb5_scom1p1_in */
#define PB5_SCOM1P1_IN         MCHP_PINMUX(b, 5, 0x54, 2, periph)
/* pb5_scom1p1_out */
#define PB5_SCOM1P1_OUT        MCHP_PINMUX(b, 5, 0x2fc, 2, periph)
/* pb5_scom1p2_out */
#define PB5_SCOM1P2_OUT        MCHP_PINMUX(b, 5, 0x2f4, 6, periph)
/* pb5_scom1p3_in */
#define PB5_SCOM1P3_IN         MCHP_PINMUX(b, 5, 0x5c, 18, periph)
/* pb5_scom1p3_out */
#define PB5_SCOM1P3_OUT        MCHP_PINMUX(b, 5, 0x2f4, 5, periph)
/* pb5_scom2p0_in */
#define PB5_SCOM2P0_IN         MCHP_PINMUX(b, 5, 0x60, 18, periph)
/* pb5_scom2p0_out */
#define PB5_SCOM2P0_OUT        MCHP_PINMUX(b, 5, 0x2f4, 7, periph)
/* pb5_scom2p1_in */
#define PB5_SCOM2P1_IN         MCHP_PINMUX(b, 5, 0x64, 2, periph)
/* pb5_scom2p1_out */
#define PB5_SCOM2P1_OUT        MCHP_PINMUX(b, 5, 0x2fc, 3, periph)
/* pb5_scom2p2_out */
#define PB5_SCOM2P2_OUT        MCHP_PINMUX(b, 5, 0x2f4, 9, periph)
/* pb5_scom2p3_out */
#define PB5_SCOM2P3_OUT        MCHP_PINMUX(b, 5, 0x2f4, 8, periph)
/* pb5_scom3p0_in */
#define PB5_SCOM3P0_IN         MCHP_PINMUX(b, 5, 0x70, 21, periph)
/* pb5_scom3p0_out */
#define PB5_SCOM3P0_OUT        MCHP_PINMUX(b, 5, 0x2f8, 10, periph)
/* pb5_scom3p1_in */
#define PB5_SCOM3P1_IN         MCHP_PINMUX(b, 5, 0x74, 2, periph)
/* pb5_scom3p1_out */
#define PB5_SCOM3P1_OUT        MCHP_PINMUX(b, 5, 0x2fc, 4, periph)
/* pb5_scom3p2_out */
#define PB5_SCOM3P2_OUT        MCHP_PINMUX(b, 5, 0x2f4, 11, periph)
/* pb5_scom3p3_in */
#define PB5_SCOM3P3_IN         MCHP_PINMUX(b, 5, 0x7c, 18, periph)
/* pb5_scom3p3_out */
#define PB5_SCOM3P3_OUT        MCHP_PINMUX(b, 5, 0x2f4, 10, periph)
/* pb5_scom4p0_in */
#define PB5_SCOM4P0_IN         MCHP_PINMUX(b, 5, 0x80, 18, periph)
/* pb5_scom4p0_out */
#define PB5_SCOM4P0_OUT        MCHP_PINMUX(b, 5, 0x2f4, 12, periph)
/* pb5_scom4p1_in */
#define PB5_SCOM4P1_IN         MCHP_PINMUX(b, 5, 0x84, 2, periph)
/* pb5_scom4p1_out */
#define PB5_SCOM4P1_OUT        MCHP_PINMUX(b, 5, 0x2fc, 5, periph)
/* pb5_scom4p2_out */
#define PB5_SCOM4P2_OUT        MCHP_PINMUX(b, 5, 0x2f4, 14, periph)
/* pb5_scom4p3_out */
#define PB5_SCOM4P3_OUT        MCHP_PINMUX(b, 5, 0x2f4, 13, periph)
/* pb5_scom5p0_in */
#define PB5_SCOM5P0_IN         MCHP_PINMUX(b, 5, 0x90, 21, periph)
/* pb5_scom5p0_out */
#define PB5_SCOM5P0_OUT        MCHP_PINMUX(b, 5, 0x2f8, 15, periph)
/* pb5_scom5p1_in */
#define PB5_SCOM5P1_IN         MCHP_PINMUX(b, 5, 0x94, 2, periph)
/* pb5_scom5p1_out */
#define PB5_SCOM5P1_OUT        MCHP_PINMUX(b, 5, 0x2fc, 6, periph)
/* pb5_scom5p2_out */
#define PB5_SCOM5P2_OUT        MCHP_PINMUX(b, 5, 0x2f4, 16, periph)
/* pb5_scom5p3_in */
#define PB5_SCOM5P3_IN         MCHP_PINMUX(b, 5, 0x9c, 18, periph)
/* pb5_scom5p3_out */
#define PB5_SCOM5P3_OUT        MCHP_PINMUX(b, 5, 0x2f4, 15, periph)
/* pb5_tc0wo0g2_in */
#define PB5_TC0WO0G2_IN        MCHP_PINMUX(b, 5, 0xd0, 18, periph)
/* pb5_tc0wo0_out */
#define PB5_TC0WO0_OUT         MCHP_PINMUX(b, 5, 0x2f8, 24, periph)
/* pb5_tc0wo1g3_in */
#define PB5_TC0WO1G3_IN        MCHP_PINMUX(b, 5, 0xd4, 21, periph)
/* pb5_tc0wo1_out */
#define PB5_TC0WO1_OUT         MCHP_PINMUX(b, 5, 0x2f4, 24, periph)
/* pb5_tc1wo0_out */
#define PB5_TC1WO0_OUT         MCHP_PINMUX(b, 5, 0x2f8, 25, periph)
/* pb5_tc1wo1g2_in */
#define PB5_TC1WO1G2_IN        MCHP_PINMUX(b, 5, 0xe4, 18, periph)
/* pb5_tc1wo1_out */
#define PB5_TC1WO1_OUT         MCHP_PINMUX(b, 5, 0x2f4, 25, periph)
/* pb5_tc2wo0g3_in */
#define PB5_TC2WO0G3_IN        MCHP_PINMUX(b, 5, 0xf0, 21, periph)
/* pb5_tc2wo0_out */
#define PB5_TC2WO0_OUT         MCHP_PINMUX(b, 5, 0x2f8, 26, periph)
/* pb5_tc2wo1g2_in */
#define PB5_TC2WO1G2_IN        MCHP_PINMUX(b, 5, 0xf4, 18, periph)
/* pb5_tc2wo1_out */
#define PB5_TC2WO1_OUT         MCHP_PINMUX(b, 5, 0x2f4, 26, periph)
/* pb5_tc3wo0g3_in */
#define PB5_TC3WO0G3_IN        MCHP_PINMUX(b, 5, 0x100, 21, periph)
/* pb5_tc3wo0_out */
#define PB5_TC3WO0_OUT         MCHP_PINMUX(b, 5, 0x2f8, 27, periph)
/* pb5_tc3wo1g2_in */
#define PB5_TC3WO1G2_IN        MCHP_PINMUX(b, 5, 0x104, 18, periph)
/* pb5_tc3wo1_out */
#define PB5_TC3WO1_OUT         MCHP_PINMUX(b, 5, 0x2f4, 27, periph)
/* pb5_tc4wo0g3_in */
#define PB5_TC4WO0G3_IN        MCHP_PINMUX(b, 5, 0x110, 21, periph)
/* pb5_tc4wo0_out */
#define PB5_TC4WO0_OUT         MCHP_PINMUX(b, 5, 0x2f8, 28, periph)
/* pb5_tc4wo1g2_in */
#define PB5_TC4WO1G2_IN        MCHP_PINMUX(b, 5, 0x114, 18, periph)
/* pb5_tc4wo1_out */
#define PB5_TC4WO1_OUT         MCHP_PINMUX(b, 5, 0x2f4, 28, periph)
/* pb5_tc5wo0g3_in */
#define PB5_TC5WO0G3_IN        MCHP_PINMUX(b, 5, 0x120, 21, periph)
/* pb5_tc5wo0_out */
#define PB5_TC5WO0_OUT         MCHP_PINMUX(b, 5, 0x2f8, 29, periph)
/* pb5_tc5wo1g2_in */
#define PB5_TC5WO1G2_IN        MCHP_PINMUX(b, 5, 0x124, 18, periph)
/* pb5_tc5wo1_out */
#define PB5_TC5WO1_OUT         MCHP_PINMUX(b, 5, 0x2f4, 29, periph)
/* pb5_tc6wo0g3_in */
#define PB5_TC6WO0G3_IN        MCHP_PINMUX(b, 5, 0x130, 21, periph)
/* pb5_tc6wo0_out */
#define PB5_TC6WO0_OUT         MCHP_PINMUX(b, 5, 0x2f8, 30, periph)
/* pb5_tc6wo1g2_in */
#define PB5_TC6WO1G2_IN        MCHP_PINMUX(b, 5, 0x134, 18, periph)
/* pb5_tc6wo1_out */
#define PB5_TC6WO1_OUT         MCHP_PINMUX(b, 5, 0x2f4, 30, periph)
/* pb5_tc7wo0g3_in */
#define PB5_TC7WO0G3_IN        MCHP_PINMUX(b, 5, 0x140, 21, periph)
/* pb5_tc7wo0_out */
#define PB5_TC7WO0_OUT         MCHP_PINMUX(b, 5, 0x2f8, 31, periph)
/* pb5_tc7wo1g2_in */
#define PB5_TC7WO1G2_IN        MCHP_PINMUX(b, 5, 0x144, 18, periph)
/* pb5_tc7wo1_out */
#define PB5_TC7WO1_OUT         MCHP_PINMUX(b, 5, 0x2f4, 31, periph)
/* pb5_tc8wo0g3_in */
#define PB5_TC8WO0G3_IN        MCHP_PINMUX(b, 5, 0x150, 21, periph)
/* pb5_tc8wo0_out */
#define PB5_TC8WO0_OUT         MCHP_PINMUX(b, 5, 0x2f8, 32, periph)
/* pb5_tc8wo1g2_in */
#define PB5_TC8WO1G2_IN        MCHP_PINMUX(b, 5, 0x154, 18, periph)
/* pb5_tc8wo1_out */
#define PB5_TC8WO1_OUT         MCHP_PINMUX(b, 5, 0x2f4, 32, periph)
/* pb5_tc9wo0g2_in */
#define PB5_TC9WO0G2_IN        MCHP_PINMUX(b, 5, 0x15c, 18, periph)
/* pb5_tc9wo0_out */
#define PB5_TC9WO0_OUT         MCHP_PINMUX(b, 5, 0x2f4, 33, periph)
/* pb5_tc9wo1g3_in */
#define PB5_TC9WO1G3_IN        MCHP_PINMUX(b, 5, 0x164, 21, periph)
/* pb5_tc9wo1_out */
#define PB5_TC9WO1_OUT         MCHP_PINMUX(b, 5, 0x2f8, 33, periph)
/* pb5_tcc0wo0_out */
#define PB5_TCC0WO0_OUT        MCHP_PINMUX(b, 5, 0x2f8, 18, periph)
/* pb5_tcc0wo1_out */
#define PB5_TCC0WO1_OUT        MCHP_PINMUX(b, 5, 0x2f4, 17, periph)
/* pb5_tcc0wo2_out */
#define PB5_TCC0WO2_OUT        MCHP_PINMUX(b, 5, 0x2f8, 17, periph)
/* pb5_tcc0wo3_out */
#define PB5_TCC0WO3_OUT        MCHP_PINMUX(b, 5, 0x2f4, 19, periph)
/* pb5_tcc0wo4_out */
#define PB5_TCC0WO4_OUT        MCHP_PINMUX(b, 5, 0x2f8, 19, periph)
/* pb5_tcc0wo5_out */
#define PB5_TCC0WO5_OUT        MCHP_PINMUX(b, 5, 0x2f4, 18, periph)
/* pb5_tcc1wo0_out */
#define PB5_TCC1WO0_OUT        MCHP_PINMUX(b, 5, 0x2f8, 21, periph)
/* pb5_tcc1wo1_out */
#define PB5_TCC1WO1_OUT        MCHP_PINMUX(b, 5, 0x2f4, 20, periph)
/* pb5_tcc1wo2_out */
#define PB5_TCC1WO2_OUT        MCHP_PINMUX(b, 5, 0x2f8, 20, periph)
/* pb5_tcc1wo3_out */
#define PB5_TCC1WO3_OUT        MCHP_PINMUX(b, 5, 0x2f4, 22, periph)
/* pb5_tcc1wo4_out */
#define PB5_TCC1WO4_OUT        MCHP_PINMUX(b, 5, 0x2f8, 22, periph)
/* pb5_tcc1wo5_out */
#define PB5_TCC1WO5_OUT        MCHP_PINMUX(b, 5, 0x2f4, 21, periph)
/* pb5_tcc2wo0_out */
#define PB5_TCC2WO0_OUT        MCHP_PINMUX(b, 5, 0x2f8, 23, periph)
/* pb5_tcc2wo1_out */
#define PB5_TCC2WO1_OUT        MCHP_PINMUX(b, 5, 0x2f4, 23, periph)
/* pb5_tstbus1_out */
#define PB5_TSTBUS1_OUT        MCHP_PINMUX(b, 5, 0x2f8, 38, periph)
/* pb5_tstbus5_out */
#define PB5_TSTBUS5_OUT        MCHP_PINMUX(b, 5, 0x2f4, 38, periph)
/* pb5_tstbus9_out */
#define PB5_TSTBUS9_OUT        MCHP_PINMUX(b, 5, 0x2f4, 39, periph)
/* pb5_tstbus10_out */
#define PB5_TSTBUS10_OUT       MCHP_PINMUX(b, 5, 0x2f8, 39, periph)
/* pb6_accmpten_in */
#define PB6_ACCMPTEN_IN        MCHP_PINMUX(b, 6, 0x18c, 5, periph)
/* pb6_ac_cmp0_out */
#define PB6_AC_CMP0_OUT        MCHP_PINMUX(b, 6, 0x304, 40, periph)
/* pb6_ac_cmp1_out */
#define PB6_AC_CMP1_OUT        MCHP_PINMUX(b, 6, 0x308, 36, periph)
/* pb6_ac_cmptout_out */
#define PB6_AC_CMPTOUT_OUT     MCHP_PINMUX(b, 6, 0x308, 37, periph)
/* pb6_ac_cmptrdy_out */
#define PB6_AC_CMPTRDY_OUT     MCHP_PINMUX(b, 6, 0x304, 41, periph)
/* pb6_can1rx_in */
#define PB6_CAN1RX_IN          MCHP_PINMUX(b, 6, 0x190, 17, periph)
/* pb6_can1_tx_out */
#define PB6_CAN1_TX_OUT        MCHP_PINMUX(b, 6, 0x308, 38, periph)
/* pb6_cclin0_in */
#define PB6_CCLIN0_IN          MCHP_PINMUX(b, 6, 0xb4, 5, periph)
/* pb6_cclin2_in */
#define PB6_CCLIN2_IN          MCHP_PINMUX(b, 6, 0xbc, 17, periph)
/* pb6_cclin3_in */
#define PB6_CCLIN3_IN          MCHP_PINMUX(b, 6, 0xc0, 5, periph)
/* pb6_cclin5_in */
#define PB6_CCLIN5_IN          MCHP_PINMUX(b, 6, 0xc8, 17, periph)
/* pb6_cclo0_out */
#define PB6_CCLO0_OUT          MCHP_PINMUX(b, 6, 0x304, 1, periph)
/* pb6_cclo1_out */
#define PB6_CCLO1_OUT          MCHP_PINMUX(b, 6, 0x308, 1, periph)
/* pb6_coexwlanact_in */
#define PB6_COEXWLANACT_IN     MCHP_PINMUX(b, 6, 0x194, 21, periph)
/* pb6_coex_bt_state_out */
#define PB6_COEX_BT_STATE_OUT  MCHP_PINMUX(b, 6, 0x300, 37, periph)
/* pb6_extint0_in */
#define PB6_EXTINT0_IN         MCHP_PINMUX(b, 6, 0x0, 5, periph)
/* pb6_extint2_in */
#define PB6_EXTINT2_IN         MCHP_PINMUX(b, 6, 0x8, 17, periph)
/* pb6_extint3_in */
#define PB6_EXTINT3_IN         MCHP_PINMUX(b, 6, 0xc, 21, periph)
/* pb6_fectrl1_out */
#define PB6_FECTRL1_OUT        MCHP_PINMUX(b, 6, 0x300, 35, periph)
/* pb6_fectrl2_out */
#define PB6_FECTRL2_OUT        MCHP_PINMUX(b, 6, 0x300, 36, periph)
/* pb6_fectrl3_out */
#define PB6_FECTRL3_OUT        MCHP_PINMUX(b, 6, 0x308, 39, periph)
/* pb6_fectrl4_out */
#define PB6_FECTRL4_OUT        MCHP_PINMUX(b, 6, 0x304, 42, periph)
/* pb6_fectrl5_out */
#define PB6_FECTRL5_OUT        MCHP_PINMUX(b, 6, 0x308, 40, periph)
/* pb6_nmi_in */
#define PB6_NMI_IN             MCHP_PINMUX(b, 6, 0x3c, 21, periph)
/* pb6_qd0_in */
#define PB6_QD0_IN             MCHP_PINMUX(b, 6, 0xa0, 21, periph)
/* pb6_qd0_out */
#define PB6_QD0_OUT            MCHP_PINMUX(b, 6, 0x304, 36, periph)
/* pb6_qd1_in */
#define PB6_QD1_IN             MCHP_PINMUX(b, 6, 0xa4, 5, periph)
/* pb6_qd1_out */
#define PB6_QD1_OUT            MCHP_PINMUX(b, 6, 0x300, 30, periph)
/* pb6_qd2_out */
#define PB6_QD2_OUT            MCHP_PINMUX(b, 6, 0x300, 29, periph)
/* pb6_qd3_in */
#define PB6_QD3_IN             MCHP_PINMUX(b, 6, 0xac, 17, periph)
/* pb6_qd3_out */
#define PB6_QD3_OUT            MCHP_PINMUX(b, 6, 0x300, 28, periph)
/* pb6_qeiccmp0_out */
#define PB6_QEICCMP0_OUT       MCHP_PINMUX(b, 6, 0x300, 31, periph)
/* pb6_qeihome0g1_in */
#define PB6_QEIHOME0G1_IN      MCHP_PINMUX(b, 6, 0x16c, 5, periph)
/* pb6_qeiindx0g3_in */
#define PB6_QEIINDX0G3_IN      MCHP_PINMUX(b, 6, 0x178, 17, periph)
/* pb6_qeiqea0g3_in */
#define PB6_QEIQEA0G3_IN       MCHP_PINMUX(b, 6, 0x17c, 17, periph)
/* pb6_qeiqea0g4_in */
#define PB6_QEIQEA0G4_IN       MCHP_PINMUX(b, 6, 0x180, 21, periph)
/* pb6_qeiqeb0g4_in */
#define PB6_QEIQEB0G4_IN       MCHP_PINMUX(b, 6, 0x184, 21, periph)
/* pb6_qspics_out */
#define PB6_QSPICS_OUT         MCHP_PINMUX(b, 6, 0x300, 27, periph)
/* pb6_qspi_sck_out */
#define PB6_QSPI_SCK_OUT       MCHP_PINMUX(b, 6, 0x30c, 7, periph)
/* pb6_refi_in */
#define PB6_REFI_IN            MCHP_PINMUX(b, 6, 0xb0, 9, periph)
/* pb6_refo1_out */
#define PB6_REFO1_OUT          MCHP_PINMUX(b, 6, 0x30c, 8, periph)
/* pb6_refo2_out */
#define PB6_REFO2_OUT          MCHP_PINMUX(b, 6, 0x30c, 9, periph)
/* pb6_refo3_out */
#define PB6_REFO3_OUT          MCHP_PINMUX(b, 6, 0x30c, 10, periph)
/* pb6_refo4_out */
#define PB6_REFO4_OUT          MCHP_PINMUX(b, 6, 0x30c, 11, periph)
/* pb6_scom0p0_out */
#define PB6_SCOM0P0_OUT        MCHP_PINMUX(b, 6, 0x304, 2, periph)
/* pb6_scom0p1_in */
#define PB6_SCOM0P1_IN         MCHP_PINMUX(b, 6, 0x44, 9, periph)
/* pb6_scom0p1_out */
#define PB6_SCOM0P1_OUT        MCHP_PINMUX(b, 6, 0x30c, 1, periph)
/* pb6_scom0p2_in */
#define PB6_SCOM0P2_IN         MCHP_PINMUX(b, 6, 0x48, 21, periph)
/* pb6_scom0p2_out */
#define PB6_SCOM0P2_OUT        MCHP_PINMUX(b, 6, 0x300, 2, periph)
/* pb6_scom0p3_in */
#define PB6_SCOM0P3_IN         MCHP_PINMUX(b, 6, 0x4c, 5, periph)
/* pb6_scom0p3_out */
#define PB6_SCOM0P3_OUT        MCHP_PINMUX(b, 6, 0x300, 1, periph)
/* pb6_scom1p0_in */
#define PB6_SCOM1P0_IN         MCHP_PINMUX(b, 6, 0x50, 17, periph)
/* pb6_scom1p0_out */
#define PB6_SCOM1P0_OUT        MCHP_PINMUX(b, 6, 0x300, 3, periph)
/* pb6_scom1p1_in */
#define PB6_SCOM1P1_IN         MCHP_PINMUX(b, 6, 0x54, 9, periph)
/* pb6_scom1p1_out */
#define PB6_SCOM1P1_OUT        MCHP_PINMUX(b, 6, 0x30c, 2, periph)
/* pb6_scom1p2_in */
#define PB6_SCOM1P2_IN         MCHP_PINMUX(b, 6, 0x58, 5, periph)
/* pb6_scom1p2_out */
#define PB6_SCOM1P2_OUT        MCHP_PINMUX(b, 6, 0x300, 4, periph)
/* pb6_scom1p3_out */
#define PB6_SCOM1P3_OUT        MCHP_PINMUX(b, 6, 0x304, 6, periph)
/* pb6_scom2p0_out */
#define PB6_SCOM2P0_OUT        MCHP_PINMUX(b, 6, 0x304, 7, periph)
/* pb6_scom2p1_in */
#define PB6_SCOM2P1_IN         MCHP_PINMUX(b, 6, 0x64, 9, periph)
/* pb6_scom2p1_out */
#define PB6_SCOM2P1_OUT        MCHP_PINMUX(b, 6, 0x30c, 3, periph)
/* pb6_scom2p2_in */
#define PB6_SCOM2P2_IN         MCHP_PINMUX(b, 6, 0x68, 21, periph)
/* pb6_scom2p2_out */
#define PB6_SCOM2P2_OUT        MCHP_PINMUX(b, 6, 0x300, 6, periph)
/* pb6_scom2p3_in */
#define PB6_SCOM2P3_IN         MCHP_PINMUX(b, 6, 0x6c, 5, periph)
/* pb6_scom2p3_out */
#define PB6_SCOM2P3_OUT        MCHP_PINMUX(b, 6, 0x300, 5, periph)
/* pb6_scom3p0_in */
#define PB6_SCOM3P0_IN         MCHP_PINMUX(b, 6, 0x70, 17, periph)
/* pb6_scom3p0_out */
#define PB6_SCOM3P0_OUT        MCHP_PINMUX(b, 6, 0x300, 7, periph)
/* pb6_scom3p1_in */
#define PB6_SCOM3P1_IN         MCHP_PINMUX(b, 6, 0x74, 9, periph)
/* pb6_scom3p1_out */
#define PB6_SCOM3P1_OUT        MCHP_PINMUX(b, 6, 0x30c, 4, periph)
/* pb6_scom3p2_in */
#define PB6_SCOM3P2_IN         MCHP_PINMUX(b, 6, 0x78, 5, periph)
/* pb6_scom3p2_out */
#define PB6_SCOM3P2_OUT        MCHP_PINMUX(b, 6, 0x300, 8, periph)
/* pb6_scom3p3_out */
#define PB6_SCOM3P3_OUT        MCHP_PINMUX(b, 6, 0x304, 11, periph)
/* pb6_scom4p0_out */
#define PB6_SCOM4P0_OUT        MCHP_PINMUX(b, 6, 0x304, 12, periph)
/* pb6_scom4p1_in */
#define PB6_SCOM4P1_IN         MCHP_PINMUX(b, 6, 0x84, 9, periph)
/* pb6_scom4p1_out */
#define PB6_SCOM4P1_OUT        MCHP_PINMUX(b, 6, 0x30c, 5, periph)
/* pb6_scom4p2_in */
#define PB6_SCOM4P2_IN         MCHP_PINMUX(b, 6, 0x88, 21, periph)
/* pb6_scom4p2_out */
#define PB6_SCOM4P2_OUT        MCHP_PINMUX(b, 6, 0x300, 10, periph)
/* pb6_scom4p3_in */
#define PB6_SCOM4P3_IN         MCHP_PINMUX(b, 6, 0x8c, 5, periph)
/* pb6_scom4p3_out */
#define PB6_SCOM4P3_OUT        MCHP_PINMUX(b, 6, 0x300, 9, periph)
/* pb6_scom5p0_in */
#define PB6_SCOM5P0_IN         MCHP_PINMUX(b, 6, 0x90, 17, periph)
/* pb6_scom5p0_out */
#define PB6_SCOM5P0_OUT        MCHP_PINMUX(b, 6, 0x300, 11, periph)
/* pb6_scom5p1_in */
#define PB6_SCOM5P1_IN         MCHP_PINMUX(b, 6, 0x94, 9, periph)
/* pb6_scom5p1_out */
#define PB6_SCOM5P1_OUT        MCHP_PINMUX(b, 6, 0x30c, 6, periph)
/* pb6_scom5p2_in */
#define PB6_SCOM5P2_IN         MCHP_PINMUX(b, 6, 0x98, 5, periph)
/* pb6_scom5p2_out */
#define PB6_SCOM5P2_OUT        MCHP_PINMUX(b, 6, 0x300, 12, periph)
/* pb6_scom5p3_out */
#define PB6_SCOM5P3_OUT        MCHP_PINMUX(b, 6, 0x304, 16, periph)
/* pb6_tc0wo0g1_in */
#define PB6_TC0WO0G1_IN        MCHP_PINMUX(b, 6, 0xcc, 5, periph)
/* pb6_tc0wo0_out */
#define PB6_TC0WO0_OUT         MCHP_PINMUX(b, 6, 0x304, 24, periph)
/* pb6_tc0wo1g3_in */
#define PB6_TC0WO1G3_IN        MCHP_PINMUX(b, 6, 0xd4, 17, periph)
/* pb6_tc0wo1g4_in */
#define PB6_TC0WO1G4_IN        MCHP_PINMUX(b, 6, 0xd8, 21, periph)
/* pb6_tc0wo1_out */
#define PB6_TC0WO1_OUT         MCHP_PINMUX(b, 6, 0x300, 18, periph)
/* pb6_tc1wo0g1_in */
#define PB6_TC1WO0G1_IN        MCHP_PINMUX(b, 6, 0xdc, 5, periph)
/* pb6_tc1wo0_out */
#define PB6_TC1WO0_OUT         MCHP_PINMUX(b, 6, 0x300, 19, periph)
/* pb6_tc1wo1_out */
#define PB6_TC1WO1_OUT         MCHP_PINMUX(b, 6, 0x308, 22, periph)
/* pb6_tc2wo0g1_in */
#define PB6_TC2WO0G1_IN        MCHP_PINMUX(b, 6, 0xec, 5, periph)
/* pb6_tc2wo0g3_in */
#define PB6_TC2WO0G3_IN        MCHP_PINMUX(b, 6, 0xf0, 17, periph)
/* pb6_tc2wo0_out */
#define PB6_TC2WO0_OUT         MCHP_PINMUX(b, 6, 0x300, 20, periph)
/* pb6_tc2wo1g4_in */
#define PB6_TC2WO1G4_IN        MCHP_PINMUX(b, 6, 0xf8, 21, periph)
/* pb6_tc2wo1_out */
#define PB6_TC2WO1_OUT         MCHP_PINMUX(b, 6, 0x308, 23, periph)
/* pb6_tc3wo0g1_in */
#define PB6_TC3WO0G1_IN        MCHP_PINMUX(b, 6, 0xfc, 5, periph)
/* pb6_tc3wo0g3_in */
#define PB6_TC3WO0G3_IN        MCHP_PINMUX(b, 6, 0x100, 17, periph)
/* pb6_tc3wo0_out */
#define PB6_TC3WO0_OUT         MCHP_PINMUX(b, 6, 0x300, 21, periph)
/* pb6_tc3wo1g4_in */
#define PB6_TC3WO1G4_IN        MCHP_PINMUX(b, 6, 0x108, 21, periph)
/* pb6_tc3wo1_out */
#define PB6_TC3WO1_OUT         MCHP_PINMUX(b, 6, 0x308, 24, periph)
/* pb6_tc4wo0g1_in */
#define PB6_TC4WO0G1_IN        MCHP_PINMUX(b, 6, 0x10c, 5, periph)
/* pb6_tc4wo0g3_in */
#define PB6_TC4WO0G3_IN        MCHP_PINMUX(b, 6, 0x110, 17, periph)
/* pb6_tc4wo0_out */
#define PB6_TC4WO0_OUT         MCHP_PINMUX(b, 6, 0x300, 22, periph)
/* pb6_tc4wo1g4_in */
#define PB6_TC4WO1G4_IN        MCHP_PINMUX(b, 6, 0x118, 21, periph)
/* pb6_tc4wo1_out */
#define PB6_TC4WO1_OUT         MCHP_PINMUX(b, 6, 0x308, 25, periph)
/* pb6_tc5wo0g1_in */
#define PB6_TC5WO0G1_IN        MCHP_PINMUX(b, 6, 0x11c, 5, periph)
/* pb6_tc5wo0g3_in */
#define PB6_TC5WO0G3_IN        MCHP_PINMUX(b, 6, 0x120, 17, periph)
/* pb6_tc5wo0_out */
#define PB6_TC5WO0_OUT         MCHP_PINMUX(b, 6, 0x300, 23, periph)
/* pb6_tc5wo1g4_in */
#define PB6_TC5WO1G4_IN        MCHP_PINMUX(b, 6, 0x128, 21, periph)
/* pb6_tc5wo1_out */
#define PB6_TC5WO1_OUT         MCHP_PINMUX(b, 6, 0x308, 26, periph)
/* pb6_tc6wo0g1_in */
#define PB6_TC6WO0G1_IN        MCHP_PINMUX(b, 6, 0x12c, 5, periph)
/* pb6_tc6wo0g3_in */
#define PB6_TC6WO0G3_IN        MCHP_PINMUX(b, 6, 0x130, 17, periph)
/* pb6_tc6wo0_out */
#define PB6_TC6WO0_OUT         MCHP_PINMUX(b, 6, 0x300, 24, periph)
/* pb6_tc6wo1g4_in */
#define PB6_TC6WO1G4_IN        MCHP_PINMUX(b, 6, 0x138, 21, periph)
/* pb6_tc6wo1_out */
#define PB6_TC6WO1_OUT         MCHP_PINMUX(b, 6, 0x308, 27, periph)
/* pb6_tc7wo0g1_in */
#define PB6_TC7WO0G1_IN        MCHP_PINMUX(b, 6, 0x13c, 5, periph)
/* pb6_tc7wo0g3_in */
#define PB6_TC7WO0G3_IN        MCHP_PINMUX(b, 6, 0x140, 17, periph)
/* pb6_tc7wo0_out */
#define PB6_TC7WO0_OUT         MCHP_PINMUX(b, 6, 0x300, 25, periph)
/* pb6_tc7wo1g4_in */
#define PB6_TC7WO1G4_IN        MCHP_PINMUX(b, 6, 0x148, 21, periph)
/* pb6_tc7wo1_out */
#define PB6_TC7WO1_OUT         MCHP_PINMUX(b, 6, 0x308, 28, periph)
/* pb6_tc8wo0g1_in */
#define PB6_TC8WO0G1_IN        MCHP_PINMUX(b, 6, 0x14c, 5, periph)
/* pb6_tc8wo0g3_in */
#define PB6_TC8WO0G3_IN        MCHP_PINMUX(b, 6, 0x150, 17, periph)
/* pb6_tc8wo0_out */
#define PB6_TC8WO0_OUT         MCHP_PINMUX(b, 6, 0x300, 26, periph)
/* pb6_tc9wo0g4_in */
#define PB6_TC9WO0G4_IN        MCHP_PINMUX(b, 6, 0x160, 21, periph)
/* pb6_tc9wo0_out */
#define PB6_TC9WO0_OUT         MCHP_PINMUX(b, 6, 0x308, 29, periph)
/* pb6_tc9wo1g3_in */
#define PB6_TC9WO1G3_IN        MCHP_PINMUX(b, 6, 0x164, 17, periph)
/* pb6_tc9wo1_out */
#define PB6_TC9WO1_OUT         MCHP_PINMUX(b, 6, 0x304, 33, periph)
/* pb6_tcc0wo0_out */
