zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cx_bz/bz62/pic32cx2051bz62064-pinctrl.h
#define PB10_TCC1WO1_OUT       MCHP_PINMUX(b, 10, 0x33c, 18, periph)
/* pb10_tcc1wo2_out */
#define PB10_TCC1WO2_OUT       MCHP_PINMUX(b, 10, 0x338, 20, periph)
/* pb10_tcc1wo3_out */
#define PB10_TCC1WO3_OUT       MCHP_PINMUX(b, 10, 0x33c, 17, periph)
/* pb10_tcc1wo4_out */
#define PB10_TCC1WO4_OUT       MCHP_PINMUX(b, 10, 0x338, 22, periph)
/* pb10_tcc1wo5_out */
#define PB10_TCC1WO5_OUT       MCHP_PINMUX(b, 10, 0x33c, 19, periph)
/* pb10_tcc2wo0_out */
#define PB10_TCC2WO0_OUT       MCHP_PINMUX(b, 10, 0x338, 23, periph)
/* pb10_tcc2wo1_out */
#define PB10_TCC2WO1_OUT       MCHP_PINMUX(b, 10, 0x33c, 20, periph)
/* pb10_tstbus1_out */
#define PB10_TSTBUS1_OUT       MCHP_PINMUX(b, 10, 0x338, 38, periph)
/* pb10_tstbus2_out */
#define PB10_TSTBUS2_OUT       MCHP_PINMUX(b, 10, 0x33c, 34, periph)
/* pb10_tstbus3_out */
#define PB10_TSTBUS3_OUT       MCHP_PINMUX(b, 10, 0x340, 15, periph)
/* pb10_tstbus6_out */
#define PB10_TSTBUS6_OUT       MCHP_PINMUX(b, 10, 0x33c, 35, periph)
/* pb10_tstbus7_out */
#define PB10_TSTBUS7_OUT       MCHP_PINMUX(b, 10, 0x340, 16, periph)
/* pb10_tstbus10_out */
#define PB10_TSTBUS10_OUT      MCHP_PINMUX(b, 10, 0x338, 39, periph)
/* pb10_tstbus11_out */
#define PB10_TSTBUS11_OUT      MCHP_PINMUX(b, 10, 0x340, 17, periph)
/* pb11_accmpten_in */
#define PB11_ACCMPTEN_IN       MCHP_PINMUX(b, 11, 0x18c, 6, periph)
/* pb11_ac_cmp1_out */
#define PB11_AC_CMP1_OUT       MCHP_PINMUX(b, 11, 0x348, 36, periph)
/* pb11_ac_cmptout_out */
#define PB11_AC_CMPTOUT_OUT    MCHP_PINMUX(b, 11, 0x348, 37, periph)
/* pb11_can1_tx_out */
#define PB11_CAN1_TX_OUT       MCHP_PINMUX(b, 11, 0x348, 38, periph)
/* pb11_cclin0_in */
#define PB11_CCLIN0_IN         MCHP_PINMUX(b, 11, 0xb4, 6, periph)
/* pb11_cclin3_in */
#define PB11_CCLIN3_IN         MCHP_PINMUX(b, 11, 0xc0, 6, periph)
/* pb11_cclo1_out */
#define PB11_CCLO1_OUT         MCHP_PINMUX(b, 11, 0x348, 1, periph)
/* pb11_coexwlanact_in */
#define PB11_COEXWLANACT_IN    MCHP_PINMUX(b, 11, 0x194, 16, periph)
/* pb11_coex_bt_state_out */
#define PB11_COEX_BT_STATE_OUT MCHP_PINMUX(b, 11, 0x344, 37, periph)
/* pb11_extint0_in */
#define PB11_EXTINT0_IN        MCHP_PINMUX(b, 11, 0x0, 6, periph)
/* pb11_extint3_in */
#define PB11_EXTINT3_IN        MCHP_PINMUX(b, 11, 0xc, 16, periph)
/* pb11_fectrl1_out */
#define PB11_FECTRL1_OUT       MCHP_PINMUX(b, 11, 0x344, 35, periph)
/* pb11_fectrl2_out */
#define PB11_FECTRL2_OUT       MCHP_PINMUX(b, 11, 0x344, 36, periph)
/* pb11_fectrl3_out */
#define PB11_FECTRL3_OUT       MCHP_PINMUX(b, 11, 0x348, 39, periph)
/* pb11_fectrl5_out */
#define PB11_FECTRL5_OUT       MCHP_PINMUX(b, 11, 0x348, 40, periph)
/* pb11_nmi_in */
#define PB11_NMI_IN            MCHP_PINMUX(b, 11, 0x3c, 16, periph)
/* pb11_qd0_in */
#define PB11_QD0_IN            MCHP_PINMUX(b, 11, 0xa0, 16, periph)
/* pb11_qd0_out */
#define PB11_QD0_OUT           MCHP_PINMUX(b, 11, 0x348, 33, periph)
/* pb11_qd1_in */
#define PB11_QD1_IN            MCHP_PINMUX(b, 11, 0xa4, 6, periph)
/* pb11_qd1_out */
#define PB11_QD1_OUT           MCHP_PINMUX(b, 11, 0x344, 30, periph)
/* pb11_qd2_out */
#define PB11_QD2_OUT           MCHP_PINMUX(b, 11, 0x344, 29, periph)
/* pb11_qd3_out */
#define PB11_QD3_OUT           MCHP_PINMUX(b, 11, 0x344, 28, periph)
/* pb11_qeiccmp0_out */
#define PB11_QEICCMP0_OUT      MCHP_PINMUX(b, 11, 0x344, 31, periph)
/* pb11_qeihome0g1_in */
#define PB11_QEIHOME0G1_IN     MCHP_PINMUX(b, 11, 0x16c, 6, periph)
/* pb11_qeiqea0g4_in */
#define PB11_QEIQEA0G4_IN      MCHP_PINMUX(b, 11, 0x180, 16, periph)
/* pb11_qeiqeb0g4_in */
#define PB11_QEIQEB0G4_IN      MCHP_PINMUX(b, 11, 0x184, 16, periph)
/* pb11_qspics_out */
#define PB11_QSPICS_OUT        MCHP_PINMUX(b, 11, 0x344, 27, periph)
/* pb11_scom0p0_out */
#define PB11_SCOM0P0_OUT       MCHP_PINMUX(b, 11, 0x348, 3, periph)
/* pb11_scom0p2_in */
#define PB11_SCOM0P2_IN        MCHP_PINMUX(b, 11, 0x48, 16, periph)
/* pb11_scom0p2_out */
#define PB11_SCOM0P2_OUT       MCHP_PINMUX(b, 11, 0x344, 2, periph)
/* pb11_scom0p3_in */
#define PB11_SCOM0P3_IN        MCHP_PINMUX(b, 11, 0x4c, 6, periph)
/* pb11_scom0p3_out */
#define PB11_SCOM0P3_OUT       MCHP_PINMUX(b, 11, 0x344, 1, periph)
/* pb11_scom1p0_out */
#define PB11_SCOM1P0_OUT       MCHP_PINMUX(b, 11, 0x344, 3, periph)
/* pb11_scom1p2_in */
#define PB11_SCOM1P2_IN        MCHP_PINMUX(b, 11, 0x58, 6, periph)
/* pb11_scom1p2_out */
#define PB11_SCOM1P2_OUT       MCHP_PINMUX(b, 11, 0x344, 4, periph)
/* pb11_scom1p3_out */
#define PB11_SCOM1P3_OUT       MCHP_PINMUX(b, 11, 0x348, 4, periph)
/* pb11_scom2p0_out */
#define PB11_SCOM2P0_OUT       MCHP_PINMUX(b, 11, 0x348, 7, periph)
/* pb11_scom2p2_in */
#define PB11_SCOM2P2_IN        MCHP_PINMUX(b, 11, 0x68, 16, periph)
/* pb11_scom2p2_out */
#define PB11_SCOM2P2_OUT       MCHP_PINMUX(b, 11, 0x344, 6, periph)
/* pb11_scom2p3_in */
#define PB11_SCOM2P3_IN        MCHP_PINMUX(b, 11, 0x6c, 6, periph)
/* pb11_scom2p3_out */
#define PB11_SCOM2P3_OUT       MCHP_PINMUX(b, 11, 0x344, 5, periph)
/* pb11_scom3p0_out */
#define PB11_SCOM3P0_OUT       MCHP_PINMUX(b, 11, 0x344, 7, periph)
/* pb11_scom3p2_in */
#define PB11_SCOM3P2_IN        MCHP_PINMUX(b, 11, 0x78, 6, periph)
/* pb11_scom3p2_out */
#define PB11_SCOM3P2_OUT       MCHP_PINMUX(b, 11, 0x344, 8, periph)
/* pb11_scom3p3_out */
#define PB11_SCOM3P3_OUT       MCHP_PINMUX(b, 11, 0x348, 8, periph)
/* pb11_scom4p0_out */
#define PB11_SCOM4P0_OUT       MCHP_PINMUX(b, 11, 0x348, 11, periph)
/* pb11_scom4p2_in */
#define PB11_SCOM4P2_IN        MCHP_PINMUX(b, 11, 0x88, 16, periph)
/* pb11_scom4p2_out */
#define PB11_SCOM4P2_OUT       MCHP_PINMUX(b, 11, 0x344, 10, periph)
/* pb11_scom4p3_in */
#define PB11_SCOM4P3_IN        MCHP_PINMUX(b, 11, 0x8c, 6, periph)
/* pb11_scom4p3_out */
#define PB11_SCOM4P3_OUT       MCHP_PINMUX(b, 11, 0x344, 9, periph)
/* pb11_scom5p0_out */
#define PB11_SCOM5P0_OUT       MCHP_PINMUX(b, 11, 0x344, 11, periph)
/* pb11_scom5p2_in */
#define PB11_SCOM5P2_IN        MCHP_PINMUX(b, 11, 0x98, 6, periph)
/* pb11_scom5p2_out */
#define PB11_SCOM5P2_OUT       MCHP_PINMUX(b, 11, 0x344, 12, periph)
/* pb11_scom5p3_out */
#define PB11_SCOM5P3_OUT       MCHP_PINMUX(b, 11, 0x348, 12, periph)
/* pb11_tc0wo0g1_in */
#define PB11_TC0WO0G1_IN       MCHP_PINMUX(b, 11, 0xcc, 6, periph)
/* pb11_tc0wo0_out */
#define PB11_TC0WO0_OUT        MCHP_PINMUX(b, 11, 0x348, 21, periph)
/* pb11_tc0wo1g4_in */
#define PB11_TC0WO1G4_IN       MCHP_PINMUX(b, 11, 0xd8, 16, periph)
/* pb11_tc0wo1_out */
#define PB11_TC0WO1_OUT        MCHP_PINMUX(b, 11, 0x344, 18, periph)
/* pb11_tc1wo0g1_in */
#define PB11_TC1WO0G1_IN       MCHP_PINMUX(b, 11, 0xdc, 6, periph)
/* pb11_tc1wo0_out */
#define PB11_TC1WO0_OUT        MCHP_PINMUX(b, 11, 0x344, 19, periph)
/* pb11_tc1wo1_out */
#define PB11_TC1WO1_OUT        MCHP_PINMUX(b, 11, 0x348, 22, periph)
/* pb11_tc2wo0g1_in */
#define PB11_TC2WO0G1_IN       MCHP_PINMUX(b, 11, 0xec, 6, periph)
/* pb11_tc2wo0_out */
#define PB11_TC2WO0_OUT        MCHP_PINMUX(b, 11, 0x344, 20, periph)
/* pb11_tc2wo1g4_in */
#define PB11_TC2WO1G4_IN       MCHP_PINMUX(b, 11, 0xf8, 16, periph)
/* pb11_tc2wo1_out */
#define PB11_TC2WO1_OUT        MCHP_PINMUX(b, 11, 0x348, 23, periph)
/* pb11_tc3wo0g1_in */
#define PB11_TC3WO0G1_IN       MCHP_PINMUX(b, 11, 0xfc, 6, periph)
/* pb11_tc3wo0_out */
#define PB11_TC3WO0_OUT        MCHP_PINMUX(b, 11, 0x344, 21, periph)
/* pb11_tc3wo1g4_in */
#define PB11_TC3WO1G4_IN       MCHP_PINMUX(b, 11, 0x108, 16, periph)
/* pb11_tc3wo1_out */
#define PB11_TC3WO1_OUT        MCHP_PINMUX(b, 11, 0x348, 24, periph)
/* pb11_tc4wo0g1_in */
#define PB11_TC4WO0G1_IN       MCHP_PINMUX(b, 11, 0x10c, 6, periph)
/* pb11_tc4wo0_out */
#define PB11_TC4WO0_OUT        MCHP_PINMUX(b, 11, 0x344, 22, periph)
/* pb11_tc4wo1g4_in */
#define PB11_TC4WO1G4_IN       MCHP_PINMUX(b, 11, 0x118, 16, periph)
/* pb11_tc4wo1_out */
#define PB11_TC4WO1_OUT        MCHP_PINMUX(b, 11, 0x348, 25, periph)
/* pb11_tc5wo0g1_in */
#define PB11_TC5WO0G1_IN       MCHP_PINMUX(b, 11, 0x11c, 6, periph)
/* pb11_tc5wo0_out */
#define PB11_TC5WO0_OUT        MCHP_PINMUX(b, 11, 0x344, 23, periph)
/* pb11_tc5wo1g4_in */
#define PB11_TC5WO1G4_IN       MCHP_PINMUX(b, 11, 0x128, 16, periph)
/* pb11_tc5wo1_out */
#define PB11_TC5WO1_OUT        MCHP_PINMUX(b, 11, 0x348, 26, periph)
/* pb11_tc6wo0g1_in */
#define PB11_TC6WO0G1_IN       MCHP_PINMUX(b, 11, 0x12c, 6, periph)
/* pb11_tc6wo0_out */
#define PB11_TC6WO0_OUT        MCHP_PINMUX(b, 11, 0x344, 24, periph)
/* pb11_tc6wo1g4_in */
#define PB11_TC6WO1G4_IN       MCHP_PINMUX(b, 11, 0x138, 16, periph)
/* pb11_tc6wo1_out */
#define PB11_TC6WO1_OUT        MCHP_PINMUX(b, 11, 0x348, 27, periph)
/* pb11_tc7wo0g1_in */
#define PB11_TC7WO0G1_IN       MCHP_PINMUX(b, 11, 0x13c, 6, periph)
/* pb11_tc7wo0_out */
#define PB11_TC7WO0_OUT        MCHP_PINMUX(b, 11, 0x344, 25, periph)
/* pb11_tc7wo1g4_in */
#define PB11_TC7WO1G4_IN       MCHP_PINMUX(b, 11, 0x148, 16, periph)
/* pb11_tc7wo1_out */
#define PB11_TC7WO1_OUT        MCHP_PINMUX(b, 11, 0x348, 28, periph)
/* pb11_tc8wo0g1_in */
#define PB11_TC8WO0G1_IN       MCHP_PINMUX(b, 11, 0x14c, 6, periph)
/* pb11_tc8wo0_out */
#define PB11_TC8WO0_OUT        MCHP_PINMUX(b, 11, 0x344, 26, periph)
/* pb11_tc9wo0g4_in */
#define PB11_TC9WO0G4_IN       MCHP_PINMUX(b, 11, 0x160, 16, periph)
/* pb11_tc9wo0_out */
#define PB11_TC9WO0_OUT        MCHP_PINMUX(b, 11, 0x348, 29, periph)
/* pb11_tcc0wo0_out */
#define PB11_TCC0WO0_OUT       MCHP_PINMUX(b, 11, 0x344, 13, periph)
/* pb11_tcc0wo1_out */
#define PB11_TCC0WO1_OUT       MCHP_PINMUX(b, 11, 0x348, 15, periph)
/* pb11_tcc0wo3_out */
#define PB11_TCC0WO3_OUT       MCHP_PINMUX(b, 11, 0x348, 14, periph)
/* pb11_tcc0wo4_out */
#define PB11_TCC0WO4_OUT       MCHP_PINMUX(b, 11, 0x344, 14, periph)
/* pb11_tcc0wo5_out */
#define PB11_TCC0WO5_OUT       MCHP_PINMUX(b, 11, 0x348, 16, periph)
/* pb11_tcc1wo0_out */
#define PB11_TCC1WO0_OUT       MCHP_PINMUX(b, 11, 0x344, 15, periph)
/* pb11_tcc1wo1_out */
#define PB11_TCC1WO1_OUT       MCHP_PINMUX(b, 11, 0x348, 18, periph)
/* pb11_tcc1wo3_out */
#define PB11_TCC1WO3_OUT       MCHP_PINMUX(b, 11, 0x348, 17, periph)
/* pb11_tcc1wo4_out */
#define PB11_TCC1WO4_OUT       MCHP_PINMUX(b, 11, 0x344, 16, periph)
/* pb11_tcc1wo5_out */
#define PB11_TCC1WO5_OUT       MCHP_PINMUX(b, 11, 0x348, 19, periph)
/* pb11_tcc2wo0_out */
#define PB11_TCC2WO0_OUT       MCHP_PINMUX(b, 11, 0x344, 17, periph)
/* pb11_tcc2wo1_out */
#define PB11_TCC2WO1_OUT       MCHP_PINMUX(b, 11, 0x348, 20, periph)
/* pb11_tstbus0_out */
#define PB11_TSTBUS0_OUT       MCHP_PINMUX(b, 11, 0x344, 32, periph)
/* pb11_tstbus2_out */
#define PB11_TSTBUS2_OUT       MCHP_PINMUX(b, 11, 0x348, 34, periph)
/* pb11_tstbus4_out */
#define PB11_TSTBUS4_OUT       MCHP_PINMUX(b, 11, 0x344, 33, periph)
/* pb11_tstbus6_out */
#define PB11_TSTBUS6_OUT       MCHP_PINMUX(b, 11, 0x348, 35, periph)
/* pb11_tstbus8_out */
#define PB11_TSTBUS8_OUT       MCHP_PINMUX(b, 11, 0x344, 34, periph)
/* pb12_accmpten_in */
#define PB12_ACCMPTEN_IN       MCHP_PINMUX(b, 12, 0x18c, 19, periph)
/* pb12_cclin0_in */
#define PB12_CCLIN0_IN         MCHP_PINMUX(b, 12, 0xb4, 19, periph)
/* pb12_cclin1_in */
#define PB12_CCLIN1_IN         MCHP_PINMUX(b, 12, 0xb8, 17, periph)
/* pb12_cclin3_in */
#define PB12_CCLIN3_IN         MCHP_PINMUX(b, 12, 0xc0, 19, periph)
/* pb12_cclin4_in */
#define PB12_CCLIN4_IN         MCHP_PINMUX(b, 12, 0xc4, 17, periph)
/* pb12_cclo1_out */
#define PB12_CCLO1_OUT         MCHP_PINMUX(b, 12, 0x350, 1, periph)
/* pb12_coex_bt_state_out */
#define PB12_COEX_BT_STATE_OUT MCHP_PINMUX(b, 12, 0x34c, 37, periph)
/* pb12_coex_rf_act_out */
#define PB12_COEX_RF_ACT_OUT   MCHP_PINMUX(b, 12, 0x350, 41, periph)
/* pb12_extint0_in */
#define PB12_EXTINT0_IN        MCHP_PINMUX(b, 12, 0x0, 19, periph)
/* pb12_extint1_in */
#define PB12_EXTINT1_IN        MCHP_PINMUX(b, 12, 0x4, 17, periph)
/* pb12_fectrl0_out */
#define PB12_FECTRL0_OUT       MCHP_PINMUX(b, 12, 0x350, 40, periph)
/* pb12_fectrl1_out */
#define PB12_FECTRL1_OUT       MCHP_PINMUX(b, 12, 0x34c, 35, periph)
/* pb12_fectrl2_out */
#define PB12_FECTRL2_OUT       MCHP_PINMUX(b, 12, 0x34c, 36, periph)
/* pb12_qd0_out */
#define PB12_QD0_OUT           MCHP_PINMUX(b, 12, 0x350, 35, periph)
/* pb12_qd1_in */
#define PB12_QD1_IN            MCHP_PINMUX(b, 12, 0xa4, 19, periph)
/* pb12_qd1_out */
#define PB12_QD1_OUT           MCHP_PINMUX(b, 12, 0x34c, 30, periph)
/* pb12_qd2_in */
#define PB12_QD2_IN            MCHP_PINMUX(b, 12, 0xa8, 17, periph)
/* pb12_qd2_out */
#define PB12_QD2_OUT           MCHP_PINMUX(b, 12, 0x34c, 29, periph)
/* pb12_qd3_out */
#define PB12_QD3_OUT           MCHP_PINMUX(b, 12, 0x34c, 28, periph)
/* pb12_qeiccmp0_out */
#define PB12_QEICCMP0_OUT      MCHP_PINMUX(b, 12, 0x34c, 31, periph)
/* pb12_qeihome0g1_in */
#define PB12_QEIHOME0G1_IN     MCHP_PINMUX(b, 12, 0x16c, 19, periph)
/* pb12_qeihome0g2_in */
#define PB12_QEIHOME0G2_IN     MCHP_PINMUX(b, 12, 0x170, 17, periph)
/* pb12_qeiindx0g2_in */
#define PB12_QEIINDX0G2_IN     MCHP_PINMUX(b, 12, 0x174, 17, periph)
/* pb12_qspics_out */
#define PB12_QSPICS_OUT        MCHP_PINMUX(b, 12, 0x34c, 27, periph)
/* pb12_scom0p0_in */
#define PB12_SCOM0P0_IN        MCHP_PINMUX(b, 12, 0x40, 17, periph)
/* pb12_scom0p0_out */
#define PB12_SCOM0P0_OUT       MCHP_PINMUX(b, 12, 0x350, 2, periph)
/* pb12_scom0p2_out */
#define PB12_SCOM0P2_OUT       MCHP_PINMUX(b, 12, 0x34c, 2, periph)
/* pb12_scom0p3_in */
#define PB12_SCOM0P3_IN        MCHP_PINMUX(b, 12, 0x4c, 19, periph)
/* pb12_scom0p3_out */
#define PB12_SCOM0P3_OUT       MCHP_PINMUX(b, 12, 0x34c, 1, periph)
/* pb12_scom1p0_out */
#define PB12_SCOM1P0_OUT       MCHP_PINMUX(b, 12, 0x34c, 3, periph)
/* pb12_scom1p2_in */
#define PB12_SCOM1P2_IN        MCHP_PINMUX(b, 12, 0x58, 19, periph)
/* pb12_scom1p2_out */
#define PB12_SCOM1P2_OUT       MCHP_PINMUX(b, 12, 0x34c, 4, periph)
/* pb12_scom1p3_in */
#define PB12_SCOM1P3_IN        MCHP_PINMUX(b, 12, 0x5c, 17, periph)
/* pb12_scom1p3_out */
#define PB12_SCOM1P3_OUT       MCHP_PINMUX(b, 12, 0x350, 5, periph)
/* pb12_scom2p0_in */
#define PB12_SCOM2P0_IN        MCHP_PINMUX(b, 12, 0x60, 17, periph)
/* pb12_scom2p0_out */
#define PB12_SCOM2P0_OUT       MCHP_PINMUX(b, 12, 0x350, 7, periph)
/* pb12_scom2p2_out */
#define PB12_SCOM2P2_OUT       MCHP_PINMUX(b, 12, 0x34c, 6, periph)
/* pb12_scom2p3_in */
#define PB12_SCOM2P3_IN        MCHP_PINMUX(b, 12, 0x6c, 19, periph)
/* pb12_scom2p3_out */
#define PB12_SCOM2P3_OUT       MCHP_PINMUX(b, 12, 0x34c, 5, periph)
/* pb12_scom3p0_out */
#define PB12_SCOM3P0_OUT       MCHP_PINMUX(b, 12, 0x34c, 7, periph)
/* pb12_scom3p2_in */
#define PB12_SCOM3P2_IN        MCHP_PINMUX(b, 12, 0x78, 19, periph)
/* pb12_scom3p2_out */
#define PB12_SCOM3P2_OUT       MCHP_PINMUX(b, 12, 0x34c, 8, periph)
/* pb12_scom3p3_in */
#define PB12_SCOM3P3_IN        MCHP_PINMUX(b, 12, 0x7c, 17, periph)
/* pb12_scom3p3_out */
#define PB12_SCOM3P3_OUT       MCHP_PINMUX(b, 12, 0x350, 10, periph)
/* pb12_scom4p0_in */
#define PB12_SCOM4P0_IN        MCHP_PINMUX(b, 12, 0x80, 17, periph)
/* pb12_scom4p0_out */
#define PB12_SCOM4P0_OUT       MCHP_PINMUX(b, 12, 0x350, 12, periph)
/* pb12_scom4p2_out */
#define PB12_SCOM4P2_OUT       MCHP_PINMUX(b, 12, 0x34c, 10, periph)
/* pb12_scom4p3_in */
#define PB12_SCOM4P3_IN        MCHP_PINMUX(b, 12, 0x8c, 19, periph)
/* pb12_scom4p3_out */
#define PB12_SCOM4P3_OUT       MCHP_PINMUX(b, 12, 0x34c, 9, periph)
/* pb12_scom5p0_out */
#define PB12_SCOM5P0_OUT       MCHP_PINMUX(b, 12, 0x34c, 11, periph)
/* pb12_scom5p2_in */
#define PB12_SCOM5P2_IN        MCHP_PINMUX(b, 12, 0x98, 19, periph)
/* pb12_scom5p2_out */
#define PB12_SCOM5P2_OUT       MCHP_PINMUX(b, 12, 0x34c, 12, periph)
/* pb12_scom5p3_in */
#define PB12_SCOM5P3_IN        MCHP_PINMUX(b, 12, 0x9c, 17, periph)
/* pb12_scom5p3_out */
#define PB12_SCOM5P3_OUT       MCHP_PINMUX(b, 12, 0x350, 15, periph)
/* pb12_tc0wo0g1_in */
#define PB12_TC0WO0G1_IN       MCHP_PINMUX(b, 12, 0xcc, 19, periph)
/* pb12_tc0wo0g2_in */
#define PB12_TC0WO0G2_IN       MCHP_PINMUX(b, 12, 0xd0, 17, periph)
/* pb12_tc0wo1_out */
#define PB12_TC0WO1_OUT        MCHP_PINMUX(b, 12, 0x34c, 18, periph)
/* pb12_tc1wo0g1_in */
#define PB12_TC1WO0G1_IN       MCHP_PINMUX(b, 12, 0xdc, 19, periph)
/* pb12_tc1wo0_out */
#define PB12_TC1WO0_OUT        MCHP_PINMUX(b, 12, 0x34c, 19, periph)
/* pb12_tc1wo1g2_in */
#define PB12_TC1WO1G2_IN       MCHP_PINMUX(b, 12, 0xe4, 17, periph)
/* pb12_tc1wo1_out */
#define PB12_TC1WO1_OUT        MCHP_PINMUX(b, 12, 0x350, 25, periph)
/* pb12_tc2wo0g1_in */
#define PB12_TC2WO0G1_IN       MCHP_PINMUX(b, 12, 0xec, 19, periph)
/* pb12_tc2wo0_out */
#define PB12_TC2WO0_OUT        MCHP_PINMUX(b, 12, 0x34c, 20, periph)
/* pb12_tc2wo1g2_in */
#define PB12_TC2WO1G2_IN       MCHP_PINMUX(b, 12, 0xf4, 17, periph)
/* pb12_tc2wo1_out */
#define PB12_TC2WO1_OUT        MCHP_PINMUX(b, 12, 0x350, 26, periph)
/* pb12_tc3wo0g1_in */
#define PB12_TC3WO0G1_IN       MCHP_PINMUX(b, 12, 0xfc, 19, periph)
/* pb12_tc3wo0_out */
#define PB12_TC3WO0_OUT        MCHP_PINMUX(b, 12, 0x34c, 21, periph)
/* pb12_tc3wo1g2_in */
#define PB12_TC3WO1G2_IN       MCHP_PINMUX(b, 12, 0x104, 17, periph)
/* pb12_tc3wo1_out */
#define PB12_TC3WO1_OUT        MCHP_PINMUX(b, 12, 0x350, 27, periph)
/* pb12_tc4wo0g1_in */
#define PB12_TC4WO0G1_IN       MCHP_PINMUX(b, 12, 0x10c, 19, periph)
/* pb12_tc4wo0_out */
#define PB12_TC4WO0_OUT        MCHP_PINMUX(b, 12, 0x34c, 22, periph)
/* pb12_tc4wo1g2_in */
#define PB12_TC4WO1G2_IN       MCHP_PINMUX(b, 12, 0x114, 17, periph)
/* pb12_tc4wo1_out */
#define PB12_TC4WO1_OUT        MCHP_PINMUX(b, 12, 0x350, 28, periph)
/* pb12_tc5wo0g1_in */
#define PB12_TC5WO0G1_IN       MCHP_PINMUX(b, 12, 0x11c, 19, periph)
/* pb12_tc5wo0_out */
#define PB12_TC5WO0_OUT        MCHP_PINMUX(b, 12, 0x34c, 23, periph)
/* pb12_tc5wo1g2_in */
#define PB12_TC5WO1G2_IN       MCHP_PINMUX(b, 12, 0x124, 17, periph)
/* pb12_tc5wo1_out */
#define PB12_TC5WO1_OUT        MCHP_PINMUX(b, 12, 0x350, 29, periph)
/* pb12_tc6wo0g1_in */
#define PB12_TC6WO0G1_IN       MCHP_PINMUX(b, 12, 0x12c, 19, periph)
/* pb12_tc6wo0_out */
#define PB12_TC6WO0_OUT        MCHP_PINMUX(b, 12, 0x34c, 24, periph)
/* pb12_tc6wo1g2_in */
#define PB12_TC6WO1G2_IN       MCHP_PINMUX(b, 12, 0x134, 17, periph)
/* pb12_tc6wo1_out */
#define PB12_TC6WO1_OUT        MCHP_PINMUX(b, 12, 0x350, 30, periph)
/* pb12_tc7wo0g1_in */
#define PB12_TC7WO0G1_IN       MCHP_PINMUX(b, 12, 0x13c, 19, periph)
/* pb12_tc7wo0_out */
#define PB12_TC7WO0_OUT        MCHP_PINMUX(b, 12, 0x34c, 25, periph)
/* pb12_tc7wo1g2_in */
#define PB12_TC7WO1G2_IN       MCHP_PINMUX(b, 12, 0x144, 17, periph)
/* pb12_tc7wo1_out */
#define PB12_TC7WO1_OUT        MCHP_PINMUX(b, 12, 0x350, 31, periph)
/* pb12_tc8wo0g1_in */
#define PB12_TC8WO0G1_IN       MCHP_PINMUX(b, 12, 0x14c, 19, periph)
/* pb12_tc8wo0_out */
#define PB12_TC8WO0_OUT        MCHP_PINMUX(b, 12, 0x34c, 26, periph)
/* pb12_tc8wo1g2_in */
#define PB12_TC8WO1G2_IN       MCHP_PINMUX(b, 12, 0x154, 17, periph)
/* pb12_tc8wo1_out */
#define PB12_TC8WO1_OUT        MCHP_PINMUX(b, 12, 0x350, 32, periph)
/* pb12_tc9wo0g2_in */
#define PB12_TC9WO0G2_IN       MCHP_PINMUX(b, 12, 0x15c, 17, periph)
/* pb12_tc9wo0_out */
#define PB12_TC9WO0_OUT        MCHP_PINMUX(b, 12, 0x350, 33, periph)
/* pb12_tcc0wo0_out */
#define PB12_TCC0WO0_OUT       MCHP_PINMUX(b, 12, 0x34c, 13, periph)
/* pb12_tcc0wo1_out */
#define PB12_TCC0WO1_OUT       MCHP_PINMUX(b, 12, 0x350, 17, periph)
/* pb12_tcc0wo3_out */
#define PB12_TCC0WO3_OUT       MCHP_PINMUX(b, 12, 0x350, 19, periph)
/* pb12_tcc0wo4_out */
#define PB12_TCC0WO4_OUT       MCHP_PINMUX(b, 12, 0x34c, 14, periph)
/* pb12_tcc0wo5_out */
#define PB12_TCC0WO5_OUT       MCHP_PINMUX(b, 12, 0x350, 18, periph)
/* pb12_tcc1wo0_out */
#define PB12_TCC1WO0_OUT       MCHP_PINMUX(b, 12, 0x34c, 15, periph)
/* pb12_tcc1wo1_out */
#define PB12_TCC1WO1_OUT       MCHP_PINMUX(b, 12, 0x350, 20, periph)
/* pb12_tcc1wo3_out */
#define PB12_TCC1WO3_OUT       MCHP_PINMUX(b, 12, 0x350, 22, periph)
/* pb12_tcc1wo4_out */
#define PB12_TCC1WO4_OUT       MCHP_PINMUX(b, 12, 0x34c, 16, periph)
/* pb12_tcc1wo5_out */
#define PB12_TCC1WO5_OUT       MCHP_PINMUX(b, 12, 0x350, 21, periph)
/* pb12_tcc2wo0_out */
#define PB12_TCC2WO0_OUT       MCHP_PINMUX(b, 12, 0x34c, 17, periph)
/* pb12_tcc2wo1_out */
#define PB12_TCC2WO1_OUT       MCHP_PINMUX(b, 12, 0x350, 23, periph)
/* pb12_tstbus0_out */
#define PB12_TSTBUS0_OUT       MCHP_PINMUX(b, 12, 0x34c, 32, periph)
/* pb12_tstbus4_out */
#define PB12_TSTBUS4_OUT       MCHP_PINMUX(b, 12, 0x34c, 33, periph)
/* pb12_tstbus5_out */
#define PB12_TSTBUS5_OUT       MCHP_PINMUX(b, 12, 0x350, 38, periph)
/* pb12_tstbus8_out */
#define PB12_TSTBUS8_OUT       MCHP_PINMUX(b, 12, 0x34c, 34, periph)
/* pb12_tstbus9_out */
#define PB12_TSTBUS9_OUT       MCHP_PINMUX(b, 12, 0x350, 39, periph)
/* pb13_ac_cmp0_out */
#define PB13_AC_CMP0_OUT       MCHP_PINMUX(b, 13, 0x358, 40, periph)
/* pb13_ac_cmptrdy_out */
#define PB13_AC_CMPTRDY_OUT    MCHP_PINMUX(b, 13, 0x358, 41, periph)
/* pb13_can1rx_in */
#define PB13_CAN1RX_IN         MCHP_PINMUX(b, 13, 0x190, 6, periph)
/* pb13_cclin1_in */
#define PB13_CCLIN1_IN         MCHP_PINMUX(b, 13, 0xb8, 20, periph)
/* pb13_cclin2_in */
#define PB13_CCLIN2_IN         MCHP_PINMUX(b, 13, 0xbc, 6, periph)
/* pb13_cclin4_in */
#define PB13_CCLIN4_IN         MCHP_PINMUX(b, 13, 0xc4, 20, periph)
/* pb13_cclin5_in */
#define PB13_CCLIN5_IN         MCHP_PINMUX(b, 13, 0xc8, 6, periph)
/* pb13_cclo0_out */
#define PB13_CCLO0_OUT         MCHP_PINMUX(b, 13, 0x358, 1, periph)
/* pb13_cclo1_out */
#define PB13_CCLO1_OUT         MCHP_PINMUX(b, 13, 0x354, 1, periph)
/* pb13_coex_rf_act_out */
#define PB13_COEX_RF_ACT_OUT   MCHP_PINMUX(b, 13, 0x354, 41, periph)
/* pb13_extint1_in */
#define PB13_EXTINT1_IN        MCHP_PINMUX(b, 13, 0x4, 20, periph)
/* pb13_extint2_in */
#define PB13_EXTINT2_IN        MCHP_PINMUX(b, 13, 0x8, 6, periph)
/* pb13_fectrl0_out */
#define PB13_FECTRL0_OUT       MCHP_PINMUX(b, 13, 0x354, 40, periph)
/* pb13_fectrl4_out */
#define PB13_FECTRL4_OUT       MCHP_PINMUX(b, 13, 0x358, 42, periph)
/* pb13_qd0_out */
#define PB13_QD0_OUT           MCHP_PINMUX(b, 13, 0x354, 35, periph)
/* pb13_qd1_out */
#define PB13_QD1_OUT           MCHP_PINMUX(b, 13, 0x358, 35, periph)
/* pb13_qd2_in */
#define PB13_QD2_IN            MCHP_PINMUX(b, 13, 0xa8, 20, periph)
/* pb13_qd2_out */
#define PB13_QD2_OUT           MCHP_PINMUX(b, 13, 0x354, 37, periph)
/* pb13_qd3_in */
#define PB13_QD3_IN            MCHP_PINMUX(b, 13, 0xac, 6, periph)
/* pb13_qd3_out */
#define PB13_QD3_OUT           MCHP_PINMUX(b, 13, 0x354, 36, periph)
/* pb13_qeihome0g2_in */
#define PB13_QEIHOME0G2_IN     MCHP_PINMUX(b, 13, 0x170, 20, periph)
/* pb13_qeiindx0g2_in */
#define PB13_QEIINDX0G2_IN     MCHP_PINMUX(b, 13, 0x174, 20, periph)
/* pb13_qeiindx0g3_in */
#define PB13_QEIINDX0G3_IN     MCHP_PINMUX(b, 13, 0x178, 6, periph)
/* pb13_qeiqea0g3_in */
#define PB13_QEIQEA0G3_IN      MCHP_PINMUX(b, 13, 0x17c, 6, periph)
/* pb13_qspics_out */
#define PB13_QSPICS_OUT        MCHP_PINMUX(b, 13, 0x354, 34, periph)
/* pb13_scom0p0_in */
#define PB13_SCOM0P0_IN        MCHP_PINMUX(b, 13, 0x40, 20, periph)
/* pb13_scom0p0_out */
#define PB13_SCOM0P0_OUT       MCHP_PINMUX(b, 13, 0x354, 2, periph)
/* pb13_scom0p2_out */
#define PB13_SCOM0P2_OUT       MCHP_PINMUX(b, 13, 0x354, 4, periph)
/* pb13_scom0p3_out */
#define PB13_SCOM0P3_OUT       MCHP_PINMUX(b, 13, 0x354, 3, periph)
/* pb13_scom1p0_in */
#define PB13_SCOM1P0_IN        MCHP_PINMUX(b, 13, 0x50, 6, periph)
/* pb13_scom1p0_out */
#define PB13_SCOM1P0_OUT       MCHP_PINMUX(b, 13, 0x358, 5, periph)
/* pb13_scom1p2_out */
#define PB13_SCOM1P2_OUT       MCHP_PINMUX(b, 13, 0x354, 6, periph)
/* pb13_scom1p3_in */
#define PB13_SCOM1P3_IN        MCHP_PINMUX(b, 13, 0x5c, 20, periph)
/* pb13_scom1p3_out */
#define PB13_SCOM1P3_OUT       MCHP_PINMUX(b, 13, 0x354, 5, periph)
/* pb13_scom2p0_in */
#define PB13_SCOM2P0_IN        MCHP_PINMUX(b, 13, 0x60, 20, periph)
/* pb13_scom2p0_out */
#define PB13_SCOM2P0_OUT       MCHP_PINMUX(b, 13, 0x354, 7, periph)
