zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cx_bz/bz62/pic32cx2051bz62064-pinctrl.h
/* pc1_tc9wo0g2_in */
#define PC1_TC9WO0G2_IN        MCHP_PINMUX(c, 1, 0x15c, 6, periph)
/* pc1_tc9wo0_out */
#define PC1_TC9WO0_OUT         MCHP_PINMUX(c, 1, 0x36c, 33, periph)
/* pc1_tc9wo1g3_in */
#define PC1_TC9WO1G3_IN        MCHP_PINMUX(c, 1, 0x164, 12, periph)
/* pc1_tc9wo1_out */
#define PC1_TC9WO1_OUT         MCHP_PINMUX(c, 1, 0x370, 33, periph)
/* pc1_tcc0wo0_out */
#define PC1_TCC0WO0_OUT        MCHP_PINMUX(c, 1, 0x370, 18, periph)
/* pc1_tcc0wo1_out */
#define PC1_TCC0WO1_OUT        MCHP_PINMUX(c, 1, 0x36c, 17, periph)
/* pc1_tcc0wo2_out */
#define PC1_TCC0WO2_OUT        MCHP_PINMUX(c, 1, 0x370, 17, periph)
/* pc1_tcc0wo3_out */
#define PC1_TCC0WO3_OUT        MCHP_PINMUX(c, 1, 0x36c, 19, periph)
/* pc1_tcc0wo4_out */
#define PC1_TCC0WO4_OUT        MCHP_PINMUX(c, 1, 0x370, 19, periph)
/* pc1_tcc0wo5_out */
#define PC1_TCC0WO5_OUT        MCHP_PINMUX(c, 1, 0x36c, 18, periph)
/* pc1_tcc1wo0_out */
#define PC1_TCC1WO0_OUT        MCHP_PINMUX(c, 1, 0x370, 21, periph)
/* pc1_tcc1wo1_out */
#define PC1_TCC1WO1_OUT        MCHP_PINMUX(c, 1, 0x36c, 20, periph)
/* pc1_tcc1wo2_out */
#define PC1_TCC1WO2_OUT        MCHP_PINMUX(c, 1, 0x370, 20, periph)
/* pc1_tcc1wo3_out */
#define PC1_TCC1WO3_OUT        MCHP_PINMUX(c, 1, 0x36c, 22, periph)
/* pc1_tcc1wo4_out */
#define PC1_TCC1WO4_OUT        MCHP_PINMUX(c, 1, 0x370, 22, periph)
/* pc1_tcc1wo5_out */
#define PC1_TCC1WO5_OUT        MCHP_PINMUX(c, 1, 0x36c, 21, periph)
/* pc1_tcc2wo0_out */
#define PC1_TCC2WO0_OUT        MCHP_PINMUX(c, 1, 0x370, 23, periph)
/* pc1_tcc2wo1_out */
#define PC1_TCC2WO1_OUT        MCHP_PINMUX(c, 1, 0x36c, 23, periph)
/* pc1_tstbus1_out */
#define PC1_TSTBUS1_OUT        MCHP_PINMUX(c, 1, 0x370, 38, periph)
/* pc1_tstbus5_out */
#define PC1_TSTBUS5_OUT        MCHP_PINMUX(c, 1, 0x36c, 38, periph)
/* pc1_tstbus9_out */
#define PC1_TSTBUS9_OUT        MCHP_PINMUX(c, 1, 0x36c, 39, periph)
/* pc1_tstbus10_out */
#define PC1_TSTBUS10_OUT       MCHP_PINMUX(c, 1, 0x370, 39, periph)
/* pc8_ac_cmp0_out */
#define PC8_AC_CMP0_OUT        MCHP_PINMUX(c, 8, 0x390, 40, periph)
/* pc8_ac_cmptrdy_out */
#define PC8_AC_CMPTRDY_OUT     MCHP_PINMUX(c, 8, 0x390, 41, periph)
/* pc8_can1rx_in */
#define PC8_CAN1RX_IN          MCHP_PINMUX(c, 8, 0x190, 7, periph)
/* pc8_cclin2_in */
#define PC8_CCLIN2_IN          MCHP_PINMUX(c, 8, 0xbc, 7, periph)
/* pc8_cclin5_in */
#define PC8_CCLIN5_IN          MCHP_PINMUX(c, 8, 0xc8, 7, periph)
/* pc8_cclo0_out */
#define PC8_CCLO0_OUT          MCHP_PINMUX(c, 8, 0x390, 1, periph)
/* pc8_extint2_in */
#define PC8_EXTINT2_IN         MCHP_PINMUX(c, 8, 0x8, 7, periph)
/* pc8_fectrl4_out */
#define PC8_FECTRL4_OUT        MCHP_PINMUX(c, 8, 0x390, 42, periph)
/* pc8_gmac_tsucomp_out */
#define PC8_GMAC_TSUCOMP_OUT   MCHP_PINMUX(c, 8, 0x394, 14, periph)
/* pc8_qd0_out */
#define PC8_QD0_OUT            MCHP_PINMUX(c, 8, 0x390, 36, periph)
/* pc8_qd1_out */
#define PC8_QD1_OUT            MCHP_PINMUX(c, 8, 0x390, 35, periph)
/* pc8_qd3_in */
#define PC8_QD3_IN             MCHP_PINMUX(c, 8, 0xac, 7, periph)
/* pc8_qd3_out */
#define PC8_QD3_OUT            MCHP_PINMUX(c, 8, 0x390, 37, periph)
/* pc8_qeiccmp0_out */
#define PC8_QEICCMP0_OUT       MCHP_PINMUX(c, 8, 0x394, 13, periph)
/* pc8_qeiindx0g3_in */
#define PC8_QEIINDX0G3_IN      MCHP_PINMUX(c, 8, 0x178, 7, periph)
/* pc8_qeiqea0g3_in */
#define PC8_QEIQEA0G3_IN       MCHP_PINMUX(c, 8, 0x17c, 7, periph)
/* pc8_qeiqeb0g5_in */
#define PC8_QEIQEB0G5_IN       MCHP_PINMUX(c, 8, 0x188, 9, periph)
/* pc8_qspics_out */
#define PC8_QSPICS_OUT         MCHP_PINMUX(c, 8, 0x390, 34, periph)
/* pc8_scom0p0_out */
#define PC8_SCOM0P0_OUT        MCHP_PINMUX(c, 8, 0x390, 2, periph)
/* pc8_scom0p3_out */
#define PC8_SCOM0P3_OUT        MCHP_PINMUX(c, 8, 0x390, 3, periph)
/* pc8_scom1p0_in */
#define PC8_SCOM1P0_IN         MCHP_PINMUX(c, 8, 0x50, 7, periph)
/* pc8_scom1p0_out */
#define PC8_SCOM1P0_OUT        MCHP_PINMUX(c, 8, 0x390, 5, periph)
/* pc8_scom1p2_out */
#define PC8_SCOM1P2_OUT        MCHP_PINMUX(c, 8, 0x390, 4, periph)
/* pc8_scom1p3_out */
#define PC8_SCOM1P3_OUT        MCHP_PINMUX(c, 8, 0x390, 6, periph)
/* pc8_scom2p0_out */
#define PC8_SCOM2P0_OUT        MCHP_PINMUX(c, 8, 0x390, 7, periph)
/* pc8_scom2p3_out */
#define PC8_SCOM2P3_OUT        MCHP_PINMUX(c, 8, 0x390, 8, periph)
/* pc8_scom3p0_in */
#define PC8_SCOM3P0_IN         MCHP_PINMUX(c, 8, 0x70, 7, periph)
/* pc8_scom3p0_out */
#define PC8_SCOM3P0_OUT        MCHP_PINMUX(c, 8, 0x390, 10, periph)
/* pc8_scom3p2_out */
#define PC8_SCOM3P2_OUT        MCHP_PINMUX(c, 8, 0x390, 9, periph)
/* pc8_scom3p3_out */
#define PC8_SCOM3P3_OUT        MCHP_PINMUX(c, 8, 0x390, 11, periph)
/* pc8_scom4p0_out */
#define PC8_SCOM4P0_OUT        MCHP_PINMUX(c, 8, 0x390, 12, periph)
/* pc8_scom4p3_out */
#define PC8_SCOM4P3_OUT        MCHP_PINMUX(c, 8, 0x390, 13, periph)
/* pc8_scom5p0_in */
#define PC8_SCOM5P0_IN         MCHP_PINMUX(c, 8, 0x90, 7, periph)
/* pc8_scom5p0_out */
#define PC8_SCOM5P0_OUT        MCHP_PINMUX(c, 8, 0x390, 15, periph)
/* pc8_scom5p2_out */
#define PC8_SCOM5P2_OUT        MCHP_PINMUX(c, 8, 0x390, 14, periph)
/* pc8_scom5p3_out */
#define PC8_SCOM5P3_OUT        MCHP_PINMUX(c, 8, 0x390, 16, periph)
/* pc8_tc0wo0_out */
#define PC8_TC0WO0_OUT         MCHP_PINMUX(c, 8, 0x390, 24, periph)
/* pc8_tc0wo1g3_in */
#define PC8_TC0WO1G3_IN        MCHP_PINMUX(c, 8, 0xd4, 7, periph)
/* pc8_tc1wo0_out */
#define PC8_TC1WO0_OUT         MCHP_PINMUX(c, 8, 0x390, 25, periph)
/* pc8_tc2wo0g3_in */
#define PC8_TC2WO0G3_IN        MCHP_PINMUX(c, 8, 0xf0, 7, periph)
/* pc8_tc2wo0_out */
#define PC8_TC2WO0_OUT         MCHP_PINMUX(c, 8, 0x390, 26, periph)
/* pc8_tc3wo0g3_in */
#define PC8_TC3WO0G3_IN        MCHP_PINMUX(c, 8, 0x100, 7, periph)
/* pc8_tc3wo0_out */
#define PC8_TC3WO0_OUT         MCHP_PINMUX(c, 8, 0x390, 27, periph)
/* pc8_tc4wo0g3_in */
#define PC8_TC4WO0G3_IN        MCHP_PINMUX(c, 8, 0x110, 7, periph)
/* pc8_tc4wo0_out */
#define PC8_TC4WO0_OUT         MCHP_PINMUX(c, 8, 0x390, 28, periph)
/* pc8_tc5wo0g3_in */
#define PC8_TC5WO0G3_IN        MCHP_PINMUX(c, 8, 0x120, 7, periph)
/* pc8_tc5wo0_out */
#define PC8_TC5WO0_OUT         MCHP_PINMUX(c, 8, 0x390, 29, periph)
/* pc8_tc6wo0g3_in */
#define PC8_TC6WO0G3_IN        MCHP_PINMUX(c, 8, 0x130, 7, periph)
/* pc8_tc6wo0_out */
#define PC8_TC6WO0_OUT         MCHP_PINMUX(c, 8, 0x390, 30, periph)
/* pc8_tc7wo0g3_in */
#define PC8_TC7WO0G3_IN        MCHP_PINMUX(c, 8, 0x140, 7, periph)
/* pc8_tc7wo0_out */
#define PC8_TC7WO0_OUT         MCHP_PINMUX(c, 8, 0x390, 31, periph)
/* pc8_tc8wo0g3_in */
#define PC8_TC8WO0G3_IN        MCHP_PINMUX(c, 8, 0x150, 7, periph)
/* pc8_tc8wo0_out */
#define PC8_TC8WO0_OUT         MCHP_PINMUX(c, 8, 0x390, 32, periph)
/* pc8_tc8wo1g5_in */
#define PC8_TC8WO1G5_IN        MCHP_PINMUX(c, 8, 0x158, 9, periph)
/* pc8_tc8wo1_out */
#define PC8_TC8WO1_OUT         MCHP_PINMUX(c, 8, 0x394, 10, periph)
/* pc8_tc9wo1g3_in */
#define PC8_TC9WO1G3_IN        MCHP_PINMUX(c, 8, 0x164, 7, periph)
/* pc8_tc9wo1g5_in */
#define PC8_TC9WO1G5_IN        MCHP_PINMUX(c, 8, 0x168, 9, periph)
/* pc8_tc9wo1_out */
#define PC8_TC9WO1_OUT         MCHP_PINMUX(c, 8, 0x390, 33, periph)
/* pc8_tcc0wo0_out */
#define PC8_TCC0WO0_OUT        MCHP_PINMUX(c, 8, 0x390, 18, periph)
/* pc8_tcc0wo1_out */
#define PC8_TCC0WO1_OUT        MCHP_PINMUX(c, 8, 0x394, 6, periph)
/* pc8_tcc0wo2_out */
#define PC8_TCC0WO2_OUT        MCHP_PINMUX(c, 8, 0x390, 17, periph)
/* pc8_tcc0wo4_out */
#define PC8_TCC0WO4_OUT        MCHP_PINMUX(c, 8, 0x390, 19, periph)
/* pc8_tcc1wo0_out */
#define PC8_TCC1WO0_OUT        MCHP_PINMUX(c, 8, 0x390, 21, periph)
/* pc8_tcc1wo1_out */
#define PC8_TCC1WO1_OUT        MCHP_PINMUX(c, 8, 0x394, 9, periph)
/* pc8_tcc1wo2_out */
#define PC8_TCC1WO2_OUT        MCHP_PINMUX(c, 8, 0x390, 20, periph)
/* pc8_tcc1wo4_out */
#define PC8_TCC1WO4_OUT        MCHP_PINMUX(c, 8, 0x390, 22, periph)
/* pc8_tcc2wo0_out */
#define PC8_TCC2WO0_OUT        MCHP_PINMUX(c, 8, 0x390, 23, periph)
/* pc8_tstbus1_out */
#define PC8_TSTBUS1_OUT        MCHP_PINMUX(c, 8, 0x390, 38, periph)
/* pc8_tstbus3_out */
#define PC8_TSTBUS3_OUT        MCHP_PINMUX(c, 8, 0x394, 15, periph)
/* pc8_tstbus7_out */
#define PC8_TSTBUS7_OUT        MCHP_PINMUX(c, 8, 0x394, 16, periph)
/* pc8_tstbus10_out */
#define PC8_TSTBUS10_OUT       MCHP_PINMUX(c, 8, 0x390, 39, periph)
/* pc8_tstbus11_out */
#define PC8_TSTBUS11_OUT       MCHP_PINMUX(c, 8, 0x394, 17, periph)
/* pc9_accmpten_in */
#define PC9_ACCMPTEN_IN        MCHP_PINMUX(c, 9, 0x18c, 12, periph)
/* pc9_ac_cmp1_out */
#define PC9_AC_CMP1_OUT        MCHP_PINMUX(c, 9, 0x39c, 36, periph)
/* pc9_ac_cmptout_out */
#define PC9_AC_CMPTOUT_OUT     MCHP_PINMUX(c, 9, 0x39c, 37, periph)
/* pc9_can1_tx_out */
#define PC9_CAN1_TX_OUT        MCHP_PINMUX(c, 9, 0x39c, 38, periph)
/* pc9_cclin0_in */
#define PC9_CCLIN0_IN          MCHP_PINMUX(c, 9, 0xb4, 12, periph)
/* pc9_cclin3_in */
#define PC9_CCLIN3_IN          MCHP_PINMUX(c, 9, 0xc0, 12, periph)
/* pc9_cclo1_out */
#define PC9_CCLO1_OUT          MCHP_PINMUX(c, 9, 0x39c, 1, periph)
/* pc9_coexwlanact_in */
#define PC9_COEXWLANACT_IN     MCHP_PINMUX(c, 9, 0x194, 5, periph)
/* pc9_coex_bt_state_out */
#define PC9_COEX_BT_STATE_OUT  MCHP_PINMUX(c, 9, 0x398, 37, periph)
/* pc9_extint0_in */
#define PC9_EXTINT0_IN         MCHP_PINMUX(c, 9, 0x0, 12, periph)
/* pc9_extint3_in */
#define PC9_EXTINT3_IN         MCHP_PINMUX(c, 9, 0xc, 5, periph)
/* pc9_fectrl1_out */
#define PC9_FECTRL1_OUT        MCHP_PINMUX(c, 9, 0x398, 35, periph)
/* pc9_fectrl2_out */
#define PC9_FECTRL2_OUT        MCHP_PINMUX(c, 9, 0x398, 36, periph)
/* pc9_fectrl3_out */
#define PC9_FECTRL3_OUT        MCHP_PINMUX(c, 9, 0x39c, 39, periph)
/* pc9_fectrl5_out */
#define PC9_FECTRL5_OUT        MCHP_PINMUX(c, 9, 0x39c, 40, periph)
/* pc9_nmi_in */
#define PC9_NMI_IN             MCHP_PINMUX(c, 9, 0x3c, 5, periph)
/* pc9_qd0_in */
#define PC9_QD0_IN             MCHP_PINMUX(c, 9, 0xa0, 5, periph)
/* pc9_qd0_out */
#define PC9_QD0_OUT            MCHP_PINMUX(c, 9, 0x39c, 33, periph)
/* pc9_qd1_in */
#define PC9_QD1_IN             MCHP_PINMUX(c, 9, 0xa4, 12, periph)
/* pc9_qd1_out */
#define PC9_QD1_OUT            MCHP_PINMUX(c, 9, 0x398, 30, periph)
/* pc9_qd2_out */
#define PC9_QD2_OUT            MCHP_PINMUX(c, 9, 0x398, 29, periph)
/* pc9_qd3_out */
#define PC9_QD3_OUT            MCHP_PINMUX(c, 9, 0x398, 28, periph)
/* pc9_qeiccmp0_out */
#define PC9_QEICCMP0_OUT       MCHP_PINMUX(c, 9, 0x398, 31, periph)
/* pc9_qeihome0g1_in */
#define PC9_QEIHOME0G1_IN      MCHP_PINMUX(c, 9, 0x16c, 12, periph)
/* pc9_qeiqea0g4_in */
#define PC9_QEIQEA0G4_IN       MCHP_PINMUX(c, 9, 0x180, 5, periph)
/* pc9_qeiqeb0g4_in */
#define PC9_QEIQEB0G4_IN       MCHP_PINMUX(c, 9, 0x184, 5, periph)
/* pc9_qspics_out */
#define PC9_QSPICS_OUT         MCHP_PINMUX(c, 9, 0x398, 27, periph)
/* pc9_scom0p0_out */
#define PC9_SCOM0P0_OUT        MCHP_PINMUX(c, 9, 0x39c, 3, periph)
/* pc9_scom0p2_in */
#define PC9_SCOM0P2_IN         MCHP_PINMUX(c, 9, 0x48, 5, periph)
/* pc9_scom0p2_out */
#define PC9_SCOM0P2_OUT        MCHP_PINMUX(c, 9, 0x398, 2, periph)
/* pc9_scom0p3_in */
#define PC9_SCOM0P3_IN         MCHP_PINMUX(c, 9, 0x4c, 12, periph)
/* pc9_scom0p3_out */
#define PC9_SCOM0P3_OUT        MCHP_PINMUX(c, 9, 0x398, 1, periph)
/* pc9_scom1p0_out */
#define PC9_SCOM1P0_OUT        MCHP_PINMUX(c, 9, 0x398, 3, periph)
/* pc9_scom1p2_in */
#define PC9_SCOM1P2_IN         MCHP_PINMUX(c, 9, 0x58, 12, periph)
/* pc9_scom1p2_out */
#define PC9_SCOM1P2_OUT        MCHP_PINMUX(c, 9, 0x398, 4, periph)
/* pc9_scom1p3_out */
#define PC9_SCOM1P3_OUT        MCHP_PINMUX(c, 9, 0x39c, 4, periph)
/* pc9_scom2p0_out */
#define PC9_SCOM2P0_OUT        MCHP_PINMUX(c, 9, 0x39c, 7, periph)
/* pc9_scom2p2_in */
#define PC9_SCOM2P2_IN         MCHP_PINMUX(c, 9, 0x68, 5, periph)
/* pc9_scom2p2_out */
#define PC9_SCOM2P2_OUT        MCHP_PINMUX(c, 9, 0x398, 6, periph)
/* pc9_scom2p3_in */
#define PC9_SCOM2P3_IN         MCHP_PINMUX(c, 9, 0x6c, 12, periph)
/* pc9_scom2p3_out */
#define PC9_SCOM2P3_OUT        MCHP_PINMUX(c, 9, 0x398, 5, periph)
/* pc9_scom3p0_out */
#define PC9_SCOM3P0_OUT        MCHP_PINMUX(c, 9, 0x398, 7, periph)
/* pc9_scom3p2_in */
#define PC9_SCOM3P2_IN         MCHP_PINMUX(c, 9, 0x78, 12, periph)
/* pc9_scom3p2_out */
#define PC9_SCOM3P2_OUT        MCHP_PINMUX(c, 9, 0x398, 8, periph)
/* pc9_scom3p3_out */
#define PC9_SCOM3P3_OUT        MCHP_PINMUX(c, 9, 0x39c, 8, periph)
/* pc9_scom4p0_out */
#define PC9_SCOM4P0_OUT        MCHP_PINMUX(c, 9, 0x39c, 11, periph)
/* pc9_scom4p2_in */
#define PC9_SCOM4P2_IN         MCHP_PINMUX(c, 9, 0x88, 5, periph)
/* pc9_scom4p2_out */
#define PC9_SCOM4P2_OUT        MCHP_PINMUX(c, 9, 0x398, 10, periph)
/* pc9_scom4p3_in */
#define PC9_SCOM4P3_IN         MCHP_PINMUX(c, 9, 0x8c, 12, periph)
/* pc9_scom4p3_out */
#define PC9_SCOM4P3_OUT        MCHP_PINMUX(c, 9, 0x398, 9, periph)
/* pc9_scom5p0_out */
#define PC9_SCOM5P0_OUT        MCHP_PINMUX(c, 9, 0x398, 11, periph)
/* pc9_scom5p2_in */
#define PC9_SCOM5P2_IN         MCHP_PINMUX(c, 9, 0x98, 12, periph)
/* pc9_scom5p2_out */
#define PC9_SCOM5P2_OUT        MCHP_PINMUX(c, 9, 0x398, 12, periph)
/* pc9_scom5p3_out */
#define PC9_SCOM5P3_OUT        MCHP_PINMUX(c, 9, 0x39c, 12, periph)
/* pc9_tc0wo0g1_in */
#define PC9_TC0WO0G1_IN        MCHP_PINMUX(c, 9, 0xcc, 12, periph)
/* pc9_tc0wo0_out */
#define PC9_TC0WO0_OUT         MCHP_PINMUX(c, 9, 0x39c, 21, periph)
/* pc9_tc0wo1g4_in */
#define PC9_TC0WO1G4_IN        MCHP_PINMUX(c, 9, 0xd8, 5, periph)
/* pc9_tc0wo1_out */
#define PC9_TC0WO1_OUT         MCHP_PINMUX(c, 9, 0x398, 18, periph)
/* pc9_tc1wo0g1_in */
#define PC9_TC1WO0G1_IN        MCHP_PINMUX(c, 9, 0xdc, 12, periph)
/* pc9_tc1wo0_out */
#define PC9_TC1WO0_OUT         MCHP_PINMUX(c, 9, 0x398, 19, periph)
/* pc9_tc1wo1_out */
#define PC9_TC1WO1_OUT         MCHP_PINMUX(c, 9, 0x39c, 22, periph)
/* pc9_tc2wo0g1_in */
#define PC9_TC2WO0G1_IN        MCHP_PINMUX(c, 9, 0xec, 12, periph)
/* pc9_tc2wo0_out */
#define PC9_TC2WO0_OUT         MCHP_PINMUX(c, 9, 0x398, 20, periph)
/* pc9_tc2wo1g4_in */
#define PC9_TC2WO1G4_IN        MCHP_PINMUX(c, 9, 0xf8, 5, periph)
/* pc9_tc2wo1_out */
#define PC9_TC2WO1_OUT         MCHP_PINMUX(c, 9, 0x39c, 23, periph)
/* pc9_tc3wo0g1_in */
#define PC9_TC3WO0G1_IN        MCHP_PINMUX(c, 9, 0xfc, 12, periph)
/* pc9_tc3wo0_out */
#define PC9_TC3WO0_OUT         MCHP_PINMUX(c, 9, 0x398, 21, periph)
/* pc9_tc3wo1g4_in */
#define PC9_TC3WO1G4_IN        MCHP_PINMUX(c, 9, 0x108, 5, periph)
/* pc9_tc3wo1_out */
#define PC9_TC3WO1_OUT         MCHP_PINMUX(c, 9, 0x39c, 24, periph)
/* pc9_tc4wo0g1_in */
#define PC9_TC4WO0G1_IN        MCHP_PINMUX(c, 9, 0x10c, 12, periph)
/* pc9_tc4wo0_out */
#define PC9_TC4WO0_OUT         MCHP_PINMUX(c, 9, 0x398, 22, periph)
/* pc9_tc4wo1g4_in */
#define PC9_TC4WO1G4_IN        MCHP_PINMUX(c, 9, 0x118, 5, periph)
/* pc9_tc4wo1_out */
#define PC9_TC4WO1_OUT         MCHP_PINMUX(c, 9, 0x39c, 25, periph)
/* pc9_tc5wo0g1_in */
#define PC9_TC5WO0G1_IN        MCHP_PINMUX(c, 9, 0x11c, 12, periph)
/* pc9_tc5wo0_out */
#define PC9_TC5WO0_OUT         MCHP_PINMUX(c, 9, 0x398, 23, periph)
/* pc9_tc5wo1g4_in */
#define PC9_TC5WO1G4_IN        MCHP_PINMUX(c, 9, 0x128, 5, periph)
/* pc9_tc5wo1_out */
#define PC9_TC5WO1_OUT         MCHP_PINMUX(c, 9, 0x39c, 26, periph)
/* pc9_tc6wo0g1_in */
#define PC9_TC6WO0G1_IN        MCHP_PINMUX(c, 9, 0x12c, 12, periph)
/* pc9_tc6wo0_out */
#define PC9_TC6WO0_OUT         MCHP_PINMUX(c, 9, 0x398, 24, periph)
/* pc9_tc6wo1g4_in */
#define PC9_TC6WO1G4_IN        MCHP_PINMUX(c, 9, 0x138, 5, periph)
/* pc9_tc6wo1_out */
#define PC9_TC6WO1_OUT         MCHP_PINMUX(c, 9, 0x39c, 27, periph)
/* pc9_tc7wo0g1_in */
#define PC9_TC7WO0G1_IN        MCHP_PINMUX(c, 9, 0x13c, 12, periph)
/* pc9_tc7wo0_out */
#define PC9_TC7WO0_OUT         MCHP_PINMUX(c, 9, 0x398, 25, periph)
/* pc9_tc7wo1g4_in */
#define PC9_TC7WO1G4_IN        MCHP_PINMUX(c, 9, 0x148, 5, periph)
/* pc9_tc7wo1_out */
#define PC9_TC7WO1_OUT         MCHP_PINMUX(c, 9, 0x39c, 28, periph)
/* pc9_tc8wo0g1_in */
#define PC9_TC8WO0G1_IN        MCHP_PINMUX(c, 9, 0x14c, 12, periph)
/* pc9_tc8wo0_out */
#define PC9_TC8WO0_OUT         MCHP_PINMUX(c, 9, 0x398, 26, periph)
/* pc9_tc9wo0g4_in */
#define PC9_TC9WO0G4_IN        MCHP_PINMUX(c, 9, 0x160, 5, periph)
/* pc9_tc9wo0_out */
#define PC9_TC9WO0_OUT         MCHP_PINMUX(c, 9, 0x39c, 29, periph)
/* pc9_tcc0wo0_out */
#define PC9_TCC0WO0_OUT        MCHP_PINMUX(c, 9, 0x398, 13, periph)
/* pc9_tcc0wo1_out */
#define PC9_TCC0WO1_OUT        MCHP_PINMUX(c, 9, 0x39c, 15, periph)
/* pc9_tcc0wo3_out */
#define PC9_TCC0WO3_OUT        MCHP_PINMUX(c, 9, 0x39c, 14, periph)
/* pc9_tcc0wo4_out */
#define PC9_TCC0WO4_OUT        MCHP_PINMUX(c, 9, 0x398, 14, periph)
/* pc9_tcc0wo5_out */
#define PC9_TCC0WO5_OUT        MCHP_PINMUX(c, 9, 0x39c, 16, periph)
/* pc9_tcc1wo0_out */
#define PC9_TCC1WO0_OUT        MCHP_PINMUX(c, 9, 0x398, 15, periph)
/* pc9_tcc1wo1_out */
#define PC9_TCC1WO1_OUT        MCHP_PINMUX(c, 9, 0x39c, 18, periph)
/* pc9_tcc1wo3_out */
#define PC9_TCC1WO3_OUT        MCHP_PINMUX(c, 9, 0x39c, 17, periph)
/* pc9_tcc1wo4_out */
#define PC9_TCC1WO4_OUT        MCHP_PINMUX(c, 9, 0x398, 16, periph)
/* pc9_tcc1wo5_out */
#define PC9_TCC1WO5_OUT        MCHP_PINMUX(c, 9, 0x39c, 19, periph)
/* pc9_tcc2wo0_out */
#define PC9_TCC2WO0_OUT        MCHP_PINMUX(c, 9, 0x398, 17, periph)
/* pc9_tcc2wo1_out */
#define PC9_TCC2WO1_OUT        MCHP_PINMUX(c, 9, 0x39c, 20, periph)
/* pc9_tstbus0_out */
#define PC9_TSTBUS0_OUT        MCHP_PINMUX(c, 9, 0x398, 32, periph)
/* pc9_tstbus2_out */
#define PC9_TSTBUS2_OUT        MCHP_PINMUX(c, 9, 0x39c, 34, periph)
/* pc9_tstbus4_out */
#define PC9_TSTBUS4_OUT        MCHP_PINMUX(c, 9, 0x398, 33, periph)
/* pc9_tstbus6_out */
#define PC9_TSTBUS6_OUT        MCHP_PINMUX(c, 9, 0x39c, 35, periph)
/* pc9_tstbus8_out */
#define PC9_TSTBUS8_OUT        MCHP_PINMUX(c, 9, 0x398, 34, periph)
/* pc11_cclo0_out */
#define PC11_CCLO0_OUT         MCHP_PINMUX(c, 11, 0x3a4, 1, periph)
/* pc11_gmac_tsucomp_out */
#define PC11_GMAC_TSUCOMP_OUT  MCHP_PINMUX(c, 11, 0x3a4, 14, periph)
/* pc11_qeiccmp0_out */
#define PC11_QEICCMP0_OUT      MCHP_PINMUX(c, 11, 0x3a4, 13, periph)
/* pc11_qeiqeb0g5_in */
#define PC11_QEIQEB0G5_IN      MCHP_PINMUX(c, 11, 0x188, 13, periph)
/* pc11_qspics_out */
#define PC11_QSPICS_OUT        MCHP_PINMUX(c, 11, 0x3a4, 12, periph)
/* pc11_scom1p3_out */
#define PC11_SCOM1P3_OUT       MCHP_PINMUX(c, 11, 0x3a4, 2, periph)
/* pc11_scom2p0_out */
#define PC11_SCOM2P0_OUT       MCHP_PINMUX(c, 11, 0x3a4, 3, periph)
/* pc11_tc8wo1g5_in */
#define PC11_TC8WO1G5_IN       MCHP_PINMUX(c, 11, 0x158, 13, periph)
/* pc11_tc8wo1_out */
#define PC11_TC8WO1_OUT        MCHP_PINMUX(c, 11, 0x3a4, 10, periph)
/* pc11_tc9wo1g5_in */
#define PC11_TC9WO1G5_IN       MCHP_PINMUX(c, 11, 0x168, 13, periph)
/* pc11_tc9wo1_out */
#define PC11_TC9WO1_OUT        MCHP_PINMUX(c, 11, 0x3a4, 11, periph)
/* pc11_tcc0wo1_out */
#define PC11_TCC0WO1_OUT       MCHP_PINMUX(c, 11, 0x3a4, 6, periph)
/* pc11_tcc0wo2_out */
#define PC11_TCC0WO2_OUT       MCHP_PINMUX(c, 11, 0x3a4, 5, periph)
/* pc11_tcc0wo4_out */
#define PC11_TCC0WO4_OUT       MCHP_PINMUX(c, 11, 0x3a4, 4, periph)
/* pc11_tcc1wo1_out */
#define PC11_TCC1WO1_OUT       MCHP_PINMUX(c, 11, 0x3a4, 9, periph)
/* pc11_tcc1wo2_out */
#define PC11_TCC1WO2_OUT       MCHP_PINMUX(c, 11, 0x3a4, 8, periph)
/* pc11_tcc1wo4_out */
#define PC11_TCC1WO4_OUT       MCHP_PINMUX(c, 11, 0x3a4, 7, periph)
/* pc11_tstbus3_out */
#define PC11_TSTBUS3_OUT       MCHP_PINMUX(c, 11, 0x3a4, 15, periph)
/* pc11_tstbus7_out */
#define PC11_TSTBUS7_OUT       MCHP_PINMUX(c, 11, 0x3a4, 16, periph)
/* pc11_tstbus11_out */
#define PC11_TSTBUS11_OUT      MCHP_PINMUX(c, 11, 0x3a4, 17, periph)
/* pd3_accmpten_in */
#define PD3_ACCMPTEN_IN        MCHP_PINMUX(d, 3, 0x18c, 13, periph)
/* pd3_ac_cmp1_out */
#define PD3_AC_CMP1_OUT        MCHP_PINMUX(d, 3, 0x3cc, 36, periph)
/* pd3_ac_cmptout_out */
#define PD3_AC_CMPTOUT_OUT     MCHP_PINMUX(d, 3, 0x3cc, 37, periph)
/* pd3_can1_tx_out */
#define PD3_CAN1_TX_OUT        MCHP_PINMUX(d, 3, 0x3cc, 38, periph)
/* pd3_cclin0_in */
#define PD3_CCLIN0_IN          MCHP_PINMUX(d, 3, 0xb4, 13, periph)
/* pd3_cclin3_in */
#define PD3_CCLIN3_IN          MCHP_PINMUX(d, 3, 0xc0, 13, periph)
/* pd3_cclo1_out */
#define PD3_CCLO1_OUT          MCHP_PINMUX(d, 3, 0x3cc, 1, periph)
/* pd3_coexwlanact_in */
#define PD3_COEXWLANACT_IN     MCHP_PINMUX(d, 3, 0x194, 6, periph)
/* pd3_coex_bt_state_out */
#define PD3_COEX_BT_STATE_OUT  MCHP_PINMUX(d, 3, 0x3c8, 37, periph)
/* pd3_extint0_in */
#define PD3_EXTINT0_IN         MCHP_PINMUX(d, 3, 0x0, 13, periph)
/* pd3_extint3_in */
#define PD3_EXTINT3_IN         MCHP_PINMUX(d, 3, 0xc, 6, periph)
/* pd3_fectrl1_out */
#define PD3_FECTRL1_OUT        MCHP_PINMUX(d, 3, 0x3c8, 35, periph)
/* pd3_fectrl2_out */
#define PD3_FECTRL2_OUT        MCHP_PINMUX(d, 3, 0x3c8, 36, periph)
/* pd3_fectrl3_out */
#define PD3_FECTRL3_OUT        MCHP_PINMUX(d, 3, 0x3cc, 39, periph)
/* pd3_fectrl5_out */
#define PD3_FECTRL5_OUT        MCHP_PINMUX(d, 3, 0x3cc, 40, periph)
/* pd3_nmi_in */
#define PD3_NMI_IN             MCHP_PINMUX(d, 3, 0x3c, 6, periph)
/* pd3_qd0_in */
#define PD3_QD0_IN             MCHP_PINMUX(d, 3, 0xa0, 6, periph)
/* pd3_qd0_out */
#define PD3_QD0_OUT            MCHP_PINMUX(d, 3, 0x3cc, 33, periph)
/* pd3_qd1_in */
#define PD3_QD1_IN             MCHP_PINMUX(d, 3, 0xa4, 13, periph)
/* pd3_qd1_out */
#define PD3_QD1_OUT            MCHP_PINMUX(d, 3, 0x3c8, 30, periph)
/* pd3_qd2_out */
#define PD3_QD2_OUT            MCHP_PINMUX(d, 3, 0x3c8, 29, periph)
/* pd3_qd3_out */
#define PD3_QD3_OUT            MCHP_PINMUX(d, 3, 0x3c8, 28, periph)
/* pd3_qeiccmp0_out */
#define PD3_QEICCMP0_OUT       MCHP_PINMUX(d, 3, 0x3c8, 31, periph)
/* pd3_qeihome0g1_in */
#define PD3_QEIHOME0G1_IN      MCHP_PINMUX(d, 3, 0x16c, 13, periph)
/* pd3_qeiqea0g4_in */
#define PD3_QEIQEA0G4_IN       MCHP_PINMUX(d, 3, 0x180, 6, periph)
/* pd3_qeiqeb0g4_in */
#define PD3_QEIQEB0G4_IN       MCHP_PINMUX(d, 3, 0x184, 6, periph)
/* pd3_qspics_out */
#define PD3_QSPICS_OUT         MCHP_PINMUX(d, 3, 0x3c8, 27, periph)
/* pd3_scom0p0_out */
#define PD3_SCOM0P0_OUT        MCHP_PINMUX(d, 3, 0x3cc, 3, periph)
/* pd3_scom0p2_in */
#define PD3_SCOM0P2_IN         MCHP_PINMUX(d, 3, 0x48, 6, periph)
/* pd3_scom0p2_out */
#define PD3_SCOM0P2_OUT        MCHP_PINMUX(d, 3, 0x3c8, 2, periph)
/* pd3_scom0p3_in */
#define PD3_SCOM0P3_IN         MCHP_PINMUX(d, 3, 0x4c, 13, periph)
/* pd3_scom0p3_out */
#define PD3_SCOM0P3_OUT        MCHP_PINMUX(d, 3, 0x3c8, 1, periph)
/* pd3_scom1p0_out */
#define PD3_SCOM1P0_OUT        MCHP_PINMUX(d, 3, 0x3c8, 3, periph)
/* pd3_scom1p2_in */
#define PD3_SCOM1P2_IN         MCHP_PINMUX(d, 3, 0x58, 13, periph)
/* pd3_scom1p2_out */
#define PD3_SCOM1P2_OUT        MCHP_PINMUX(d, 3, 0x3c8, 4, periph)
/* pd3_scom1p3_out */
#define PD3_SCOM1P3_OUT        MCHP_PINMUX(d, 3, 0x3cc, 4, periph)
/* pd3_scom2p0_out */
#define PD3_SCOM2P0_OUT        MCHP_PINMUX(d, 3, 0x3cc, 7, periph)
/* pd3_scom2p2_in */
#define PD3_SCOM2P2_IN         MCHP_PINMUX(d, 3, 0x68, 6, periph)
/* pd3_scom2p2_out */
#define PD3_SCOM2P2_OUT        MCHP_PINMUX(d, 3, 0x3c8, 6, periph)
/* pd3_scom2p3_in */
#define PD3_SCOM2P3_IN         MCHP_PINMUX(d, 3, 0x6c, 13, periph)
/* pd3_scom2p3_out */
#define PD3_SCOM2P3_OUT        MCHP_PINMUX(d, 3, 0x3c8, 5, periph)
/* pd3_scom3p0_out */
#define PD3_SCOM3P0_OUT        MCHP_PINMUX(d, 3, 0x3c8, 7, periph)
/* pd3_scom3p2_in */
#define PD3_SCOM3P2_IN         MCHP_PINMUX(d, 3, 0x78, 13, periph)
/* pd3_scom3p2_out */
#define PD3_SCOM3P2_OUT        MCHP_PINMUX(d, 3, 0x3c8, 8, periph)
/* pd3_scom3p3_out */
#define PD3_SCOM3P3_OUT        MCHP_PINMUX(d, 3, 0x3cc, 8, periph)
/* pd3_scom4p0_out */
#define PD3_SCOM4P0_OUT        MCHP_PINMUX(d, 3, 0x3cc, 11, periph)
/* pd3_scom4p2_in */
#define PD3_SCOM4P2_IN         MCHP_PINMUX(d, 3, 0x88, 6, periph)
/* pd3_scom4p2_out */
#define PD3_SCOM4P2_OUT        MCHP_PINMUX(d, 3, 0x3c8, 10, periph)
/* pd3_scom4p3_in */
#define PD3_SCOM4P3_IN         MCHP_PINMUX(d, 3, 0x8c, 13, periph)
