zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cx_bz/bz62/pic32cx2051bz62064-pinctrl.h
/* pd3_scom4p3_out */
#define PD3_SCOM4P3_OUT        MCHP_PINMUX(d, 3, 0x3c8, 9, periph)
/* pd3_scom5p0_out */
#define PD3_SCOM5P0_OUT        MCHP_PINMUX(d, 3, 0x3c8, 11, periph)
/* pd3_scom5p2_in */
#define PD3_SCOM5P2_IN         MCHP_PINMUX(d, 3, 0x98, 13, periph)
/* pd3_scom5p2_out */
#define PD3_SCOM5P2_OUT        MCHP_PINMUX(d, 3, 0x3c8, 12, periph)
/* pd3_scom5p3_out */
#define PD3_SCOM5P3_OUT        MCHP_PINMUX(d, 3, 0x3cc, 12, periph)
/* pd3_tc0wo0g1_in */
#define PD3_TC0WO0G1_IN        MCHP_PINMUX(d, 3, 0xcc, 13, periph)
/* pd3_tc0wo0_out */
#define PD3_TC0WO0_OUT         MCHP_PINMUX(d, 3, 0x3cc, 21, periph)
/* pd3_tc0wo1g4_in */
#define PD3_TC0WO1G4_IN        MCHP_PINMUX(d, 3, 0xd8, 6, periph)
/* pd3_tc0wo1_out */
#define PD3_TC0WO1_OUT         MCHP_PINMUX(d, 3, 0x3c8, 18, periph)
/* pd3_tc1wo0g1_in */
#define PD3_TC1WO0G1_IN        MCHP_PINMUX(d, 3, 0xdc, 13, periph)
/* pd3_tc1wo0_out */
#define PD3_TC1WO0_OUT         MCHP_PINMUX(d, 3, 0x3c8, 19, periph)
/* pd3_tc1wo1_out */
#define PD3_TC1WO1_OUT         MCHP_PINMUX(d, 3, 0x3cc, 22, periph)
/* pd3_tc2wo0g1_in */
#define PD3_TC2WO0G1_IN        MCHP_PINMUX(d, 3, 0xec, 13, periph)
/* pd3_tc2wo0_out */
#define PD3_TC2WO0_OUT         MCHP_PINMUX(d, 3, 0x3c8, 20, periph)
/* pd3_tc2wo1g4_in */
#define PD3_TC2WO1G4_IN        MCHP_PINMUX(d, 3, 0xf8, 6, periph)
/* pd3_tc2wo1_out */
#define PD3_TC2WO1_OUT         MCHP_PINMUX(d, 3, 0x3cc, 23, periph)
/* pd3_tc3wo0g1_in */
#define PD3_TC3WO0G1_IN        MCHP_PINMUX(d, 3, 0xfc, 13, periph)
/* pd3_tc3wo0_out */
#define PD3_TC3WO0_OUT         MCHP_PINMUX(d, 3, 0x3c8, 21, periph)
/* pd3_tc3wo1g4_in */
#define PD3_TC3WO1G4_IN        MCHP_PINMUX(d, 3, 0x108, 6, periph)
/* pd3_tc3wo1_out */
#define PD3_TC3WO1_OUT         MCHP_PINMUX(d, 3, 0x3cc, 24, periph)
/* pd3_tc4wo0g1_in */
#define PD3_TC4WO0G1_IN        MCHP_PINMUX(d, 3, 0x10c, 13, periph)
/* pd3_tc4wo0_out */
#define PD3_TC4WO0_OUT         MCHP_PINMUX(d, 3, 0x3c8, 22, periph)
/* pd3_tc4wo1g4_in */
#define PD3_TC4WO1G4_IN        MCHP_PINMUX(d, 3, 0x118, 6, periph)
/* pd3_tc4wo1_out */
#define PD3_TC4WO1_OUT         MCHP_PINMUX(d, 3, 0x3cc, 25, periph)
/* pd3_tc5wo0g1_in */
#define PD3_TC5WO0G1_IN        MCHP_PINMUX(d, 3, 0x11c, 13, periph)
/* pd3_tc5wo0_out */
#define PD3_TC5WO0_OUT         MCHP_PINMUX(d, 3, 0x3c8, 23, periph)
/* pd3_tc5wo1g4_in */
#define PD3_TC5WO1G4_IN        MCHP_PINMUX(d, 3, 0x128, 6, periph)
/* pd3_tc5wo1_out */
#define PD3_TC5WO1_OUT         MCHP_PINMUX(d, 3, 0x3cc, 26, periph)
/* pd3_tc6wo0g1_in */
#define PD3_TC6WO0G1_IN        MCHP_PINMUX(d, 3, 0x12c, 13, periph)
/* pd3_tc6wo0_out */
#define PD3_TC6WO0_OUT         MCHP_PINMUX(d, 3, 0x3c8, 24, periph)
/* pd3_tc6wo1g4_in */
#define PD3_TC6WO1G4_IN        MCHP_PINMUX(d, 3, 0x138, 6, periph)
/* pd3_tc6wo1_out */
#define PD3_TC6WO1_OUT         MCHP_PINMUX(d, 3, 0x3cc, 27, periph)
/* pd3_tc7wo0g1_in */
#define PD3_TC7WO0G1_IN        MCHP_PINMUX(d, 3, 0x13c, 13, periph)
/* pd3_tc7wo0_out */
#define PD3_TC7WO0_OUT         MCHP_PINMUX(d, 3, 0x3c8, 25, periph)
/* pd3_tc7wo1g4_in */
#define PD3_TC7WO1G4_IN        MCHP_PINMUX(d, 3, 0x148, 6, periph)
/* pd3_tc7wo1_out */
#define PD3_TC7WO1_OUT         MCHP_PINMUX(d, 3, 0x3cc, 28, periph)
/* pd3_tc8wo0g1_in */
#define PD3_TC8WO0G1_IN        MCHP_PINMUX(d, 3, 0x14c, 13, periph)
/* pd3_tc8wo0_out */
#define PD3_TC8WO0_OUT         MCHP_PINMUX(d, 3, 0x3c8, 26, periph)
/* pd3_tc9wo0g4_in */
#define PD3_TC9WO0G4_IN        MCHP_PINMUX(d, 3, 0x160, 6, periph)
/* pd3_tc9wo0_out */
#define PD3_TC9WO0_OUT         MCHP_PINMUX(d, 3, 0x3cc, 29, periph)
/* pd3_tcc0wo0_out */
#define PD3_TCC0WO0_OUT        MCHP_PINMUX(d, 3, 0x3c8, 13, periph)
/* pd3_tcc0wo1_out */
#define PD3_TCC0WO1_OUT        MCHP_PINMUX(d, 3, 0x3cc, 15, periph)
/* pd3_tcc0wo3_out */
#define PD3_TCC0WO3_OUT        MCHP_PINMUX(d, 3, 0x3cc, 14, periph)
/* pd3_tcc0wo4_out */
#define PD3_TCC0WO4_OUT        MCHP_PINMUX(d, 3, 0x3c8, 14, periph)
/* pd3_tcc0wo5_out */
#define PD3_TCC0WO5_OUT        MCHP_PINMUX(d, 3, 0x3cc, 16, periph)
/* pd3_tcc1wo0_out */
#define PD3_TCC1WO0_OUT        MCHP_PINMUX(d, 3, 0x3c8, 15, periph)
/* pd3_tcc1wo1_out */
#define PD3_TCC1WO1_OUT        MCHP_PINMUX(d, 3, 0x3cc, 18, periph)
/* pd3_tcc1wo3_out */
#define PD3_TCC1WO3_OUT        MCHP_PINMUX(d, 3, 0x3cc, 17, periph)
/* pd3_tcc1wo4_out */
#define PD3_TCC1WO4_OUT        MCHP_PINMUX(d, 3, 0x3c8, 16, periph)
/* pd3_tcc1wo5_out */
#define PD3_TCC1WO5_OUT        MCHP_PINMUX(d, 3, 0x3cc, 19, periph)
/* pd3_tcc2wo0_out */
#define PD3_TCC2WO0_OUT        MCHP_PINMUX(d, 3, 0x3c8, 17, periph)
/* pd3_tcc2wo1_out */
#define PD3_TCC2WO1_OUT        MCHP_PINMUX(d, 3, 0x3cc, 20, periph)
/* pd3_tstbus0_out */
#define PD3_TSTBUS0_OUT        MCHP_PINMUX(d, 3, 0x3c8, 32, periph)
/* pd3_tstbus2_out */
#define PD3_TSTBUS2_OUT        MCHP_PINMUX(d, 3, 0x3cc, 34, periph)
/* pd3_tstbus4_out */
#define PD3_TSTBUS4_OUT        MCHP_PINMUX(d, 3, 0x3c8, 33, periph)
/* pd3_tstbus6_out */
#define PD3_TSTBUS6_OUT        MCHP_PINMUX(d, 3, 0x3cc, 35, periph)
/* pd3_tstbus8_out */
#define PD3_TSTBUS8_OUT        MCHP_PINMUX(d, 3, 0x3c8, 34, periph)
/* pd4_cclin1_in */
#define PD4_CCLIN1_IN          MCHP_PINMUX(d, 4, 0xb8, 13, periph)
/* pd4_cclin4_in */
#define PD4_CCLIN4_IN          MCHP_PINMUX(d, 4, 0xc4, 13, periph)
/* pd4_cclo0_out */
#define PD4_CCLO0_OUT          MCHP_PINMUX(d, 4, 0x3d4, 1, periph)
/* pd4_cclo1_out */
#define PD4_CCLO1_OUT          MCHP_PINMUX(d, 4, 0x3d0, 1, periph)
/* pd4_coex_rf_act_out */
#define PD4_COEX_RF_ACT_OUT    MCHP_PINMUX(d, 4, 0x3d0, 41, periph)
/* pd4_extint1_in */
#define PD4_EXTINT1_IN         MCHP_PINMUX(d, 4, 0x4, 13, periph)
/* pd4_fectrl0_out */
#define PD4_FECTRL0_OUT        MCHP_PINMUX(d, 4, 0x3d0, 40, periph)
/* pd4_gmac_tsucomp_out */
#define PD4_GMAC_TSUCOMP_OUT   MCHP_PINMUX(d, 4, 0x3d4, 14, periph)
/* pd4_qd0_out */
#define PD4_QD0_OUT            MCHP_PINMUX(d, 4, 0x3d0, 35, periph)
/* pd4_qd2_in */
#define PD4_QD2_IN             MCHP_PINMUX(d, 4, 0xa8, 13, periph)
/* pd4_qd2_out */
#define PD4_QD2_OUT            MCHP_PINMUX(d, 4, 0x3d0, 37, periph)
/* pd4_qd3_out */
#define PD4_QD3_OUT            MCHP_PINMUX(d, 4, 0x3d0, 36, periph)
/* pd4_qeiccmp0_out */
#define PD4_QEICCMP0_OUT       MCHP_PINMUX(d, 4, 0x3d4, 13, periph)
/* pd4_qeihome0g2_in */
#define PD4_QEIHOME0G2_IN      MCHP_PINMUX(d, 4, 0x170, 13, periph)
/* pd4_qeiindx0g2_in */
#define PD4_QEIINDX0G2_IN      MCHP_PINMUX(d, 4, 0x174, 13, periph)
/* pd4_qeiqeb0g5_in */
#define PD4_QEIQEB0G5_IN       MCHP_PINMUX(d, 4, 0x188, 5, periph)
/* pd4_qspics_out */
#define PD4_QSPICS_OUT         MCHP_PINMUX(d, 4, 0x3d0, 34, periph)
/* pd4_scom0p0_in */
#define PD4_SCOM0P0_IN         MCHP_PINMUX(d, 4, 0x40, 13, periph)
/* pd4_scom0p0_out */
#define PD4_SCOM0P0_OUT        MCHP_PINMUX(d, 4, 0x3d0, 2, periph)
/* pd4_scom0p2_out */
#define PD4_SCOM0P2_OUT        MCHP_PINMUX(d, 4, 0x3d0, 4, periph)
/* pd4_scom0p3_out */
#define PD4_SCOM0P3_OUT        MCHP_PINMUX(d, 4, 0x3d0, 3, periph)
/* pd4_scom1p2_out */
#define PD4_SCOM1P2_OUT        MCHP_PINMUX(d, 4, 0x3d0, 6, periph)
/* pd4_scom1p3_in */
#define PD4_SCOM1P3_IN         MCHP_PINMUX(d, 4, 0x5c, 13, periph)
/* pd4_scom1p3_out */
#define PD4_SCOM1P3_OUT        MCHP_PINMUX(d, 4, 0x3d0, 5, periph)
/* pd4_scom2p0_in */
#define PD4_SCOM2P0_IN         MCHP_PINMUX(d, 4, 0x60, 13, periph)
/* pd4_scom2p0_out */
#define PD4_SCOM2P0_OUT        MCHP_PINMUX(d, 4, 0x3d0, 7, periph)
/* pd4_scom2p2_out */
#define PD4_SCOM2P2_OUT        MCHP_PINMUX(d, 4, 0x3d0, 9, periph)
/* pd4_scom2p3_out */
#define PD4_SCOM2P3_OUT        MCHP_PINMUX(d, 4, 0x3d0, 8, periph)
/* pd4_scom3p2_out */
#define PD4_SCOM3P2_OUT        MCHP_PINMUX(d, 4, 0x3d0, 11, periph)
/* pd4_scom3p3_in */
#define PD4_SCOM3P3_IN         MCHP_PINMUX(d, 4, 0x7c, 13, periph)
/* pd4_scom3p3_out */
#define PD4_SCOM3P3_OUT        MCHP_PINMUX(d, 4, 0x3d0, 10, periph)
/* pd4_scom4p0_in */
#define PD4_SCOM4P0_IN         MCHP_PINMUX(d, 4, 0x80, 13, periph)
/* pd4_scom4p0_out */
#define PD4_SCOM4P0_OUT        MCHP_PINMUX(d, 4, 0x3d0, 12, periph)
/* pd4_scom4p2_out */
#define PD4_SCOM4P2_OUT        MCHP_PINMUX(d, 4, 0x3d0, 14, periph)
/* pd4_scom4p3_out */
#define PD4_SCOM4P3_OUT        MCHP_PINMUX(d, 4, 0x3d0, 13, periph)
/* pd4_scom5p2_out */
#define PD4_SCOM5P2_OUT        MCHP_PINMUX(d, 4, 0x3d0, 16, periph)
/* pd4_scom5p3_in */
#define PD4_SCOM5P3_IN         MCHP_PINMUX(d, 4, 0x9c, 13, periph)
/* pd4_scom5p3_out */
#define PD4_SCOM5P3_OUT        MCHP_PINMUX(d, 4, 0x3d0, 15, periph)
/* pd4_tc0wo0g2_in */
#define PD4_TC0WO0G2_IN        MCHP_PINMUX(d, 4, 0xd0, 13, periph)
/* pd4_tc0wo1_out */
#define PD4_TC0WO1_OUT         MCHP_PINMUX(d, 4, 0x3d0, 24, periph)
/* pd4_tc1wo1g2_in */
#define PD4_TC1WO1G2_IN        MCHP_PINMUX(d, 4, 0xe4, 13, periph)
/* pd4_tc1wo1_out */
#define PD4_TC1WO1_OUT         MCHP_PINMUX(d, 4, 0x3d0, 25, periph)
/* pd4_tc2wo1g2_in */
#define PD4_TC2WO1G2_IN        MCHP_PINMUX(d, 4, 0xf4, 13, periph)
/* pd4_tc2wo1_out */
#define PD4_TC2WO1_OUT         MCHP_PINMUX(d, 4, 0x3d0, 26, periph)
/* pd4_tc3wo1g2_in */
#define PD4_TC3WO1G2_IN        MCHP_PINMUX(d, 4, 0x104, 13, periph)
/* pd4_tc3wo1_out */
#define PD4_TC3WO1_OUT         MCHP_PINMUX(d, 4, 0x3d0, 27, periph)
/* pd4_tc4wo1g2_in */
#define PD4_TC4WO1G2_IN        MCHP_PINMUX(d, 4, 0x114, 13, periph)
/* pd4_tc4wo1_out */
#define PD4_TC4WO1_OUT         MCHP_PINMUX(d, 4, 0x3d0, 28, periph)
/* pd4_tc5wo1g2_in */
#define PD4_TC5WO1G2_IN        MCHP_PINMUX(d, 4, 0x124, 13, periph)
/* pd4_tc5wo1_out */
#define PD4_TC5WO1_OUT         MCHP_PINMUX(d, 4, 0x3d0, 29, periph)
/* pd4_tc6wo1g2_in */
#define PD4_TC6WO1G2_IN        MCHP_PINMUX(d, 4, 0x134, 13, periph)
/* pd4_tc6wo1_out */
#define PD4_TC6WO1_OUT         MCHP_PINMUX(d, 4, 0x3d0, 30, periph)
/* pd4_tc7wo1g2_in */
#define PD4_TC7WO1G2_IN        MCHP_PINMUX(d, 4, 0x144, 13, periph)
/* pd4_tc7wo1_out */
#define PD4_TC7WO1_OUT         MCHP_PINMUX(d, 4, 0x3d0, 31, periph)
/* pd4_tc8wo1g2_in */
#define PD4_TC8WO1G2_IN        MCHP_PINMUX(d, 4, 0x154, 13, periph)
/* pd4_tc8wo1g5_in */
#define PD4_TC8WO1G5_IN        MCHP_PINMUX(d, 4, 0x158, 5, periph)
/* pd4_tc8wo1_out */
#define PD4_TC8WO1_OUT         MCHP_PINMUX(d, 4, 0x3d0, 32, periph)
/* pd4_tc9wo0g2_in */
#define PD4_TC9WO0G2_IN        MCHP_PINMUX(d, 4, 0x15c, 13, periph)
/* pd4_tc9wo0_out */
#define PD4_TC9WO0_OUT         MCHP_PINMUX(d, 4, 0x3d0, 33, periph)
/* pd4_tc9wo1g5_in */
#define PD4_TC9WO1G5_IN        MCHP_PINMUX(d, 4, 0x168, 5, periph)
/* pd4_tc9wo1_out */
#define PD4_TC9WO1_OUT         MCHP_PINMUX(d, 4, 0x3d4, 11, periph)
/* pd4_tcc0wo1_out */
#define PD4_TCC0WO1_OUT        MCHP_PINMUX(d, 4, 0x3d0, 17, periph)
/* pd4_tcc0wo2_out */
#define PD4_TCC0WO2_OUT        MCHP_PINMUX(d, 4, 0x3d4, 5, periph)
/* pd4_tcc0wo3_out */
#define PD4_TCC0WO3_OUT        MCHP_PINMUX(d, 4, 0x3d0, 19, periph)
/* pd4_tcc0wo4_out */
#define PD4_TCC0WO4_OUT        MCHP_PINMUX(d, 4, 0x3d4, 4, periph)
/* pd4_tcc0wo5_out */
#define PD4_TCC0WO5_OUT        MCHP_PINMUX(d, 4, 0x3d0, 18, periph)
/* pd4_tcc1wo1_out */
#define PD4_TCC1WO1_OUT        MCHP_PINMUX(d, 4, 0x3d0, 20, periph)
/* pd4_tcc1wo2_out */
#define PD4_TCC1WO2_OUT        MCHP_PINMUX(d, 4, 0x3d4, 8, periph)
/* pd4_tcc1wo3_out */
#define PD4_TCC1WO3_OUT        MCHP_PINMUX(d, 4, 0x3d0, 22, periph)
/* pd4_tcc1wo4_out */
#define PD4_TCC1WO4_OUT        MCHP_PINMUX(d, 4, 0x3d4, 7, periph)
/* pd4_tcc1wo5_out */
#define PD4_TCC1WO5_OUT        MCHP_PINMUX(d, 4, 0x3d0, 21, periph)
/* pd4_tcc2wo1_out */
#define PD4_TCC2WO1_OUT        MCHP_PINMUX(d, 4, 0x3d0, 23, periph)
/* pd4_tstbus3_out */
#define PD4_TSTBUS3_OUT        MCHP_PINMUX(d, 4, 0x3d4, 15, periph)
/* pd4_tstbus5_out */
#define PD4_TSTBUS5_OUT        MCHP_PINMUX(d, 4, 0x3d0, 38, periph)
/* pd4_tstbus7_out */
#define PD4_TSTBUS7_OUT        MCHP_PINMUX(d, 4, 0x3d4, 16, periph)
/* pd4_tstbus9_out */
#define PD4_TSTBUS9_OUT        MCHP_PINMUX(d, 4, 0x3d0, 39, periph)
/* pd4_tstbus11_out */
#define PD4_TSTBUS11_OUT       MCHP_PINMUX(d, 4, 0x3d4, 17, periph)
/* pd5_qspi_sck_out */
#define PD5_QSPI_SCK_OUT       MCHP_PINMUX(d, 5, 0x3d8, 7, periph)
/* pd5_refi_in */
#define PD5_REFI_IN            MCHP_PINMUX(d, 5, 0xb0, 4, periph)
/* pd5_refo1_out */
#define PD5_REFO1_OUT          MCHP_PINMUX(d, 5, 0x3d8, 8, periph)
/* pd5_refo2_out */
#define PD5_REFO2_OUT          MCHP_PINMUX(d, 5, 0x3d8, 9, periph)
/* pd5_refo3_out */
#define PD5_REFO3_OUT          MCHP_PINMUX(d, 5, 0x3d8, 10, periph)
/* pd5_refo4_out */
#define PD5_REFO4_OUT          MCHP_PINMUX(d, 5, 0x3d8, 11, periph)
/* pd5_scom0p1_in */
#define PD5_SCOM0P1_IN         MCHP_PINMUX(d, 5, 0x44, 4, periph)
/* pd5_scom0p1_out */
#define PD5_SCOM0P1_OUT        MCHP_PINMUX(d, 5, 0x3d8, 1, periph)
/* pd5_scom1p1_in */
#define PD5_SCOM1P1_IN         MCHP_PINMUX(d, 5, 0x54, 4, periph)
/* pd5_scom1p1_out */
#define PD5_SCOM1P1_OUT        MCHP_PINMUX(d, 5, 0x3d8, 2, periph)
/* pd5_scom2p1_in */
#define PD5_SCOM2P1_IN         MCHP_PINMUX(d, 5, 0x64, 4, periph)
/* pd5_scom2p1_out */
#define PD5_SCOM2P1_OUT        MCHP_PINMUX(d, 5, 0x3d8, 3, periph)
/* pd5_scom3p1_in */
#define PD5_SCOM3P1_IN         MCHP_PINMUX(d, 5, 0x74, 4, periph)
/* pd5_scom3p1_out */
#define PD5_SCOM3P1_OUT        MCHP_PINMUX(d, 5, 0x3d8, 4, periph)
/* pd5_scom4p1_in */
#define PD5_SCOM4P1_IN         MCHP_PINMUX(d, 5, 0x84, 4, periph)
/* pd5_scom4p1_out */
#define PD5_SCOM4P1_OUT        MCHP_PINMUX(d, 5, 0x3d8, 5, periph)
/* pd5_scom5p1_in */
#define PD5_SCOM5P1_IN         MCHP_PINMUX(d, 5, 0x94, 4, periph)
/* pd5_scom5p1_out */
#define PD5_SCOM5P1_OUT        MCHP_PINMUX(d, 5, 0x3d8, 6, periph)
/* pd6_accmpten_in */
#define PD6_ACCMPTEN_IN        MCHP_PINMUX(d, 6, 0x18c, 8, periph)
/* pd6_ac_cmp0_out */
#define PD6_AC_CMP0_OUT        MCHP_PINMUX(d, 6, 0x3e0, 40, periph)
/* pd6_ac_cmptrdy_out */
#define PD6_AC_CMPTRDY_OUT     MCHP_PINMUX(d, 6, 0x3e0, 41, periph)
/* pd6_can1rx_in */
#define PD6_CAN1RX_IN          MCHP_PINMUX(d, 6, 0x190, 13, periph)
/* pd6_cclin0_in */
#define PD6_CCLIN0_IN          MCHP_PINMUX(d, 6, 0xb4, 8, periph)
/* pd6_cclin2_in */
#define PD6_CCLIN2_IN          MCHP_PINMUX(d, 6, 0xbc, 13, periph)
/* pd6_cclin3_in */
#define PD6_CCLIN3_IN          MCHP_PINMUX(d, 6, 0xc0, 8, periph)
/* pd6_cclin5_in */
#define PD6_CCLIN5_IN          MCHP_PINMUX(d, 6, 0xc8, 13, periph)
/* pd6_cclo0_out */
#define PD6_CCLO0_OUT          MCHP_PINMUX(d, 6, 0x3e0, 1, periph)
/* pd6_coex_bt_state_out */
#define PD6_COEX_BT_STATE_OUT  MCHP_PINMUX(d, 6, 0x3dc, 37, periph)
/* pd6_extint0_in */
#define PD6_EXTINT0_IN         MCHP_PINMUX(d, 6, 0x0, 8, periph)
/* pd6_extint2_in */
#define PD6_EXTINT2_IN         MCHP_PINMUX(d, 6, 0x8, 13, periph)
/* pd6_fectrl1_out */
#define PD6_FECTRL1_OUT        MCHP_PINMUX(d, 6, 0x3dc, 35, periph)
/* pd6_fectrl2_out */
#define PD6_FECTRL2_OUT        MCHP_PINMUX(d, 6, 0x3dc, 36, periph)
/* pd6_fectrl4_out */
#define PD6_FECTRL4_OUT        MCHP_PINMUX(d, 6, 0x3e0, 42, periph)
/* pd6_qd0_out */
#define PD6_QD0_OUT            MCHP_PINMUX(d, 6, 0x3e0, 36, periph)
/* pd6_qd1_in */
#define PD6_QD1_IN             MCHP_PINMUX(d, 6, 0xa4, 8, periph)
/* pd6_qd1_out */
#define PD6_QD1_OUT            MCHP_PINMUX(d, 6, 0x3dc, 30, periph)
/* pd6_qd2_out */
#define PD6_QD2_OUT            MCHP_PINMUX(d, 6, 0x3dc, 29, periph)
/* pd6_qd3_in */
#define PD6_QD3_IN             MCHP_PINMUX(d, 6, 0xac, 13, periph)
/* pd6_qd3_out */
#define PD6_QD3_OUT            MCHP_PINMUX(d, 6, 0x3dc, 28, periph)
/* pd6_qeiccmp0_out */
#define PD6_QEICCMP0_OUT       MCHP_PINMUX(d, 6, 0x3dc, 31, periph)
/* pd6_qeihome0g1_in */
#define PD6_QEIHOME0G1_IN      MCHP_PINMUX(d, 6, 0x16c, 8, periph)
/* pd6_qeiindx0g3_in */
#define PD6_QEIINDX0G3_IN      MCHP_PINMUX(d, 6, 0x178, 13, periph)
/* pd6_qeiqea0g3_in */
#define PD6_QEIQEA0G3_IN       MCHP_PINMUX(d, 6, 0x17c, 13, periph)
/* pd6_qspics_out */
#define PD6_QSPICS_OUT         MCHP_PINMUX(d, 6, 0x3dc, 27, periph)
/* pd6_scom0p0_out */
#define PD6_SCOM0P0_OUT        MCHP_PINMUX(d, 6, 0x3e0, 2, periph)
/* pd6_scom0p2_out */
#define PD6_SCOM0P2_OUT        MCHP_PINMUX(d, 6, 0x3dc, 2, periph)
/* pd6_scom0p3_in */
#define PD6_SCOM0P3_IN         MCHP_PINMUX(d, 6, 0x4c, 8, periph)
/* pd6_scom0p3_out */
#define PD6_SCOM0P3_OUT        MCHP_PINMUX(d, 6, 0x3dc, 1, periph)
/* pd6_scom1p0_in */
#define PD6_SCOM1P0_IN         MCHP_PINMUX(d, 6, 0x50, 13, periph)
/* pd6_scom1p0_out */
#define PD6_SCOM1P0_OUT        MCHP_PINMUX(d, 6, 0x3dc, 3, periph)
/* pd6_scom1p2_in */
#define PD6_SCOM1P2_IN         MCHP_PINMUX(d, 6, 0x58, 8, periph)
/* pd6_scom1p2_out */
#define PD6_SCOM1P2_OUT        MCHP_PINMUX(d, 6, 0x3dc, 4, periph)
/* pd6_scom1p3_out */
#define PD6_SCOM1P3_OUT        MCHP_PINMUX(d, 6, 0x3e0, 6, periph)
/* pd6_scom2p0_out */
#define PD6_SCOM2P0_OUT        MCHP_PINMUX(d, 6, 0x3e0, 7, periph)
/* pd6_scom2p2_out */
#define PD6_SCOM2P2_OUT        MCHP_PINMUX(d, 6, 0x3dc, 6, periph)
/* pd6_scom2p3_in */
#define PD6_SCOM2P3_IN         MCHP_PINMUX(d, 6, 0x6c, 8, periph)
/* pd6_scom2p3_out */
#define PD6_SCOM2P3_OUT        MCHP_PINMUX(d, 6, 0x3dc, 5, periph)
/* pd6_scom3p0_in */
#define PD6_SCOM3P0_IN         MCHP_PINMUX(d, 6, 0x70, 13, periph)
/* pd6_scom3p0_out */
#define PD6_SCOM3P0_OUT        MCHP_PINMUX(d, 6, 0x3dc, 7, periph)
/* pd6_scom3p2_in */
#define PD6_SCOM3P2_IN         MCHP_PINMUX(d, 6, 0x78, 8, periph)
/* pd6_scom3p2_out */
#define PD6_SCOM3P2_OUT        MCHP_PINMUX(d, 6, 0x3dc, 8, periph)
/* pd6_scom3p3_out */
#define PD6_SCOM3P3_OUT        MCHP_PINMUX(d, 6, 0x3e0, 11, periph)
/* pd6_scom4p0_out */
#define PD6_SCOM4P0_OUT        MCHP_PINMUX(d, 6, 0x3e0, 12, periph)
/* pd6_scom4p2_out */
#define PD6_SCOM4P2_OUT        MCHP_PINMUX(d, 6, 0x3dc, 10, periph)
/* pd6_scom4p3_in */
#define PD6_SCOM4P3_IN         MCHP_PINMUX(d, 6, 0x8c, 8, periph)
/* pd6_scom4p3_out */
#define PD6_SCOM4P3_OUT        MCHP_PINMUX(d, 6, 0x3dc, 9, periph)
/* pd6_scom5p0_in */
#define PD6_SCOM5P0_IN         MCHP_PINMUX(d, 6, 0x90, 13, periph)
/* pd6_scom5p0_out */
#define PD6_SCOM5P0_OUT        MCHP_PINMUX(d, 6, 0x3dc, 11, periph)
/* pd6_scom5p2_in */
#define PD6_SCOM5P2_IN         MCHP_PINMUX(d, 6, 0x98, 8, periph)
/* pd6_scom5p2_out */
#define PD6_SCOM5P2_OUT        MCHP_PINMUX(d, 6, 0x3dc, 12, periph)
/* pd6_scom5p3_out */
#define PD6_SCOM5P3_OUT        MCHP_PINMUX(d, 6, 0x3e0, 16, periph)
/* pd6_tc0wo0g1_in */
#define PD6_TC0WO0G1_IN        MCHP_PINMUX(d, 6, 0xcc, 8, periph)
/* pd6_tc0wo0_out */
#define PD6_TC0WO0_OUT         MCHP_PINMUX(d, 6, 0x3e0, 24, periph)
/* pd6_tc0wo1g3_in */
#define PD6_TC0WO1G3_IN        MCHP_PINMUX(d, 6, 0xd4, 13, periph)
/* pd6_tc0wo1_out */
#define PD6_TC0WO1_OUT         MCHP_PINMUX(d, 6, 0x3dc, 18, periph)
/* pd6_tc1wo0g1_in */
#define PD6_TC1WO0G1_IN        MCHP_PINMUX(d, 6, 0xdc, 8, periph)
/* pd6_tc1wo0_out */
#define PD6_TC1WO0_OUT         MCHP_PINMUX(d, 6, 0x3dc, 19, periph)
/* pd6_tc2wo0g1_in */
#define PD6_TC2WO0G1_IN        MCHP_PINMUX(d, 6, 0xec, 8, periph)
/* pd6_tc2wo0g3_in */
#define PD6_TC2WO0G3_IN        MCHP_PINMUX(d, 6, 0xf0, 13, periph)
/* pd6_tc2wo0_out */
#define PD6_TC2WO0_OUT         MCHP_PINMUX(d, 6, 0x3dc, 20, periph)
/* pd6_tc3wo0g1_in */
#define PD6_TC3WO0G1_IN        MCHP_PINMUX(d, 6, 0xfc, 8, periph)
/* pd6_tc3wo0g3_in */
#define PD6_TC3WO0G3_IN        MCHP_PINMUX(d, 6, 0x100, 13, periph)
/* pd6_tc3wo0_out */
#define PD6_TC3WO0_OUT         MCHP_PINMUX(d, 6, 0x3dc, 21, periph)
/* pd6_tc4wo0g1_in */
#define PD6_TC4WO0G1_IN        MCHP_PINMUX(d, 6, 0x10c, 8, periph)
/* pd6_tc4wo0g3_in */
#define PD6_TC4WO0G3_IN        MCHP_PINMUX(d, 6, 0x110, 13, periph)
/* pd6_tc4wo0_out */
#define PD6_TC4WO0_OUT         MCHP_PINMUX(d, 6, 0x3dc, 22, periph)
/* pd6_tc5wo0g1_in */
#define PD6_TC5WO0G1_IN        MCHP_PINMUX(d, 6, 0x11c, 8, periph)
/* pd6_tc5wo0g3_in */
#define PD6_TC5WO0G3_IN        MCHP_PINMUX(d, 6, 0x120, 13, periph)
/* pd6_tc5wo0_out */
#define PD6_TC5WO0_OUT         MCHP_PINMUX(d, 6, 0x3dc, 23, periph)
/* pd6_tc6wo0g1_in */
#define PD6_TC6WO0G1_IN        MCHP_PINMUX(d, 6, 0x12c, 8, periph)
/* pd6_tc6wo0g3_in */
#define PD6_TC6WO0G3_IN        MCHP_PINMUX(d, 6, 0x130, 13, periph)
/* pd6_tc6wo0_out */
#define PD6_TC6WO0_OUT         MCHP_PINMUX(d, 6, 0x3dc, 24, periph)
/* pd6_tc7wo0g1_in */
#define PD6_TC7WO0G1_IN        MCHP_PINMUX(d, 6, 0x13c, 8, periph)
/* pd6_tc7wo0g3_in */
#define PD6_TC7WO0G3_IN        MCHP_PINMUX(d, 6, 0x140, 13, periph)
/* pd6_tc7wo0_out */
#define PD6_TC7WO0_OUT         MCHP_PINMUX(d, 6, 0x3dc, 25, periph)
/* pd6_tc8wo0g1_in */
#define PD6_TC8WO0G1_IN        MCHP_PINMUX(d, 6, 0x14c, 8, periph)
/* pd6_tc8wo0g3_in */
#define PD6_TC8WO0G3_IN        MCHP_PINMUX(d, 6, 0x150, 13, periph)
/* pd6_tc8wo0_out */
#define PD6_TC8WO0_OUT         MCHP_PINMUX(d, 6, 0x3dc, 26, periph)
/* pd6_tc9wo1g3_in */
#define PD6_TC9WO1G3_IN        MCHP_PINMUX(d, 6, 0x164, 13, periph)
/* pd6_tc9wo1_out */
#define PD6_TC9WO1_OUT         MCHP_PINMUX(d, 6, 0x3e0, 33, periph)
/* pd6_tcc0wo0_out */
#define PD6_TCC0WO0_OUT        MCHP_PINMUX(d, 6, 0x3dc, 13, periph)
/* pd6_tcc0wo2_out */
#define PD6_TCC0WO2_OUT        MCHP_PINMUX(d, 6, 0x3e0, 17, periph)
/* pd6_tcc0wo4_out */
#define PD6_TCC0WO4_OUT        MCHP_PINMUX(d, 6, 0x3dc, 14, periph)
/* pd6_tcc1wo0_out */
#define PD6_TCC1WO0_OUT        MCHP_PINMUX(d, 6, 0x3dc, 15, periph)
/* pd6_tcc1wo2_out */
#define PD6_TCC1WO2_OUT        MCHP_PINMUX(d, 6, 0x3e0, 20, periph)
/* pd6_tcc1wo4_out */
#define PD6_TCC1WO4_OUT        MCHP_PINMUX(d, 6, 0x3dc, 16, periph)
/* pd6_tcc2wo0_out */
#define PD6_TCC2WO0_OUT        MCHP_PINMUX(d, 6, 0x3dc, 17, periph)
/* pd6_tstbus0_out */
#define PD6_TSTBUS0_OUT        MCHP_PINMUX(d, 6, 0x3dc, 32, periph)
/* pd6_tstbus1_out */
#define PD6_TSTBUS1_OUT        MCHP_PINMUX(d, 6, 0x3e0, 38, periph)
/* pd6_tstbus4_out */
#define PD6_TSTBUS4_OUT        MCHP_PINMUX(d, 6, 0x3dc, 33, periph)
/* pd6_tstbus8_out */
#define PD6_TSTBUS8_OUT        MCHP_PINMUX(d, 6, 0x3dc, 34, periph)
/* pd6_tstbus10_out */
#define PD6_TSTBUS10_OUT       MCHP_PINMUX(d, 6, 0x3e0, 39, periph)
/* pd7_ac_cmp1_out */
#define PD7_AC_CMP1_OUT        MCHP_PINMUX(d, 7, 0x3e8, 36, periph)
/* pd7_ac_cmptout_out */
#define PD7_AC_CMPTOUT_OUT     MCHP_PINMUX(d, 7, 0x3e8, 37, periph)
/* pd7_can1_tx_out */
#define PD7_CAN1_TX_OUT        MCHP_PINMUX(d, 7, 0x3e8, 38, periph)
/* pd7_cclin1_in */
#define PD7_CCLIN1_IN          MCHP_PINMUX(d, 7, 0xb8, 8, periph)
/* pd7_cclin4_in */
#define PD7_CCLIN4_IN          MCHP_PINMUX(d, 7, 0xc4, 8, periph)
/* pd7_cclo1_out */
#define PD7_CCLO1_OUT          MCHP_PINMUX(d, 7, 0x3e4, 1, periph)
/* pd7_coexwlanact_in */
#define PD7_COEXWLANACT_IN     MCHP_PINMUX(d, 7, 0x194, 11, periph)
/* pd7_coex_rf_act_out */
#define PD7_COEX_RF_ACT_OUT    MCHP_PINMUX(d, 7, 0x3e4, 41, periph)
/* pd7_extint1_in */
#define PD7_EXTINT1_IN         MCHP_PINMUX(d, 7, 0x4, 8, periph)
/* pd7_extint3_in */
#define PD7_EXTINT3_IN         MCHP_PINMUX(d, 7, 0xc, 11, periph)
/* pd7_fectrl0_out */
#define PD7_FECTRL0_OUT        MCHP_PINMUX(d, 7, 0x3e4, 40, periph)
/* pd7_fectrl3_out */
#define PD7_FECTRL3_OUT        MCHP_PINMUX(d, 7, 0x3e8, 39, periph)
/* pd7_fectrl5_out */
#define PD7_FECTRL5_OUT        MCHP_PINMUX(d, 7, 0x3e8, 40, periph)
/* pd7_nmi_in */
#define PD7_NMI_IN             MCHP_PINMUX(d, 7, 0x3c, 11, periph)
/* pd7_qd0_in */
#define PD7_QD0_IN             MCHP_PINMUX(d, 7, 0xa0, 11, periph)
/* pd7_qd0_out */
#define PD7_QD0_OUT            MCHP_PINMUX(d, 7, 0x3e4, 35, periph)
/* pd7_qd1_out */
#define PD7_QD1_OUT            MCHP_PINMUX(d, 7, 0x3e8, 32, periph)
/* pd7_qd2_in */
#define PD7_QD2_IN             MCHP_PINMUX(d, 7, 0xa8, 8, periph)
/* pd7_qd2_out */
#define PD7_QD2_OUT            MCHP_PINMUX(d, 7, 0x3e4, 37, periph)
/* pd7_qd3_out */
#define PD7_QD3_OUT            MCHP_PINMUX(d, 7, 0x3e4, 36, periph)
/* pd7_qeihome0g2_in */
#define PD7_QEIHOME0G2_IN      MCHP_PINMUX(d, 7, 0x170, 8, periph)
/* pd7_qeiindx0g2_in */
#define PD7_QEIINDX0G2_IN      MCHP_PINMUX(d, 7, 0x174, 8, periph)
/* pd7_qeiqea0g4_in */
#define PD7_QEIQEA0G4_IN       MCHP_PINMUX(d, 7, 0x180, 11, periph)
/* pd7_qeiqeb0g4_in */
