zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cx_bz/bz62/pic32cx2051bz62064-pinctrl.h
#define PD7_QEIQEB0G4_IN       MCHP_PINMUX(d, 7, 0x184, 11, periph)
/* pd7_qspics_out */
#define PD7_QSPICS_OUT         MCHP_PINMUX(d, 7, 0x3e4, 34, periph)
/* pd7_scom0p0_in */
#define PD7_SCOM0P0_IN         MCHP_PINMUX(d, 7, 0x40, 8, periph)
/* pd7_scom0p0_out */
#define PD7_SCOM0P0_OUT        MCHP_PINMUX(d, 7, 0x3e4, 2, periph)
/* pd7_scom0p2_in */
#define PD7_SCOM0P2_IN         MCHP_PINMUX(d, 7, 0x48, 11, periph)
/* pd7_scom0p2_out */
#define PD7_SCOM0P2_OUT        MCHP_PINMUX(d, 7, 0x3e4, 4, periph)
/* pd7_scom0p3_out */
#define PD7_SCOM0P3_OUT        MCHP_PINMUX(d, 7, 0x3e4, 3, periph)
/* pd7_scom1p0_out */
#define PD7_SCOM1P0_OUT        MCHP_PINMUX(d, 7, 0x3e8, 5, periph)
/* pd7_scom1p2_out */
#define PD7_SCOM1P2_OUT        MCHP_PINMUX(d, 7, 0x3e4, 6, periph)
/* pd7_scom1p3_in */
#define PD7_SCOM1P3_IN         MCHP_PINMUX(d, 7, 0x5c, 8, periph)
/* pd7_scom1p3_out */
#define PD7_SCOM1P3_OUT        MCHP_PINMUX(d, 7, 0x3e4, 5, periph)
/* pd7_scom2p0_in */
#define PD7_SCOM2P0_IN         MCHP_PINMUX(d, 7, 0x60, 8, periph)
/* pd7_scom2p0_out */
#define PD7_SCOM2P0_OUT        MCHP_PINMUX(d, 7, 0x3e4, 7, periph)
/* pd7_scom2p2_in */
#define PD7_SCOM2P2_IN         MCHP_PINMUX(d, 7, 0x68, 11, periph)
/* pd7_scom2p2_out */
#define PD7_SCOM2P2_OUT        MCHP_PINMUX(d, 7, 0x3e4, 9, periph)
/* pd7_scom2p3_out */
#define PD7_SCOM2P3_OUT        MCHP_PINMUX(d, 7, 0x3e4, 8, periph)
/* pd7_scom3p0_out */
#define PD7_SCOM3P0_OUT        MCHP_PINMUX(d, 7, 0x3e8, 9, periph)
/* pd7_scom3p2_out */
#define PD7_SCOM3P2_OUT        MCHP_PINMUX(d, 7, 0x3e4, 11, periph)
/* pd7_scom3p3_in */
#define PD7_SCOM3P3_IN         MCHP_PINMUX(d, 7, 0x7c, 8, periph)
/* pd7_scom3p3_out */
#define PD7_SCOM3P3_OUT        MCHP_PINMUX(d, 7, 0x3e4, 10, periph)
/* pd7_scom4p0_in */
#define PD7_SCOM4P0_IN         MCHP_PINMUX(d, 7, 0x80, 8, periph)
/* pd7_scom4p0_out */
#define PD7_SCOM4P0_OUT        MCHP_PINMUX(d, 7, 0x3e4, 12, periph)
/* pd7_scom4p2_in */
#define PD7_SCOM4P2_IN         MCHP_PINMUX(d, 7, 0x88, 11, periph)
/* pd7_scom4p2_out */
#define PD7_SCOM4P2_OUT        MCHP_PINMUX(d, 7, 0x3e4, 14, periph)
/* pd7_scom4p3_out */
#define PD7_SCOM4P3_OUT        MCHP_PINMUX(d, 7, 0x3e4, 13, periph)
/* pd7_scom5p0_out */
#define PD7_SCOM5P0_OUT        MCHP_PINMUX(d, 7, 0x3e8, 13, periph)
/* pd7_scom5p2_out */
#define PD7_SCOM5P2_OUT        MCHP_PINMUX(d, 7, 0x3e4, 16, periph)
/* pd7_scom5p3_in */
#define PD7_SCOM5P3_IN         MCHP_PINMUX(d, 7, 0x9c, 8, periph)
/* pd7_scom5p3_out */
#define PD7_SCOM5P3_OUT        MCHP_PINMUX(d, 7, 0x3e4, 15, periph)
/* pd7_tc0wo0g2_in */
#define PD7_TC0WO0G2_IN        MCHP_PINMUX(d, 7, 0xd0, 8, periph)
/* pd7_tc0wo0_out */
#define PD7_TC0WO0_OUT         MCHP_PINMUX(d, 7, 0x3e8, 21, periph)
/* pd7_tc0wo1g4_in */
#define PD7_TC0WO1G4_IN        MCHP_PINMUX(d, 7, 0xd8, 11, periph)
/* pd7_tc0wo1_out */
#define PD7_TC0WO1_OUT         MCHP_PINMUX(d, 7, 0x3e4, 24, periph)
/* pd7_tc1wo1g2_in */
#define PD7_TC1WO1G2_IN        MCHP_PINMUX(d, 7, 0xe4, 8, periph)
/* pd7_tc1wo1_out */
#define PD7_TC1WO1_OUT         MCHP_PINMUX(d, 7, 0x3e4, 25, periph)
/* pd7_tc2wo1g2_in */
#define PD7_TC2WO1G2_IN        MCHP_PINMUX(d, 7, 0xf4, 8, periph)
/* pd7_tc2wo1g4_in */
#define PD7_TC2WO1G4_IN        MCHP_PINMUX(d, 7, 0xf8, 11, periph)
/* pd7_tc2wo1_out */
#define PD7_TC2WO1_OUT         MCHP_PINMUX(d, 7, 0x3e4, 26, periph)
/* pd7_tc3wo1g2_in */
#define PD7_TC3WO1G2_IN        MCHP_PINMUX(d, 7, 0x104, 8, periph)
/* pd7_tc3wo1g4_in */
#define PD7_TC3WO1G4_IN        MCHP_PINMUX(d, 7, 0x108, 11, periph)
/* pd7_tc3wo1_out */
#define PD7_TC3WO1_OUT         MCHP_PINMUX(d, 7, 0x3e4, 27, periph)
/* pd7_tc4wo1g2_in */
#define PD7_TC4WO1G2_IN        MCHP_PINMUX(d, 7, 0x114, 8, periph)
/* pd7_tc4wo1g4_in */
#define PD7_TC4WO1G4_IN        MCHP_PINMUX(d, 7, 0x118, 11, periph)
/* pd7_tc4wo1_out */
#define PD7_TC4WO1_OUT         MCHP_PINMUX(d, 7, 0x3e4, 28, periph)
/* pd7_tc5wo1g2_in */
#define PD7_TC5WO1G2_IN        MCHP_PINMUX(d, 7, 0x124, 8, periph)
/* pd7_tc5wo1g4_in */
#define PD7_TC5WO1G4_IN        MCHP_PINMUX(d, 7, 0x128, 11, periph)
/* pd7_tc5wo1_out */
#define PD7_TC5WO1_OUT         MCHP_PINMUX(d, 7, 0x3e4, 29, periph)
/* pd7_tc6wo1g2_in */
#define PD7_TC6WO1G2_IN        MCHP_PINMUX(d, 7, 0x134, 8, periph)
/* pd7_tc6wo1g4_in */
#define PD7_TC6WO1G4_IN        MCHP_PINMUX(d, 7, 0x138, 11, periph)
/* pd7_tc6wo1_out */
#define PD7_TC6WO1_OUT         MCHP_PINMUX(d, 7, 0x3e4, 30, periph)
/* pd7_tc7wo1g2_in */
#define PD7_TC7WO1G2_IN        MCHP_PINMUX(d, 7, 0x144, 8, periph)
/* pd7_tc7wo1g4_in */
#define PD7_TC7WO1G4_IN        MCHP_PINMUX(d, 7, 0x148, 11, periph)
/* pd7_tc7wo1_out */
#define PD7_TC7WO1_OUT         MCHP_PINMUX(d, 7, 0x3e4, 31, periph)
/* pd7_tc8wo1g2_in */
#define PD7_TC8WO1G2_IN        MCHP_PINMUX(d, 7, 0x154, 8, periph)
/* pd7_tc8wo1_out */
#define PD7_TC8WO1_OUT         MCHP_PINMUX(d, 7, 0x3e4, 32, periph)
/* pd7_tc9wo0g2_in */
#define PD7_TC9WO0G2_IN        MCHP_PINMUX(d, 7, 0x15c, 8, periph)
/* pd7_tc9wo0g4_in */
#define PD7_TC9WO0G4_IN        MCHP_PINMUX(d, 7, 0x160, 11, periph)
/* pd7_tc9wo0_out */
#define PD7_TC9WO0_OUT         MCHP_PINMUX(d, 7, 0x3e4, 33, periph)
/* pd7_tcc0wo1_out */
#define PD7_TCC0WO1_OUT        MCHP_PINMUX(d, 7, 0x3e4, 17, periph)
/* pd7_tcc0wo3_out */
#define PD7_TCC0WO3_OUT        MCHP_PINMUX(d, 7, 0x3e4, 19, periph)
/* pd7_tcc0wo5_out */
#define PD7_TCC0WO5_OUT        MCHP_PINMUX(d, 7, 0x3e4, 18, periph)
/* pd7_tcc1wo1_out */
#define PD7_TCC1WO1_OUT        MCHP_PINMUX(d, 7, 0x3e4, 20, periph)
/* pd7_tcc1wo3_out */
#define PD7_TCC1WO3_OUT        MCHP_PINMUX(d, 7, 0x3e4, 22, periph)
/* pd7_tcc1wo5_out */
#define PD7_TCC1WO5_OUT        MCHP_PINMUX(d, 7, 0x3e4, 21, periph)
/* pd7_tcc2wo1_out */
#define PD7_TCC2WO1_OUT        MCHP_PINMUX(d, 7, 0x3e4, 23, periph)
/* pd7_tstbus2_out */
#define PD7_TSTBUS2_OUT        MCHP_PINMUX(d, 7, 0x3e8, 34, periph)
/* pd7_tstbus5_out */
#define PD7_TSTBUS5_OUT        MCHP_PINMUX(d, 7, 0x3e4, 38, periph)
/* pd7_tstbus6_out */
#define PD7_TSTBUS6_OUT        MCHP_PINMUX(d, 7, 0x3e8, 35, periph)
/* pd7_tstbus9_out */
#define PD7_TSTBUS9_OUT        MCHP_PINMUX(d, 7, 0x3e4, 39, periph)
/* pe0_accmpten_in */
#define PE0_ACCMPTEN_IN        MCHP_PINMUX(e, 0, 0x18c, 9, periph)
/* pe0_ac_cmp0_out */
#define PE0_AC_CMP0_OUT        MCHP_PINMUX(e, 0, 0x410, 40, periph)
/* pe0_ac_cmptrdy_out */
#define PE0_AC_CMPTRDY_OUT     MCHP_PINMUX(e, 0, 0x410, 41, periph)
/* pe0_can1rx_in */
#define PE0_CAN1RX_IN          MCHP_PINMUX(e, 0, 0x190, 14, periph)
/* pe0_cclin0_in */
#define PE0_CCLIN0_IN          MCHP_PINMUX(e, 0, 0xb4, 9, periph)
/* pe0_cclin2_in */
#define PE0_CCLIN2_IN          MCHP_PINMUX(e, 0, 0xbc, 14, periph)
/* pe0_cclin3_in */
#define PE0_CCLIN3_IN          MCHP_PINMUX(e, 0, 0xc0, 9, periph)
/* pe0_cclin5_in */
#define PE0_CCLIN5_IN          MCHP_PINMUX(e, 0, 0xc8, 14, periph)
/* pe0_cclo0_out */
#define PE0_CCLO0_OUT          MCHP_PINMUX(e, 0, 0x410, 1, periph)
/* pe0_coex_bt_state_out */
#define PE0_COEX_BT_STATE_OUT  MCHP_PINMUX(e, 0, 0x40c, 37, periph)
/* pe0_extint0_in */
#define PE0_EXTINT0_IN         MCHP_PINMUX(e, 0, 0x0, 9, periph)
/* pe0_extint2_in */
#define PE0_EXTINT2_IN         MCHP_PINMUX(e, 0, 0x8, 14, periph)
/* pe0_fectrl1_out */
#define PE0_FECTRL1_OUT        MCHP_PINMUX(e, 0, 0x40c, 35, periph)
/* pe0_fectrl2_out */
#define PE0_FECTRL2_OUT        MCHP_PINMUX(e, 0, 0x40c, 36, periph)
/* pe0_fectrl4_out */
#define PE0_FECTRL4_OUT        MCHP_PINMUX(e, 0, 0x410, 42, periph)
/* pe0_qd0_out */
#define PE0_QD0_OUT            MCHP_PINMUX(e, 0, 0x410, 36, periph)
/* pe0_qd1_in */
#define PE0_QD1_IN             MCHP_PINMUX(e, 0, 0xa4, 9, periph)
/* pe0_qd1_out */
#define PE0_QD1_OUT            MCHP_PINMUX(e, 0, 0x40c, 30, periph)
/* pe0_qd2_out */
#define PE0_QD2_OUT            MCHP_PINMUX(e, 0, 0x40c, 29, periph)
/* pe0_qd3_in */
#define PE0_QD3_IN             MCHP_PINMUX(e, 0, 0xac, 14, periph)
/* pe0_qd3_out */
#define PE0_QD3_OUT            MCHP_PINMUX(e, 0, 0x40c, 28, periph)
/* pe0_qeiccmp0_out */
#define PE0_QEICCMP0_OUT       MCHP_PINMUX(e, 0, 0x40c, 31, periph)
/* pe0_qeihome0g1_in */
#define PE0_QEIHOME0G1_IN      MCHP_PINMUX(e, 0, 0x16c, 9, periph)
/* pe0_qeiindx0g3_in */
#define PE0_QEIINDX0G3_IN      MCHP_PINMUX(e, 0, 0x178, 14, periph)
/* pe0_qeiqea0g3_in */
#define PE0_QEIQEA0G3_IN       MCHP_PINMUX(e, 0, 0x17c, 14, periph)
/* pe0_qspics_out */
#define PE0_QSPICS_OUT         MCHP_PINMUX(e, 0, 0x40c, 27, periph)
/* pe0_scom0p0_out */
#define PE0_SCOM0P0_OUT        MCHP_PINMUX(e, 0, 0x410, 2, periph)
/* pe0_scom0p2_out */
#define PE0_SCOM0P2_OUT        MCHP_PINMUX(e, 0, 0x40c, 2, periph)
/* pe0_scom0p3_in */
#define PE0_SCOM0P3_IN         MCHP_PINMUX(e, 0, 0x4c, 9, periph)
/* pe0_scom0p3_out */
#define PE0_SCOM0P3_OUT        MCHP_PINMUX(e, 0, 0x40c, 1, periph)
/* pe0_scom1p0_in */
#define PE0_SCOM1P0_IN         MCHP_PINMUX(e, 0, 0x50, 14, periph)
/* pe0_scom1p0_out */
#define PE0_SCOM1P0_OUT        MCHP_PINMUX(e, 0, 0x40c, 3, periph)
/* pe0_scom1p2_in */
#define PE0_SCOM1P2_IN         MCHP_PINMUX(e, 0, 0x58, 9, periph)
/* pe0_scom1p2_out */
#define PE0_SCOM1P2_OUT        MCHP_PINMUX(e, 0, 0x40c, 4, periph)
/* pe0_scom1p3_out */
#define PE0_SCOM1P3_OUT        MCHP_PINMUX(e, 0, 0x410, 6, periph)
/* pe0_scom2p0_out */
#define PE0_SCOM2P0_OUT        MCHP_PINMUX(e, 0, 0x410, 7, periph)
/* pe0_scom2p2_out */
#define PE0_SCOM2P2_OUT        MCHP_PINMUX(e, 0, 0x40c, 6, periph)
/* pe0_scom2p3_in */
#define PE0_SCOM2P3_IN         MCHP_PINMUX(e, 0, 0x6c, 9, periph)
/* pe0_scom2p3_out */
#define PE0_SCOM2P3_OUT        MCHP_PINMUX(e, 0, 0x40c, 5, periph)
/* pe0_scom3p0_in */
#define PE0_SCOM3P0_IN         MCHP_PINMUX(e, 0, 0x70, 14, periph)
/* pe0_scom3p0_out */
#define PE0_SCOM3P0_OUT        MCHP_PINMUX(e, 0, 0x40c, 7, periph)
/* pe0_scom3p2_in */
#define PE0_SCOM3P2_IN         MCHP_PINMUX(e, 0, 0x78, 9, periph)
/* pe0_scom3p2_out */
#define PE0_SCOM3P2_OUT        MCHP_PINMUX(e, 0, 0x40c, 8, periph)
/* pe0_scom3p3_out */
#define PE0_SCOM3P3_OUT        MCHP_PINMUX(e, 0, 0x410, 11, periph)
/* pe0_scom4p0_out */
#define PE0_SCOM4P0_OUT        MCHP_PINMUX(e, 0, 0x410, 12, periph)
/* pe0_scom4p2_out */
#define PE0_SCOM4P2_OUT        MCHP_PINMUX(e, 0, 0x40c, 10, periph)
/* pe0_scom4p3_in */
#define PE0_SCOM4P3_IN         MCHP_PINMUX(e, 0, 0x8c, 9, periph)
/* pe0_scom4p3_out */
#define PE0_SCOM4P3_OUT        MCHP_PINMUX(e, 0, 0x40c, 9, periph)
/* pe0_scom5p0_in */
#define PE0_SCOM5P0_IN         MCHP_PINMUX(e, 0, 0x90, 14, periph)
/* pe0_scom5p0_out */
#define PE0_SCOM5P0_OUT        MCHP_PINMUX(e, 0, 0x40c, 11, periph)
/* pe0_scom5p2_in */
#define PE0_SCOM5P2_IN         MCHP_PINMUX(e, 0, 0x98, 9, periph)
/* pe0_scom5p2_out */
#define PE0_SCOM5P2_OUT        MCHP_PINMUX(e, 0, 0x40c, 12, periph)
/* pe0_scom5p3_out */
#define PE0_SCOM5P3_OUT        MCHP_PINMUX(e, 0, 0x410, 16, periph)
/* pe0_tc0wo0g1_in */
#define PE0_TC0WO0G1_IN        MCHP_PINMUX(e, 0, 0xcc, 9, periph)
/* pe0_tc0wo0_out */
#define PE0_TC0WO0_OUT         MCHP_PINMUX(e, 0, 0x410, 24, periph)
/* pe0_tc0wo1g3_in */
#define PE0_TC0WO1G3_IN        MCHP_PINMUX(e, 0, 0xd4, 14, periph)
/* pe0_tc0wo1_out */
#define PE0_TC0WO1_OUT         MCHP_PINMUX(e, 0, 0x40c, 18, periph)
/* pe0_tc1wo0g1_in */
#define PE0_TC1WO0G1_IN        MCHP_PINMUX(e, 0, 0xdc, 9, periph)
/* pe0_tc1wo0_out */
#define PE0_TC1WO0_OUT         MCHP_PINMUX(e, 0, 0x40c, 19, periph)
/* pe0_tc2wo0g1_in */
#define PE0_TC2WO0G1_IN        MCHP_PINMUX(e, 0, 0xec, 9, periph)
/* pe0_tc2wo0g3_in */
#define PE0_TC2WO0G3_IN        MCHP_PINMUX(e, 0, 0xf0, 14, periph)
/* pe0_tc2wo0_out */
#define PE0_TC2WO0_OUT         MCHP_PINMUX(e, 0, 0x40c, 20, periph)
/* pe0_tc3wo0g1_in */
#define PE0_TC3WO0G1_IN        MCHP_PINMUX(e, 0, 0xfc, 9, periph)
/* pe0_tc3wo0g3_in */
#define PE0_TC3WO0G3_IN        MCHP_PINMUX(e, 0, 0x100, 14, periph)
/* pe0_tc3wo0_out */
#define PE0_TC3WO0_OUT         MCHP_PINMUX(e, 0, 0x40c, 21, periph)
/* pe0_tc4wo0g1_in */
#define PE0_TC4WO0G1_IN        MCHP_PINMUX(e, 0, 0x10c, 9, periph)
/* pe0_tc4wo0g3_in */
#define PE0_TC4WO0G3_IN        MCHP_PINMUX(e, 0, 0x110, 14, periph)
/* pe0_tc4wo0_out */
#define PE0_TC4WO0_OUT         MCHP_PINMUX(e, 0, 0x40c, 22, periph)
/* pe0_tc5wo0g1_in */
#define PE0_TC5WO0G1_IN        MCHP_PINMUX(e, 0, 0x11c, 9, periph)
/* pe0_tc5wo0g3_in */
#define PE0_TC5WO0G3_IN        MCHP_PINMUX(e, 0, 0x120, 14, periph)
/* pe0_tc5wo0_out */
#define PE0_TC5WO0_OUT         MCHP_PINMUX(e, 0, 0x40c, 23, periph)
/* pe0_tc6wo0g1_in */
#define PE0_TC6WO0G1_IN        MCHP_PINMUX(e, 0, 0x12c, 9, periph)
/* pe0_tc6wo0g3_in */
#define PE0_TC6WO0G3_IN        MCHP_PINMUX(e, 0, 0x130, 14, periph)
/* pe0_tc6wo0_out */
#define PE0_TC6WO0_OUT         MCHP_PINMUX(e, 0, 0x40c, 24, periph)
/* pe0_tc7wo0g1_in */
#define PE0_TC7WO0G1_IN        MCHP_PINMUX(e, 0, 0x13c, 9, periph)
/* pe0_tc7wo0g3_in */
#define PE0_TC7WO0G3_IN        MCHP_PINMUX(e, 0, 0x140, 14, periph)
/* pe0_tc7wo0_out */
#define PE0_TC7WO0_OUT         MCHP_PINMUX(e, 0, 0x40c, 25, periph)
/* pe0_tc8wo0g1_in */
#define PE0_TC8WO0G1_IN        MCHP_PINMUX(e, 0, 0x14c, 9, periph)
/* pe0_tc8wo0g3_in */
#define PE0_TC8WO0G3_IN        MCHP_PINMUX(e, 0, 0x150, 14, periph)
/* pe0_tc8wo0_out */
#define PE0_TC8WO0_OUT         MCHP_PINMUX(e, 0, 0x40c, 26, periph)
/* pe0_tc9wo1g3_in */
#define PE0_TC9WO1G3_IN        MCHP_PINMUX(e, 0, 0x164, 14, periph)
/* pe0_tc9wo1_out */
#define PE0_TC9WO1_OUT         MCHP_PINMUX(e, 0, 0x410, 33, periph)
/* pe0_tcc0wo0_out */
#define PE0_TCC0WO0_OUT        MCHP_PINMUX(e, 0, 0x40c, 13, periph)
/* pe0_tcc0wo2_out */
#define PE0_TCC0WO2_OUT        MCHP_PINMUX(e, 0, 0x410, 17, periph)
/* pe0_tcc0wo4_out */
#define PE0_TCC0WO4_OUT        MCHP_PINMUX(e, 0, 0x40c, 14, periph)
/* pe0_tcc1wo0_out */
#define PE0_TCC1WO0_OUT        MCHP_PINMUX(e, 0, 0x40c, 15, periph)
/* pe0_tcc1wo2_out */
#define PE0_TCC1WO2_OUT        MCHP_PINMUX(e, 0, 0x410, 20, periph)
/* pe0_tcc1wo4_out */
#define PE0_TCC1WO4_OUT        MCHP_PINMUX(e, 0, 0x40c, 16, periph)
/* pe0_tcc2wo0_out */
#define PE0_TCC2WO0_OUT        MCHP_PINMUX(e, 0, 0x40c, 17, periph)
/* pe0_tstbus0_out */
#define PE0_TSTBUS0_OUT        MCHP_PINMUX(e, 0, 0x40c, 32, periph)
/* pe0_tstbus1_out */
#define PE0_TSTBUS1_OUT        MCHP_PINMUX(e, 0, 0x410, 38, periph)
/* pe0_tstbus4_out */
#define PE0_TSTBUS4_OUT        MCHP_PINMUX(e, 0, 0x40c, 33, periph)
/* pe0_tstbus8_out */
#define PE0_TSTBUS8_OUT        MCHP_PINMUX(e, 0, 0x40c, 34, periph)
/* pe0_tstbus10_out */
#define PE0_TSTBUS10_OUT       MCHP_PINMUX(e, 0, 0x410, 39, periph)
/* pe1_ac_cmp1_out */
#define PE1_AC_CMP1_OUT        MCHP_PINMUX(e, 1, 0x418, 36, periph)
/* pe1_ac_cmptout_out */
#define PE1_AC_CMPTOUT_OUT     MCHP_PINMUX(e, 1, 0x418, 37, periph)
/* pe1_can1_tx_out */
#define PE1_CAN1_TX_OUT        MCHP_PINMUX(e, 1, 0x418, 38, periph)
/* pe1_cclin1_in */
#define PE1_CCLIN1_IN          MCHP_PINMUX(e, 1, 0xb8, 9, periph)
/* pe1_cclin4_in */
#define PE1_CCLIN4_IN          MCHP_PINMUX(e, 1, 0xc4, 9, periph)
/* pe1_cclo1_out */
#define PE1_CCLO1_OUT          MCHP_PINMUX(e, 1, 0x414, 1, periph)
/* pe1_coexwlanact_in */
#define PE1_COEXWLANACT_IN     MCHP_PINMUX(e, 1, 0x194, 12, periph)
/* pe1_coex_rf_act_out */
#define PE1_COEX_RF_ACT_OUT    MCHP_PINMUX(e, 1, 0x414, 41, periph)
/* pe1_extint1_in */
#define PE1_EXTINT1_IN         MCHP_PINMUX(e, 1, 0x4, 9, periph)
/* pe1_extint3_in */
#define PE1_EXTINT3_IN         MCHP_PINMUX(e, 1, 0xc, 12, periph)
/* pe1_fectrl0_out */
#define PE1_FECTRL0_OUT        MCHP_PINMUX(e, 1, 0x414, 40, periph)
/* pe1_fectrl3_out */
#define PE1_FECTRL3_OUT        MCHP_PINMUX(e, 1, 0x418, 39, periph)
/* pe1_fectrl5_out */
#define PE1_FECTRL5_OUT        MCHP_PINMUX(e, 1, 0x418, 40, periph)
/* pe1_nmi_in */
#define PE1_NMI_IN             MCHP_PINMUX(e, 1, 0x3c, 12, periph)
/* pe1_qd0_in */
#define PE1_QD0_IN             MCHP_PINMUX(e, 1, 0xa0, 12, periph)
/* pe1_qd0_out */
#define PE1_QD0_OUT            MCHP_PINMUX(e, 1, 0x414, 35, periph)
/* pe1_qd1_out */
#define PE1_QD1_OUT            MCHP_PINMUX(e, 1, 0x418, 32, periph)
/* pe1_qd2_in */
#define PE1_QD2_IN             MCHP_PINMUX(e, 1, 0xa8, 9, periph)
/* pe1_qd2_out */
#define PE1_QD2_OUT            MCHP_PINMUX(e, 1, 0x414, 37, periph)
/* pe1_qd3_out */
#define PE1_QD3_OUT            MCHP_PINMUX(e, 1, 0x414, 36, periph)
/* pe1_qeihome0g2_in */
#define PE1_QEIHOME0G2_IN      MCHP_PINMUX(e, 1, 0x170, 9, periph)
/* pe1_qeiindx0g2_in */
#define PE1_QEIINDX0G2_IN      MCHP_PINMUX(e, 1, 0x174, 9, periph)
/* pe1_qeiqea0g4_in */
#define PE1_QEIQEA0G4_IN       MCHP_PINMUX(e, 1, 0x180, 12, periph)
/* pe1_qeiqeb0g4_in */
#define PE1_QEIQEB0G4_IN       MCHP_PINMUX(e, 1, 0x184, 12, periph)
/* pe1_qspics_out */
#define PE1_QSPICS_OUT         MCHP_PINMUX(e, 1, 0x414, 34, periph)
/* pe1_scom0p0_in */
#define PE1_SCOM0P0_IN         MCHP_PINMUX(e, 1, 0x40, 9, periph)
/* pe1_scom0p0_out */
#define PE1_SCOM0P0_OUT        MCHP_PINMUX(e, 1, 0x414, 2, periph)
/* pe1_scom0p2_in */
#define PE1_SCOM0P2_IN         MCHP_PINMUX(e, 1, 0x48, 12, periph)
/* pe1_scom0p2_out */
#define PE1_SCOM0P2_OUT        MCHP_PINMUX(e, 1, 0x414, 4, periph)
/* pe1_scom0p3_out */
#define PE1_SCOM0P3_OUT        MCHP_PINMUX(e, 1, 0x414, 3, periph)
/* pe1_scom1p0_out */
#define PE1_SCOM1P0_OUT        MCHP_PINMUX(e, 1, 0x418, 5, periph)
/* pe1_scom1p2_out */
#define PE1_SCOM1P2_OUT        MCHP_PINMUX(e, 1, 0x414, 6, periph)
/* pe1_scom1p3_in */
#define PE1_SCOM1P3_IN         MCHP_PINMUX(e, 1, 0x5c, 9, periph)
/* pe1_scom1p3_out */
#define PE1_SCOM1P3_OUT        MCHP_PINMUX(e, 1, 0x414, 5, periph)
/* pe1_scom2p0_in */
#define PE1_SCOM2P0_IN         MCHP_PINMUX(e, 1, 0x60, 9, periph)
/* pe1_scom2p0_out */
#define PE1_SCOM2P0_OUT        MCHP_PINMUX(e, 1, 0x414, 7, periph)
/* pe1_scom2p2_in */
#define PE1_SCOM2P2_IN         MCHP_PINMUX(e, 1, 0x68, 12, periph)
/* pe1_scom2p2_out */
#define PE1_SCOM2P2_OUT        MCHP_PINMUX(e, 1, 0x414, 9, periph)
/* pe1_scom2p3_out */
#define PE1_SCOM2P3_OUT        MCHP_PINMUX(e, 1, 0x414, 8, periph)
/* pe1_scom3p0_out */
#define PE1_SCOM3P0_OUT        MCHP_PINMUX(e, 1, 0x418, 9, periph)
/* pe1_scom3p2_out */
#define PE1_SCOM3P2_OUT        MCHP_PINMUX(e, 1, 0x414, 11, periph)
/* pe1_scom3p3_in */
#define PE1_SCOM3P3_IN         MCHP_PINMUX(e, 1, 0x7c, 9, periph)
/* pe1_scom3p3_out */
#define PE1_SCOM3P3_OUT        MCHP_PINMUX(e, 1, 0x414, 10, periph)
/* pe1_scom4p0_in */
#define PE1_SCOM4P0_IN         MCHP_PINMUX(e, 1, 0x80, 9, periph)
/* pe1_scom4p0_out */
#define PE1_SCOM4P0_OUT        MCHP_PINMUX(e, 1, 0x414, 12, periph)
/* pe1_scom4p2_in */
#define PE1_SCOM4P2_IN         MCHP_PINMUX(e, 1, 0x88, 12, periph)
/* pe1_scom4p2_out */
#define PE1_SCOM4P2_OUT        MCHP_PINMUX(e, 1, 0x414, 14, periph)
/* pe1_scom4p3_out */
#define PE1_SCOM4P3_OUT        MCHP_PINMUX(e, 1, 0x414, 13, periph)
/* pe1_scom5p0_out */
#define PE1_SCOM5P0_OUT        MCHP_PINMUX(e, 1, 0x418, 13, periph)
/* pe1_scom5p2_out */
#define PE1_SCOM5P2_OUT        MCHP_PINMUX(e, 1, 0x414, 16, periph)
/* pe1_scom5p3_in */
#define PE1_SCOM5P3_IN         MCHP_PINMUX(e, 1, 0x9c, 9, periph)
/* pe1_scom5p3_out */
#define PE1_SCOM5P3_OUT        MCHP_PINMUX(e, 1, 0x414, 15, periph)
/* pe1_tc0wo0g2_in */
#define PE1_TC0WO0G2_IN        MCHP_PINMUX(e, 1, 0xd0, 9, periph)
/* pe1_tc0wo0_out */
#define PE1_TC0WO0_OUT         MCHP_PINMUX(e, 1, 0x418, 21, periph)
/* pe1_tc0wo1g4_in */
#define PE1_TC0WO1G4_IN        MCHP_PINMUX(e, 1, 0xd8, 12, periph)
/* pe1_tc0wo1_out */
#define PE1_TC0WO1_OUT         MCHP_PINMUX(e, 1, 0x414, 24, periph)
/* pe1_tc1wo1g2_in */
#define PE1_TC1WO1G2_IN        MCHP_PINMUX(e, 1, 0xe4, 9, periph)
/* pe1_tc1wo1_out */
#define PE1_TC1WO1_OUT         MCHP_PINMUX(e, 1, 0x414, 25, periph)
/* pe1_tc2wo1g2_in */
#define PE1_TC2WO1G2_IN        MCHP_PINMUX(e, 1, 0xf4, 9, periph)
/* pe1_tc2wo1g4_in */
#define PE1_TC2WO1G4_IN        MCHP_PINMUX(e, 1, 0xf8, 12, periph)
/* pe1_tc2wo1_out */
#define PE1_TC2WO1_OUT         MCHP_PINMUX(e, 1, 0x414, 26, periph)
/* pe1_tc3wo1g2_in */
#define PE1_TC3WO1G2_IN        MCHP_PINMUX(e, 1, 0x104, 9, periph)
/* pe1_tc3wo1g4_in */
#define PE1_TC3WO1G4_IN        MCHP_PINMUX(e, 1, 0x108, 12, periph)
/* pe1_tc3wo1_out */
#define PE1_TC3WO1_OUT         MCHP_PINMUX(e, 1, 0x414, 27, periph)
/* pe1_tc4wo1g2_in */
#define PE1_TC4WO1G2_IN        MCHP_PINMUX(e, 1, 0x114, 9, periph)
/* pe1_tc4wo1g4_in */
#define PE1_TC4WO1G4_IN        MCHP_PINMUX(e, 1, 0x118, 12, periph)
/* pe1_tc4wo1_out */
#define PE1_TC4WO1_OUT         MCHP_PINMUX(e, 1, 0x414, 28, periph)
/* pe1_tc5wo1g2_in */
#define PE1_TC5WO1G2_IN        MCHP_PINMUX(e, 1, 0x124, 9, periph)
/* pe1_tc5wo1g4_in */
#define PE1_TC5WO1G4_IN        MCHP_PINMUX(e, 1, 0x128, 12, periph)
/* pe1_tc5wo1_out */
#define PE1_TC5WO1_OUT         MCHP_PINMUX(e, 1, 0x414, 29, periph)
/* pe1_tc6wo1g2_in */
#define PE1_TC6WO1G2_IN        MCHP_PINMUX(e, 1, 0x134, 9, periph)
/* pe1_tc6wo1g4_in */
#define PE1_TC6WO1G4_IN        MCHP_PINMUX(e, 1, 0x138, 12, periph)
/* pe1_tc6wo1_out */
#define PE1_TC6WO1_OUT         MCHP_PINMUX(e, 1, 0x414, 30, periph)
/* pe1_tc7wo1g2_in */
#define PE1_TC7WO1G2_IN        MCHP_PINMUX(e, 1, 0x144, 9, periph)
/* pe1_tc7wo1g4_in */
#define PE1_TC7WO1G4_IN        MCHP_PINMUX(e, 1, 0x148, 12, periph)
/* pe1_tc7wo1_out */
#define PE1_TC7WO1_OUT         MCHP_PINMUX(e, 1, 0x414, 31, periph)
/* pe1_tc8wo1g2_in */
#define PE1_TC8WO1G2_IN        MCHP_PINMUX(e, 1, 0x154, 9, periph)
/* pe1_tc8wo1_out */
#define PE1_TC8WO1_OUT         MCHP_PINMUX(e, 1, 0x414, 32, periph)
/* pe1_tc9wo0g2_in */
#define PE1_TC9WO0G2_IN        MCHP_PINMUX(e, 1, 0x15c, 9, periph)
/* pe1_tc9wo0g4_in */
#define PE1_TC9WO0G4_IN        MCHP_PINMUX(e, 1, 0x160, 12, periph)
/* pe1_tc9wo0_out */
#define PE1_TC9WO0_OUT         MCHP_PINMUX(e, 1, 0x414, 33, periph)
/* pe1_tcc0wo1_out */
#define PE1_TCC0WO1_OUT        MCHP_PINMUX(e, 1, 0x414, 17, periph)
/* pe1_tcc0wo3_out */
#define PE1_TCC0WO3_OUT        MCHP_PINMUX(e, 1, 0x414, 19, periph)
/* pe1_tcc0wo5_out */
#define PE1_TCC0WO5_OUT        MCHP_PINMUX(e, 1, 0x414, 18, periph)
/* pe1_tcc1wo1_out */
#define PE1_TCC1WO1_OUT        MCHP_PINMUX(e, 1, 0x414, 20, periph)
/* pe1_tcc1wo3_out */
#define PE1_TCC1WO3_OUT        MCHP_PINMUX(e, 1, 0x414, 22, periph)
/* pe1_tcc1wo5_out */
#define PE1_TCC1WO5_OUT        MCHP_PINMUX(e, 1, 0x414, 21, periph)
/* pe1_tcc2wo1_out */
#define PE1_TCC2WO1_OUT        MCHP_PINMUX(e, 1, 0x414, 23, periph)
/* pe1_tstbus2_out */
#define PE1_TSTBUS2_OUT        MCHP_PINMUX(e, 1, 0x418, 34, periph)
/* pe1_tstbus5_out */
#define PE1_TSTBUS5_OUT        MCHP_PINMUX(e, 1, 0x414, 38, periph)
/* pe1_tstbus6_out */
#define PE1_TSTBUS6_OUT        MCHP_PINMUX(e, 1, 0x418, 35, periph)
/* pe1_tstbus9_out */
#define PE1_TSTBUS9_OUT        MCHP_PINMUX(e, 1, 0x414, 39, periph)
/* pe2_ac_cmp0_out */
#define PE2_AC_CMP0_OUT        MCHP_PINMUX(e, 2, 0x41c, 40, periph)
/* pe2_ac_cmptrdy_out */
#define PE2_AC_CMPTRDY_OUT     MCHP_PINMUX(e, 2, 0x41c, 41, periph)
/* pe2_can1rx_in */
#define PE2_CAN1RX_IN          MCHP_PINMUX(e, 2, 0x190, 9, periph)
/* pe2_cclin2_in */
#define PE2_CCLIN2_IN          MCHP_PINMUX(e, 2, 0xbc, 9, periph)
/* pe2_cclin5_in */
#define PE2_CCLIN5_IN          MCHP_PINMUX(e, 2, 0xc8, 9, periph)
/* pe2_cclo0_out */
#define PE2_CCLO0_OUT          MCHP_PINMUX(e, 2, 0x41c, 1, periph)
/* pe2_extint2_in */
#define PE2_EXTINT2_IN         MCHP_PINMUX(e, 2, 0x8, 9, periph)
/* pe2_fectrl4_out */
#define PE2_FECTRL4_OUT        MCHP_PINMUX(e, 2, 0x41c, 42, periph)
/* pe2_gmac_tsucomp_out */
#define PE2_GMAC_TSUCOMP_OUT   MCHP_PINMUX(e, 2, 0x420, 14, periph)
/* pe2_qd0_out */
#define PE2_QD0_OUT            MCHP_PINMUX(e, 2, 0x41c, 36, periph)
/* pe2_qd1_out */
#define PE2_QD1_OUT            MCHP_PINMUX(e, 2, 0x41c, 35, periph)
/* pe2_qd3_in */
#define PE2_QD3_IN             MCHP_PINMUX(e, 2, 0xac, 9, periph)
/* pe2_qd3_out */
#define PE2_QD3_OUT            MCHP_PINMUX(e, 2, 0x41c, 37, periph)
/* pe2_qeiccmp0_out */
#define PE2_QEICCMP0_OUT       MCHP_PINMUX(e, 2, 0x420, 13, periph)
/* pe2_qeiindx0g3_in */
#define PE2_QEIINDX0G3_IN      MCHP_PINMUX(e, 2, 0x178, 9, periph)
