zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cx_bz/bz62/pic32cx2051bz62064-pinctrl.h
/* pe2_qeiqea0g3_in */
#define PE2_QEIQEA0G3_IN       MCHP_PINMUX(e, 2, 0x17c, 9, periph)
/* pe2_qeiqeb0g5_in */
#define PE2_QEIQEB0G5_IN       MCHP_PINMUX(e, 2, 0x188, 11, periph)
/* pe2_qspics_out */
#define PE2_QSPICS_OUT         MCHP_PINMUX(e, 2, 0x41c, 34, periph)
/* pe2_scom0p0_out */
#define PE2_SCOM0P0_OUT        MCHP_PINMUX(e, 2, 0x41c, 2, periph)
/* pe2_scom0p3_out */
#define PE2_SCOM0P3_OUT        MCHP_PINMUX(e, 2, 0x41c, 3, periph)
/* pe2_scom1p0_in */
#define PE2_SCOM1P0_IN         MCHP_PINMUX(e, 2, 0x50, 9, periph)
/* pe2_scom1p0_out */
#define PE2_SCOM1P0_OUT        MCHP_PINMUX(e, 2, 0x41c, 5, periph)
/* pe2_scom1p2_out */
#define PE2_SCOM1P2_OUT        MCHP_PINMUX(e, 2, 0x41c, 4, periph)
/* pe2_scom1p3_out */
#define PE2_SCOM1P3_OUT        MCHP_PINMUX(e, 2, 0x41c, 6, periph)
/* pe2_scom2p0_out */
#define PE2_SCOM2P0_OUT        MCHP_PINMUX(e, 2, 0x41c, 7, periph)
/* pe2_scom2p3_out */
#define PE2_SCOM2P3_OUT        MCHP_PINMUX(e, 2, 0x41c, 8, periph)
/* pe2_scom3p0_in */
#define PE2_SCOM3P0_IN         MCHP_PINMUX(e, 2, 0x70, 9, periph)
/* pe2_scom3p0_out */
#define PE2_SCOM3P0_OUT        MCHP_PINMUX(e, 2, 0x41c, 10, periph)
/* pe2_scom3p2_out */
#define PE2_SCOM3P2_OUT        MCHP_PINMUX(e, 2, 0x41c, 9, periph)
/* pe2_scom3p3_out */
#define PE2_SCOM3P3_OUT        MCHP_PINMUX(e, 2, 0x41c, 11, periph)
/* pe2_scom4p0_out */
#define PE2_SCOM4P0_OUT        MCHP_PINMUX(e, 2, 0x41c, 12, periph)
/* pe2_scom4p3_out */
#define PE2_SCOM4P3_OUT        MCHP_PINMUX(e, 2, 0x41c, 13, periph)
/* pe2_scom5p0_in */
#define PE2_SCOM5P0_IN         MCHP_PINMUX(e, 2, 0x90, 9, periph)
/* pe2_scom5p0_out */
#define PE2_SCOM5P0_OUT        MCHP_PINMUX(e, 2, 0x41c, 15, periph)
/* pe2_scom5p2_out */
#define PE2_SCOM5P2_OUT        MCHP_PINMUX(e, 2, 0x41c, 14, periph)
/* pe2_scom5p3_out */
#define PE2_SCOM5P3_OUT        MCHP_PINMUX(e, 2, 0x41c, 16, periph)
/* pe2_tc0wo0_out */
#define PE2_TC0WO0_OUT         MCHP_PINMUX(e, 2, 0x41c, 24, periph)
/* pe2_tc0wo1g3_in */
#define PE2_TC0WO1G3_IN        MCHP_PINMUX(e, 2, 0xd4, 9, periph)
/* pe2_tc1wo0_out */
#define PE2_TC1WO0_OUT         MCHP_PINMUX(e, 2, 0x41c, 25, periph)
/* pe2_tc2wo0g3_in */
#define PE2_TC2WO0G3_IN        MCHP_PINMUX(e, 2, 0xf0, 9, periph)
/* pe2_tc2wo0_out */
#define PE2_TC2WO0_OUT         MCHP_PINMUX(e, 2, 0x41c, 26, periph)
/* pe2_tc3wo0g3_in */
#define PE2_TC3WO0G3_IN        MCHP_PINMUX(e, 2, 0x100, 9, periph)
/* pe2_tc3wo0_out */
#define PE2_TC3WO0_OUT         MCHP_PINMUX(e, 2, 0x41c, 27, periph)
/* pe2_tc4wo0g3_in */
#define PE2_TC4WO0G3_IN        MCHP_PINMUX(e, 2, 0x110, 9, periph)
/* pe2_tc4wo0_out */
#define PE2_TC4WO0_OUT         MCHP_PINMUX(e, 2, 0x41c, 28, periph)
/* pe2_tc5wo0g3_in */
#define PE2_TC5WO0G3_IN        MCHP_PINMUX(e, 2, 0x120, 9, periph)
/* pe2_tc5wo0_out */
#define PE2_TC5WO0_OUT         MCHP_PINMUX(e, 2, 0x41c, 29, periph)
/* pe2_tc6wo0g3_in */
#define PE2_TC6WO0G3_IN        MCHP_PINMUX(e, 2, 0x130, 9, periph)
/* pe2_tc6wo0_out */
#define PE2_TC6WO0_OUT         MCHP_PINMUX(e, 2, 0x41c, 30, periph)
/* pe2_tc7wo0g3_in */
#define PE2_TC7WO0G3_IN        MCHP_PINMUX(e, 2, 0x140, 9, periph)
/* pe2_tc7wo0_out */
#define PE2_TC7WO0_OUT         MCHP_PINMUX(e, 2, 0x41c, 31, periph)
/* pe2_tc8wo0g3_in */
#define PE2_TC8WO0G3_IN        MCHP_PINMUX(e, 2, 0x150, 9, periph)
/* pe2_tc8wo0_out */
#define PE2_TC8WO0_OUT         MCHP_PINMUX(e, 2, 0x41c, 32, periph)
/* pe2_tc8wo1g5_in */
#define PE2_TC8WO1G5_IN        MCHP_PINMUX(e, 2, 0x158, 11, periph)
/* pe2_tc8wo1_out */
#define PE2_TC8WO1_OUT         MCHP_PINMUX(e, 2, 0x420, 10, periph)
/* pe2_tc9wo1g3_in */
#define PE2_TC9WO1G3_IN        MCHP_PINMUX(e, 2, 0x164, 9, periph)
/* pe2_tc9wo1g5_in */
#define PE2_TC9WO1G5_IN        MCHP_PINMUX(e, 2, 0x168, 11, periph)
/* pe2_tc9wo1_out */
#define PE2_TC9WO1_OUT         MCHP_PINMUX(e, 2, 0x41c, 33, periph)
/* pe2_tcc0wo0_out */
#define PE2_TCC0WO0_OUT        MCHP_PINMUX(e, 2, 0x41c, 18, periph)
/* pe2_tcc0wo1_out */
#define PE2_TCC0WO1_OUT        MCHP_PINMUX(e, 2, 0x420, 6, periph)
/* pe2_tcc0wo2_out */
#define PE2_TCC0WO2_OUT        MCHP_PINMUX(e, 2, 0x41c, 17, periph)
/* pe2_tcc0wo4_out */
#define PE2_TCC0WO4_OUT        MCHP_PINMUX(e, 2, 0x41c, 19, periph)
/* pe2_tcc1wo0_out */
#define PE2_TCC1WO0_OUT        MCHP_PINMUX(e, 2, 0x41c, 21, periph)
/* pe2_tcc1wo1_out */
#define PE2_TCC1WO1_OUT        MCHP_PINMUX(e, 2, 0x420, 9, periph)
/* pe2_tcc1wo2_out */
#define PE2_TCC1WO2_OUT        MCHP_PINMUX(e, 2, 0x41c, 20, periph)
/* pe2_tcc1wo4_out */
#define PE2_TCC1WO4_OUT        MCHP_PINMUX(e, 2, 0x41c, 22, periph)
/* pe2_tcc2wo0_out */
#define PE2_TCC2WO0_OUT        MCHP_PINMUX(e, 2, 0x41c, 23, periph)
/* pe2_tstbus1_out */
#define PE2_TSTBUS1_OUT        MCHP_PINMUX(e, 2, 0x41c, 38, periph)
/* pe2_tstbus3_out */
#define PE2_TSTBUS3_OUT        MCHP_PINMUX(e, 2, 0x420, 15, periph)
/* pe2_tstbus7_out */
#define PE2_TSTBUS7_OUT        MCHP_PINMUX(e, 2, 0x420, 16, periph)
/* pe2_tstbus10_out */
#define PE2_TSTBUS10_OUT       MCHP_PINMUX(e, 2, 0x41c, 39, periph)
/* pe2_tstbus11_out */
#define PE2_TSTBUS11_OUT       MCHP_PINMUX(e, 2, 0x420, 17, periph)

#endif /* MICROCHIP_PIC32CX2051BZ62064_PINCTRL_H_ */
